{"meta":{"title":"Tech Art Learning","subtitle":"","description":"","author":"Xingyu Lei","url":"https://www.xingyulei.com","root":"/"},"pages":[{"title":"404 Page Not Found","date":"2023-04-10T01:32:29.910Z","updated":"2022-04-10T15:19:16.000Z","comments":false,"path":"/404.html","permalink":"https://www.xingyulei.com/404.html","excerpt":"","text":""},{"title":"","date":"2023-10-26T16:54:23.231Z","updated":"2023-10-26T16:54:23.231Z","comments":true,"path":"about/privacy.html","permalink":"https://www.xingyulei.com/about/privacy.html","excerpt":"","text":"Web Site Terms and Conditions of Use 1. Terms By accessing this web site, you are agreeing to be bound by these web site Terms and Conditions of Use, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site. The materials contained in this web site are protected by applicable copyright and trade mark law. 2. Use License Permission is granted to temporarily download one copy of the materials (information or software) on Tech Art Learning's web site for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not: modify or copy the materials; use the materials for any commercial purpose, or for any public display (commercial or non-commercial); attempt to decompile or reverse engineer any software contained on Tech Art Learning's web site; remove any copyright or other proprietary notations from the materials; or transfer the materials to another person or \"mirror\" the materials on any other server. This license shall automatically terminate if you violate any of these restrictions and may be terminated by Tech Art Learning at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format. 3. Disclaimer The materials on Tech Art Learning's web site are provided \"as is\". Tech Art Learning makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, Tech Art Learning does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its Internet web site or otherwise relating to such materials or on any sites linked to this site. 4. Limitations In no event shall Tech Art Learning or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption,) arising out of the use or inability to use the materials on Tech Art Learning's Internet site, even if Tech Art Learning or a Tech Art Learning authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you. 5. Revisions and Errata The materials appearing on Tech Art Learning's web site could include technical, typographical, or photographic errors. Tech Art Learning does not warrant that any of the materials on its web site are accurate, complete, or current. Tech Art Learning may make changes to the materials contained on its web site at any time without notice. Tech Art Learning does not, however, make any commitment to update the materials. 6. Links Tech Art Learning has not reviewed all of the sites linked to its Internet web site and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by Tech Art Learning of the site. Use of any such linked web site is at the user's own risk. 7. Site Terms of Use Modifications Tech Art Learning may revise these terms of use for its web site at any time without notice. By using this web site you are agreeing to be bound by the then current version of these Terms and Conditions of Use. 8. Governing Law Any claim relating to Tech Art Learning's web site shall be governed by the laws of the State of california without regard to its conflict of law provisions. General Terms and Conditions applicable to Use of a Web Site. Privacy Policy Your privacy is very important to us. Accordingly, we have developed this Policy in order for you to understand how we collect, use, communicate and disclose and make use of personal information. The following outlines our privacy policy. Before or at the time of collecting personal information, we will identify the purposes for which information is being collected. We will collect and use of personal information solely with the objective of fulfilling those purposes specified by us and for other compatible purposes, unless we obtain the consent of the individual concerned or as required by law. We will only retain personal information as long as necessary for the fulfillment of those purposes. We will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned. Personal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date. We will protect personal information by reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification. We will make readily available to customers information about our policies and practices relating to the management of personal information. We are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained."},{"title":"Xingyu Lei","date":"2023-10-25T00:28:40.272Z","updated":"2023-10-25T00:28:40.272Z","comments":false,"path":"about/index.html","permalink":"https://www.xingyulei.com/about/index.html","excerpt":"","text":"⭐️ Crazy for Technical Art Self-motivated learner, critical thinker and problem solver Senior Technical Artist 🎮 &emsp; PlayStation, SIE [Apr 2023 - Present] Un-announced Project Design and build a UE5 game cinematics pipeline from scratch Optimize and develop Maya and MotionBuilder Animation tools and workflow Cross-department coordination, code review, new-hire training Technical Artist 🎮 &emsp; PlayStation, SIE [Jan 2021 - Apr 2023] The Last of Us: Part I Engine optimization on framerate and memory Develop and maintain a tool ecosystem that closely supports Naughty Dog across multiple departments: including Character Library, Pose Library, Engine Capture tool and more Virtual face tracking, technical scene prep, rigging QC, PC and PS5 devkit setup Computer Graphics Research Assistant 📚 &emsp; Purdue University [Sep 2018 - Dec 2020] Developed a state-machine-based procedural animation system in Unity and integration with a machine-learning-based emotion recognition module Created automation tool for character rigging and mocap retargeting Technical Documentation and Research Paper Drafting CFX TD 🎨 &emsp; Blur Studio [May - July 2020] [Jun - Aug 2019] CFX pipeline development and optimization Tool development: hair QC, Qualoth IO, version comparer, soft modification, camera toolkit and more Delivered over 70 shots of cloth/hair simulation using Maya and 3dsMax Works The Last of Us: Part I 2022 Love Death & Robots 2020 Call of Duty: Modern Warefare 2019"},{"title":"Books","date":"2023-04-10T01:32:29.926Z","updated":"2022-04-10T15:41:14.000Z","comments":false,"path":"books/index.html","permalink":"https://www.xingyulei.com/books/index.html","excerpt":"","text":""},{"title":"Categories","date":"2023-04-10T01:32:29.926Z","updated":"2022-04-10T15:19:44.000Z","comments":false,"path":"categories/index.html","permalink":"https://www.xingyulei.com/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2023-04-10T01:32:29.958Z","updated":"2021-02-07T16:58:06.000Z","comments":false,"path":"tags/index.html","permalink":"https://www.xingyulei.com/tags/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2023-04-10T01:32:29.942Z","updated":"2021-02-07T16:58:06.000Z","comments":false,"path":"repository/index.html","permalink":"https://www.xingyulei.com/repository/index.html","excerpt":"","text":""},{"title":"Links","date":"2023-04-10T01:32:29.942Z","updated":"2022-04-25T03:45:58.000Z","comments":true,"path":"links/index.html","permalink":"https://www.xingyulei.com/links/index.html","excerpt":"","text":""}],"posts":[{"title":"Write Metadata in Unreal: Integration in Blueprint-Driven Workflows","slug":"ue-metadata","date":"2023-10-13T07:00:00.000Z","updated":"2023-10-21T05:46:38.203Z","comments":true,"path":"post/ue-metadata/","link":"","permalink":"https://www.xingyulei.com/post/ue-metadata/","excerpt":"","text":"Introduction In the world of digital workflows, handling metadata is a common practice. In most CG pipelines, metadata is stored in external text files, allowing tools to easily read and write data. But when dealing with Unreal Engine, which operates predominantly in real-time, the challenge arises to access metadata through Blueprint scripting, requiring the metadata to be in Unreal’s native format. After some research, I came across a proposal from a staff member in the Unreal Developer Community. In this article, we’ll explore the different methods from the proposal and discuss the approach I’ve settled on. Data Table Data tables offer a flexible way to structure data. However, it’s important to note that you need to define the data structure in advance to use them effectively To have a working data table we need to first create a data structure where each entry of the data table will conform to. Data Table (left) with corresponding Data Structure (right) How to Read Data Table 1234567891011121314import unrealdt_path = r&#x27;/Game/Cinematics/Metadata/DT_TestMetadata.DT_TestMetadata&#x27;dt = unreal.EditorAssetLibrary.find_asset_data(dt_path).get_asset()col_name = &quot;Version&quot; row_names = unreal.DataTableFunctionLibrary.get_data_table_row_names(dt)positions = unreal.DataTableFunctionLibrary.get_data_table_column_as_string(dt, col_name)for idx, col in enumerate(positions): print(f&quot;&#123;row_names[idx]&#125; - &#123;col_name&#125;: &#123;col&#125;&quot;)# entry1 - Version: 2# entry2 - Version: 0 How to Write Data Table It seems like data tables are ready-only at first, as there are only get_data function sets: https://forums.unrealengine.com/t/set-data-table-row/85844 However, there are in fact a way to write to data table, and that is with the use of .csv or .json. 12unreal.DataTableFunctionLibrary.fill_data_table_from_json_file(data_table, json_file_path, data_structure)unreal.EditorAssetLibrary.save_loaded_asset(data_table, True) I won’t go into how to update .csv or .json files, but do note that the formatting of the text file is important, and you can get a reference of what the file would look at by simply export out the data table with some test data like so: Metadata To access metadat for each asset, you can do a right-click “Asset Actions”, “Show Metadata”. This is quite handy since, based on our need, it can be bound to an asset. And if we want to separate the binding between the asset and the data, we can also do so by creating an empty blueprint asset and use it as a central container to store metadata. The limitation however is that all the values are string type. How to Read Metadata 123456789101112import unrealu_asset_path = r&#x27;/Game/LevelPrototyping/Meshes/SM_ChamferCube.SM_ChamferCube&#x27;asset = unreal.EditorAssetLibrary.find_asset_data(u_asset_path).get_asset()map = unreal.EditorAssetLibrary.get_metadata_tag_values(asset)print(map)# &#123;&quot;version&quot;: &quot;4&quot;&#125;value = unreal.EditorAssetLibrary.get_metadata_tag(asset, &quot;version&quot;)print(value)# 4 How to Write Metadata We can also easily set and remove the metadata tag and values like so. 1234unreal.EditorAssetLibrary.set_metadata_tag(asset, &quot;version&quot;, &quot;4&quot;)unreal.EditorAssetLibrary.save_asset(u_asset_path)unreal.EditorAssetLibrary.remove_metadata_tag(asset, &quot;version&quot;) Blueprint Variable And lastly, I want to introduce the approach I ended up with: map variable in a custom blueprint asset. We first create a Blueprint asset using the basic Object class, and then add our custom ‘Version’ variable as a string: integer map this is basically equivalent to: 1&quot;Version&quot;: &#123;str: int&#125; Through scripting, we first need to get the default class object of the blueprint, which can be achieved like so: 12345678910import unrealu_bp_path = r&#x27;/asset_path&#x27;u_bp = unreal.EditorAssetLibrary.find_asset_data(u_bp_path).get_asset()# generated classu_bp_generated = unreal.load_object(None, u_bp.generated_class().get_path_name())# dcou_bp_dco = unreal.get_default_object(u_bp_generated) The advantage here lies in having a single blueprint asset capable of storing numerous variables, each natively typed to Unreal. Nevertheless, I haven’t yet attempted to create variables solely through code. How to Read Blueprint Variable 1234567def get_version(dco, name): try: version = dco.get_editor_property(&#x27;version&#x27;)[name] except KeyError: print(&#x27;no &#123;&#125; key&#x27;.format(name)) return version How to Write Blueprint Variable Note that we use the get_editor_property() to set the metadata 123456789def set_version(dco, name, version): try: u_bp_dco.get_editor_property(&#x27;version&#x27;)[name] = version except TypeError as e: print(&#x27;TypeError: &#123;&#125; of &#123;&#125; incorrect, &#123;&#125;&#x27;.format(type(version), version, e)) return False unreal.EditorAssetLibrary.save_asset(bp_path) return True Example Since, this approach is the one I have experimented the furthest along, here’s an example on how I access it in another Blueprint: Another way is to use ‘Get Class Default Object’ and ‘Cast To BP Test Metadata’ which return ‘As BP Test Metadata’ and can then access the “Version” variable. References Unreal Forum - How to store text data with Python? Unreal Forum - Reimport DataTable(csv) with python Unreal Forum - Reading a DataTable’s Values with Python","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Customize Windows 10/11 Right-click Context Menu","slug":"py-win-contextmenu","date":"2023-08-29T07:00:00.000Z","updated":"2023-09-02T17:57:40.751Z","comments":true,"path":"post/py-win-contextmenu/","link":"","permalink":"https://www.xingyulei.com/post/py-win-contextmenu/","excerpt":"","text":"Introduction It’s been a while, today we have a pretty awesome content to explore that is how we can create the right-click context menu in Windows. I found that there’s not a lot of comprehensive and up-to-date tutorial on this subject for tech artists, but this would be a really powerful tool to speed up any types of workflow that involves going into Windows Explorer. (for example, right-click on a file and have a shortcut to get its perforce depot info) And the best thing is: it’s super easy to follow, certainly much easier than learning how to create a context menu in Qt. Registry Setup Everything regards to the Windows context menu setup is done within the Windows Registry Editor. Hierarchy First I’m gonna do an example of manual implementation. we’ll want to navigate to this path for now: HKEY_CURRENT_USER\\Software\\Classes\\directory\\Background\\shell (we’ll explain this later here) right-click on the ‘Background’ key/folder and create a new ‘key’ named ‘shell’ if there isn’t one already create a key under ‘shell’ (I named mine ‘test_menu’) and then create a key under it called ‘command’ Field Next we’ll want to modify the field of those keys, in the menu item key (in my case the ‘test_menu’) there are some optional fields we can add customize the appearance of our menu item. The following are some optional String Field: (To add field, right-click on the right panel, ‘New’ - ‘String Value’ ) MUIVerb: The display name of the menu item, if this is not set, the name will default to the key name (i.e. “test_menu” in our case) Icon: For displaying icon, the data should be set as the icon path, common format for the icons are .ico and .dll Position: changes the location of the menu item, e.g. “Top”, “Bottom” Setting up Command Finally, we’ll want to modify the command key’s field, so it can actually perform custom operations. Go to the {Default} and edit the Data to whatever operation we would like to perform when clicking this menu item. The syntax would be an execution command similar to ones we would put in command prompt or a .bat file. Running Python Script Here’s an example to run python script: In the Data section we would put: &quot;path to python.exe&quot; &quot;path to python script.py&quot; Passing Argument In order to pass in arguments, such as the directory or the file where the menu was initiated. We add %v for directory and %1 for file path at the end of the command Data: e.g. &quot;D:/python39/python.exe&quot; &quot;D:/p4clipboard.py&quot; &quot;%1&quot; be aware of the slashes if you would like to debug your python script and not make it close immediately after execution simply add -i flag after the &quot;python.exe&quot; And within the p4clipboard.py file, we can parse the argument passed in as such: 12345678910111213# converts the selected file to its perforce depot path and add to clipboardimport sysimport p4Util # this is a mock p4 moduleimport winUtil # also a mock moduleif __name__ == &#x27;__main__&#x27;: selected_file = sys.argv[1] with p4Util.connect(): p4_path = p4Util.get_depot_path(selected_file) winUtil.copy_to_clip(p4_path) Python Registry Automation The above examples are very cool, but requires a lot of manual set up, we can leverage Python to set up the registry entries for us. 12345678910111213141516171819202122# example from: https://github.com/seddie95/folder_organizer/blob/master/make_key.pyimport osimport sysimport winreg as regpython_exe = sys.executablescript_path = r&quot;D:\\test.py&quot;reg_root_path = r&#x27;Directory\\\\Background\\\\shell&#x27;reg_root = reg.OpenKey(reg.HKEY_CLASSES_ROOT, reg_root_path, 0, reg.KEY_ALL_ACCESS)reg_menu = reg.CreateKey(reg_root, r&quot;test_menu\\\\&quot;)reg.SetValue(reg_menu, &#x27;MUIVerb&#x27;, reg.REG_SZ, &#x27;this is my test menu&#x27;)reg.CloseKey(reg_menu)reg_root = reg.OpenKey(reg.HKEY_CLASSES_ROOT, reg_root_path, 0, reg.KEY_ALL_ACCESS)reg_menu_command = reg.CreateKey(reg_root, r&quot;test_menu\\\\command&quot;)reg.SetValue(reg_menu_command, &#x27;&#x27;, reg.REG_SZ, &quot;&#123;&#125; &#123;&#125; %v&quot;.format(python_exe, script_path))reg.CloseKey(reg_menu_command) Reg File Another way to transfer out the registry setup is by exporting out from registry editor directly to a .reg file. This can be done by simply selecting the top key and right-click and select ‘Export’; the .reg file is a text based file. Cascade Menu How should we go about implementing a multi-layered menu? I found a lot of examples online that are either complicated/messy or not working at all. Eventually I’ve come across this blog explaining what I think is the ideal way to implement Cascading menu. It keeps everything in one place, has this clean and easy to understand hierarchy, and very easy. Essentially, we only need to add one additional field on the top level menu item called: subcommands, and we then keep all the children menu item nested within it like what we have previously done. (An example of the full hierarchy breakdown) Target Type Different context menu triggering condition requires editing different registry keys, This goes the same for different user group (registration visible to the current user vs. affecting globally to the machine). Background: when right-click on the backdrop of the explorer or desktop if you are administrator HKEY_CLASSES_ROOT\\Directory\\Background\\shell if you are a normal user HKEY_CURRENT_USER\\Software\\Classes\\directory\\Background\\shell Folder: when right-click on a folder in the explorer or desktop if you are administrator HKEY_CLASSES_ROOT\\Directory\\shell if you are a normal user HKEY_CURRENT_USER\\Software\\Classes\\directory\\shell File: when right-click on a file in the explorer or desktop if you are administrator HKEY_CLASSES_ROOT\\*\\shell if you are a normal user HKEY_CURRENT_USER\\Software\\Classes\\*\\shell File Type Association: when right-click on a specific file type: if you are administrator: HKEY_LOCAL_MACHINE\\Software\\Classes\\SystemFileAssociations\\&#123;.format&#125;\\shell if you are a normal user: HKEY_CURRENT_USER\\Software\\Classes\\SystemFileAssociations\\&#123;.format&#125;\\shell Noteworthy Mentions To further customize the context menu, we might be interested with adding separators between menu items, also having specific order or menu items. These can all be achieved quite easily described in Sverrir’s Blog which I’ve linked below. Furthermore, there are also menu item with toggle box or check box; these are not explored as of now. References Stack Overflow - How add context menu item to Windows Explorer for folders Notion - Creating a context menu with sub-menu for Windows for a specific file extension Stack Overflow - Add menu item to Windows context menu only for specific filetype Sverrir’s Blog - Creating Cascading Menu Items in Windows Explorer 7, 8, 8.1 &amp; 10 Microsoft - Enhancing the “Open Command Prompt here” Context Menu experience","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"windows","slug":"windows","permalink":"https://www.xingyulei.com/tags/windows/"}]},{"title":"Run Maya Batch Mode in 2023!","slug":"maya-batch-mode-2","date":"2023-05-06T07:00:00.000Z","updated":"2023-09-02T17:52:23.962Z","comments":true,"path":"post/maya-batch-mode-2/","link":"","permalink":"https://www.xingyulei.com/post/maya-batch-mode-2/","excerpt":"","text":"I’m reviving a post from exactly 4 years ago ⌛️. It was severely flawed since it was one of my earliest post while I’m still learning my ways around Maya. Standalone Module 12import maya.standalonemaya.standalone.initialize(name=&#x27;python&#x27;) Using mayapy Interpreter I strongly recommend using mayapy in order to stay consistent with the behaviour of GUI maya. Prefer using mayapy: Maya’s own python interpreter, this ensures all the libraries and plugins are compatible, it also saves some trouble configuring environments. Using External Python Interpreter When using external interpreter for whatever reason, we’ll need to check: The python interpreter should match the maya python version e.g. (python27 for Maya 2018) System environment variable will need to set up in order to find maya modules Otherwise, we may encounter the following: 1ImportError: No module named maya.standalone To configure the environment for our external interpreter: 1234567891011121314151617181920import sysimport osMAYA_LOCATION = &quot;C:/Program Files/Autodesk/Maya2018&quot;PYTHON_LOCATION = MAYA_LOCATION + &quot;/Python/Lib/site-packages&quot;os.environ[&quot;MAYA_LOCATION&quot;] = MAYA_LOCATIONos.environ[&quot;PYTHONPATH&quot;] = PYTHON_LOCATIONsys.path.append(MAYA_LOCATION)sys.path.append(PYTHON_LOCATION)sys.path.append(MAYA_LOCATION+&quot;/bin&quot;)sys.path.append(MAYA_LOCATION+&quot;/lib&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/DLLs&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/Lib&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/Lib/plat-win&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/Lib/lib-tk&quot;)print(&#x27;\\n&#x27;.join(sys.path)) Making Our First Standalone Script After maya.standalone has initialized, we can import maya.cmds as usual. Let’s add a test function to our standalone script. 12345678910111213import maya.cmds as cmdsdef test(): maya_file_to_open = r&quot;C:\\Users\\Lei\\Desktop\\test.ma&quot; cmds.file(maya_file_to_open, o=True) # import a file and rename maya_file_to_import = r&quot;C:\\Users\\Lei\\Desktop\\import.ma&quot; cmds.file(maya_file_to_import, i=True, type=&quot;mayaAscii&quot;) temp_name = r&quot;C:\\Users\\Lei\\Desktop\\temp.ma&quot; cmds.file(rename=temp_name) cmds.file(force=True, save=True, options=&#x27;v=1;p=17&#x27;, type=&#x27;mayaBinary&#x27;) This test function opens a maya file on my desktop and import a maya file and save out as another file. Execution Here I’m using mayapy as example, we can of course using the external python interpreter, but again, it takes extra steps. Execute from Command Line make sure to add mayapy to our system environment variable. in system variable: add C:\\Program Files\\Autodesk\\Maya2018\\bin to Path open command prompt, and enter mayapy [directoryTo/firstStandalone.py] Execute using subprocess We can do it without going to command line, but by executing another .py using subprocess 123456789101112import subprocessmayapy = r&#x27;C:\\Program Files\\Autodesk\\Maya2018\\bin\\mayapy.exe&#x27;script = r&#x27;[directory/firstStandalone.py]&#x27;process = subprocess.Popen( [mayapy, script], stdout=subprocess.PIPE, stderr=subprocess.STDOUT, env=env)out, error = process.communicate() Here I’m removing the environment setup in firstStandlone.py, and add a wrapper: 12345678910111213141516171819202122232425262728import loggingimport tracebackimport maya.standalonemaya.standalone.initialize(name=&#x27;python&#x27;)import maya.cmds as cmdsdef test(): maya_file_to_open = r&quot;C:\\Users\\Lei\\Desktop\\test.ma&quot; cmds.file(maya_file_to_open, o=True) # import a file and rename maya_file_to_import = r&quot;C:\\Users\\Lei\\Desktop\\import.ma&quot; cmds.file(maya_file_to_import, i=True, type=&quot;mayaAscii&quot;) temp_name = r&quot;C:\\Users\\Lei\\Desktop\\temp.ma&quot; cmds.file(rename=temp_name) cmds.file(force=True, save=True, options=&#x27;v=1;p=17&#x27;, type=&#x27;mayaBinary&#x27;)if __name__ == &#x27;__main__&#x27;: try: cmds.evalDeferred(runMode) except: logging.error(traceback.print_exc()) Standalone Script with Arguments Sometimes, we would want to pass arguments to our standalone script Using sys.argv 1234import sysfile_path = sys.argv[1]file_name = sys.argv[2] Example from Toadstorm Nerdblog: 1234567891011121314151617181920212223242526272829import subprocessmaya_path = &#x27;directory/mayapy.exe&#x27; # mayapy or full path to mayapy.exescript_path = &#x27;directory/firstStandalone.py&#x27;def add_layer(file_names,layer_name): for file_name in file_names: command = r&#x27;mayapy &#123;&#125; &#123;&#125; &#123;&#125;&#x27;.format( script_path, file_name, layer_name ) process = subprocess.Popen( command, stdout=subprocess.PIPE, stderr=subprocess.PIPE ) process.wait() print(process.returncode) # this return the message from cmd if __name__ == &#x27;__main__&#x27;: # define a list of filenames to iterate through files = [&#x27;file1&#x27;, &#x27;file2&#x27;, &#x27;file3&#x27;] render_layer = &#x27;a new render layer&#x27; # run procedure, assuming you&#x27;ve already defined it add_layer(files, render_layer) Using argparser In the commandline launch script, add argment: 123456789101112import subprocess...scene = r&quot;C:\\Users\\Lei\\Desktop\\test.ma&quot;process = subprocess.Popen( [mayapy, script, &#x27;scene=&#123;&#125;&#x27;.format(scene)], stdout=subprocess.PIPE, stderr=subprocess.STDOUT, env=env)out, error = process.communicate() And then in the wrapper, use the ArgumentParser() 1234567891011import argparseparser = argparse.ArgumentParser()parser.add_argument(&#x27;scene&#x27;)command_line_args = parser.parse_args()SCENE = command_line_args.scenedef example(): cmds.file(SCENE, open=True, force=True) ... Bonus: Integrate UI Elements from Qt It is easy to integrate UI in a standalone tool by creating a QApplication instance, and for Maya GUI, Maya has QApplication instance already created. but for maya standalone script, we need to make sure to create a QApplication instance before the standalone initialization: 1234567891011import sysfrom Qt import QtWidgetsapp = QtWidgets.QApplication(sys.argv)import maya.standalonemaya.standalone.initialize()... Depending on our tool need, usually standalone script wouldn’t block the main event loop, so we just exit when finished, therefore, no need to add sys.exit(app.exec_()) Bonus: Copying GUI Maya Environment To get the exact environment as the GUI Maya version (this could be useful if there’s any startup scripts that modifies the environment) In the maya session, parse out the environment and save it as a dictionary: 123import osenv_dict = dict(os.environ) And in the commandline setup .py, apply the environment from the dictionary: 12345678910env_dict_copy_from_maya = &#123;&#x27;TEST&#x27;: &#x27;THIS IS A TEST&#x27;&#125;current_env = os.environ.copy()for key, value in env_dict_copy_from_maya.items(): current_env[key] = valueprocess = subprocess.Popen( ..., env=current_env) Reference Xingyu Lei - Save Time and Boost Efficiency: Learn to Run Maya in Batch Mode Stack Overflow - maya standalone with pyside2 Tech-Artist Org - Import maya.standalone problem Stack Overflow - use external python script to open maya and run another script inside maya Stack Overflow - How to use an external interpreter for Maya? Toadstorm Nerdblog - Python in Maya Standalone","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Object-Oriented Design: A Comprehensive Guide to Building Robust and Scalable Software Systems","slug":"general-oo-design","date":"2023-04-02T07:00:00.000Z","updated":"2023-09-02T17:47:49.884Z","comments":true,"path":"post/general-oo-design/","link":"","permalink":"https://www.xingyulei.com/post/general-oo-design/","excerpt":"","text":"This blog is a second processed product/summary of the tutorial series: Linkedin Learning: Object-Oriented Programming. Bullet points extracted by me and reformatted with help from ChatGPT. Object-oriented design is a fundamental concept in software development that focuses on modeling the behavior and characteristics of real-world objects in a program. By understanding the basics of object identity, properties and attributes, behavior, and class, developers can create well-designed, efficient, and maintainable software. Introduction Object Identity: Objects are unique entities within a program that are separate and distinguishable from one another, even if they belong to the same class or type. Each object has a unique identifier that differentiates it from other objects, and this identity is essential for managing and manipulating objects within a program. Properties and Attributes: Objects have properties or attributes that define their characteristics, such as size, weight, color, and shape. These attributes are essential for representing real-world objects in a program and can be used to distinguish between different objects of the same type. Behavior: Objects have behavior or actions that they can perform, such as filling, swimming, or ringing. Behavior is typically defined as methods or functions that manipulate an object’s attributes or interact with other objects in the program. One of the challenges of object-oriented design is identifying what can be an object in a program. In general, objects should be represented by nouns and not verbs, and they should have a unique identity, attributes, and behavior. The focus should be on identifying the main objects in the program and their interactions with one another. A class is a template for creating objects in a program. It defines the name, type, attributes, and behavior of objects that belong to that class. A class can be used to create multiple objects of the same type and is an essential component of object-oriented design. Steps for Object-Oriented Design The process of object-oriented design involves analyzing and designing the program before writing the code. This includes gathering requirements, describing the application, identifying the main objects, describing the interactions between objects, and creating a class diagram using Unified Modeling Language (UML). Software/System Requirements In object-oriented design, understanding the software/system requirements is essential for creating a well-designed, efficient, and maintainable program. Sets of Requirements Software/system requirements can be divided into two sets of questions: what does it need to do? how should it do it? The first set of questions refers to the functionality of the program, while the second set refers to performance, legal, support, and security requirements. Function Requirements: refer to what the system/application must do. These requirements capture the bare necessities of the program and define the core functionality that the program needs to provide. Non-Functional Requirements: define how the system/application should do something. These requirements are concerned with aspects such as usability, reliability, performance, supportability, design, implementation, interface, and physical constraints. FURPS Requirement Model The FURPS requirement model is a framework for thinking about software/system requirements. FURPS stands for functionality, usability, reliability, performance, and supportability. Functionality refers to the capabilities of the system, while the other four elements are non-functional requirements. Usability focuses on the user and include factors such as human factors UI and documentation. The usability of the program is essential for ensuring that users can efficiently and effectively use the system. Reliability is concerned with predictability, availability, and failure rate. These requirements ensure that the program operates consistently and reliably. Performance relates to speed, efficiency, and limitations. These requirements ensure that the program operates efficiently and effectively, even when processing large amounts of data. Supportability is concerned with extensibility, configurability, and testability. These requirements ensure that the program can be maintained and updated over time. Design, Implementation, Interface, and Physical Constraints In addition to the FURPS requirements, other non-functional requirements include design (how the program is built), implementation (the programming language used and standards to follow), interface (the ability of the program to interface with other systems), and physical constraints (the hardware limitations of the system). Use Case The use case is a scenario that outlines a particular goal of an actor (user) with the system. It consists of the following elements: 123456[Title] Short and simple goal[Primary Actor] The user who desires to achieve the goal[Success Scenario] Steps or paragraphs describing how to achieve the goal To create a use case, identify the actors who interact with the system and separate them by their roles in the use case, not job titles. Focus on the intent of the goal and not go into too specific steps or too broad a goal. The scenario should be concise and avoid detailed technical implementation or UI elements. Focus on the “sunny-day” scenario and avoid including rarely encountered scenarios. Avoid needless words and keep the scenario short and concise. Conceptual Model In object-oriented design, creating a conceptual model is a crucial step in developing a software or system. A conceptual model helps to identify the objects and their relationships that will form the backbone of the software. Here are the steps involved in creating a conceptual model. Identify Objects: The first step is to identify the objects that will be used as class objects in the system. This can be done by looking at the user story or use case and picking out the relevant nouns. For example, in a user story about ordering a meal, the relevant objects might include “customer,” “menu,” and “order.” Identify Class Relationships: Once the objects have been identified, the next step is to connect them with lines to show their relationships. It is important to write down the verbs on each line to avoid using generic words like “use.” Instead, use verbs that describe the relationship between the objects. For example, in the meal ordering system, the “customer” might “place” an “order” from the “menu.” Figure Out Class Responsibilities: The final step is to figure out the responsibilities of each class. This involves identifying the behaviors or actions that each class will perform. This can be done by looking at the user story or use case and picking out the relevant verbs. For example, in the meal ordering system, the “menu” class might have the responsibility of “displaying” the available items while the “order” class might have the responsibility of “calculating” the total cost of the meal. It is important to note that each behavior should belong to the class that is most responsible for it. A behavior usually involves multiple objects, but each object should be responsible for itself. Avoid putting too much responsibility on a single object, which can lead to a “god object” that controls everything in the system. In addition to these steps, another useful tool for creating a conceptual model is CRC (Class Responsibility Collaboration) cards. These cards can be used to organize the classes and their responsibilities, making it easier to visualize the system and identify any potential issues. Class Diagram and Class Relationship In object-oriented design, UML class diagrams are used to represent the structure of a system’s classes and the relationships between them. Here are some important considerations when creating UML class diagrams. Each class in a UML class diagram should have a name, attributes, and behaviors. When creating classes, it’s important to focus on the behaviors of the objects, rather than just their attributes. This is because objects are meant to do things, not just hold data. In general, it’s recommended to keep as many class attributes and methods as private as possible, only making them public if we are certain that other objects will need to use them. Constructor: Constructors are considered as behavior and should be treated as such when creating UML class diagrams. In UML, a constructor is represented as a method with the same name as the class. Interface: In UML, abstract classes and interfaces are represented as types. Abstract classes are used to represent a general category of objects, while interfaces are used to represent shared capabilities or behaviors. For example, a draw() interface can be shared between different types of objects that can be drawn on a screen. While objects of different types cannot be categorized under the same abstract class, they can all share the draw() interface to be able to draw on the screen. A system can iterate through all objects and call the draw() interface to update the screen. Principles and Patterns There are several principles and patterns that can help make our software development more efficient and effective. Single Responsibility Principle: A class should have only one responsibility. Avoid creating god objects that try to do everything. Instead, split responsibilities into multiple classes. Don’t Repeat Yourself (DRY): Avoid duplicating code. Reuse code and extract common functionality into methods or classes. You Ain’t Gonna Need It (YAGNI): Don’t overdo it. Only add features that are necessary and useful. Avoid adding unnecessary complexity. Error Handling and Prompt to Guide Users: Design our software to handle errors gracefully and provide clear prompts to guide users. Good error handling can improve the user experience and prevent bugs. Software Testing: Testing is an important part of software development. Write automated tests to ensure that our code is working as intended and to catch regressions. Design Patterns: Design patterns are reusable solutions to common software design problems. Design Pattern They provide a template to help structure our code around. One of the most well-known books on design patterns is “Design Patterns: Elements of Reusable Object-Oriented Software” by the “Gang of Four”, which describes 23 patterns. Creational Patterns: These patterns deal with the instantiation of objects. Examples include Abstract Factory, Builder, Factory Method, Prototype, and Singleton. Structural Patterns: These patterns deal with how classes are designed and composed. Examples include Adapter, Bridge, Composite, Decorator, Facade, Flyweight, and Proxy. Behavioral Patterns: These patterns deal with communication between objects. Examples include Chain of Responsibility, Command, Interpreter, Iterator, Mediator, Memento, Observer, State, Strategy, Template Method, and Visitor. By following these principles and patterns, we can create software that is more modular, maintainable, and scalable.","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"pipeline","slug":"pipeline","permalink":"https://www.xingyulei.com/tags/pipeline/"}]},{"title":"Unreal Distributed Rendering Server Handbook: Render Farm Implementation","slug":"ue-rendering-remote-farm","date":"2023-02-04T08:00:00.000Z","updated":"2023-03-29T21:43:22.000Z","comments":true,"path":"post/ue-rendering-remote-farm/","link":"","permalink":"https://www.xingyulei.com/post/ue-rendering-remote-farm/","excerpt":"","text":"Introduction Previous blogs that you may find relevant Learn to Automate Unreal Rendering Using Python Unreal Movie Render Queue (MRQ) Custom Executor Building HTTP Server with REST API in Python GitHub link to the complete project code: Unreal Render Farm The first thing to do when creating a distributed remote render farm is to establish its framework. I personally have not much experience using render farm, not to mention designing one. (It is not surprising since I don’t see anyone would build a render farm for personal use). Nevertheless, it’s still such an interesting topic that I couldn’t resist exploring. Important: the following is a simple implementation of a distributed rendering server/ render farm with dummy functionalities and are meant to be substituted based on project needs. Distributed Rendering Framework Here are two examples of how other farm system is structured Update: I noticed Epic Games just posted a new blog which introduces an overview of setting up the render farm. It is worth the read. Moreover, it also includes the source code of remote rendering in Deadline, the code is not hard to follow but it’s different from my implementation. See more details here: Overview of Setting Up A Render Farms With Unreal Engine Blender Network Rendering This is a blender legacy network rendering system. It consists of three roles: Regular client: client, sends render requests Slave: also a client, used to process render job Master: server, coordinate (process requests from clients and assign jobs to slave) The clients need to pre-configure server address in order to talk to master. For both types of clients, they have the ability to send request to update job status (add, delete, modify). A regular client can also request information about the currently active slaves connected to the server. Unreal Swarm Farm This is an Unreal farm system to build lighting. There are two components: Swarm agent: client, an agent can send light map bake request, it also can process light map bake from the server Swarm coordinator: server, used to coordinate light map bake request Similarly, the swarm agent initialize connection by pinging coordinator using a pre-configured address. The swarm agent role can be split into two which exactly maps to the role of a regular client and a slave in the Blender Network Rendering Example. There is still one question remains: how does the server sends job to client? the client send request for jobs periodically a listener server on client side that the server pings to broadcast long polling I decided to go with the easiest setup: client request for jobs periodically. Summary So, finally I have my Unreal remote rendering framework like above: Manager: server, used to host the HTTP server, stores job request information connected to a database, and coordinates/manages request among render nodes Submitter: client, connect to the manager and submit render job request since the submitter only need to send request, this could be entirely web-based Worker: client, connect to manager, periodically pings for new job to process, renders the job and periodically pings to update current render progress requires Unreal installed, capable for rendering jobs Render Job Request Data Structure Structure Here’s a data class I’ve made for representing a render job request, which fundamentally is a dictionary structure: 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647class RenderRequest(object): def __init__( self, uid=&#x27;&#x27;, name=&#x27;&#x27;, owner=&#x27;&#x27;, worker=&#x27;&#x27;, time_created=&#x27;&#x27;, priority=0, category=&#x27;&#x27;, tags=[], status=&#x27;&#x27;, umap_path=&#x27;&#x27;, useq_path=&#x27;&#x27;, uconfig_path=&#x27;&#x27;, output_path=&#x27;&#x27;, width=0, height=0, frame_rate=0, format=&#x27;&#x27;, start_frame=0, end_frame=0, time_estimate=&#x27;&#x27;, progress=0 ): self.uid = uid or str(uuid.uuid4())[:4] self.name = name self.owner = owner or socket.gethostname() self.worker = worker self.time_created = time_created or datetime.now().strftime(&quot;%m/%d/%Y, %H:%M:%S&quot;) self.priority = priority or 0 self.category = category self.tags = tags self.status = status or RenderStatus.unassigned self.umap_path = umap_path self.useq_path = useq_path self.uconfig_path = uconfig_path self.output_path = output_path self.width = width or 1280 self.height = height or 720 self.frame_rate = frame_rate or 30 self.format = format or &#x27;JPG&#x27; self.start_frame = start_frame or 0 self.end_frame = end_frame or 0 self.length = self.end_frame - self.start_frame self.time_estimate = time_estimate self.progress = progress Database For the time-being and testing purpose, I didn’t deploy an actual database. Instead, I used localized .json files for render job request storage. A render request’s unique uid serves as the primary key. Each render request is serialized as a .json file mimicing each row of a database, therefore, making each render job independent: a GET method queries one .json file (an entry) or all .json files in the ‘database’; a POST method creates a .json file; a PUT method updates a .json file; and a DELETE method removes a .json file. 123456def remove_db(uid): &quot;&quot;&quot; Remove a RenderRequest object from the database :param uid: str. request uid &quot;&quot;&quot; os.remove(&#x27;&#123;&#125;.json&#x27;.format(uid)) Manager I’m using flask - a micro web framework in Python to host my HTTP server with REST API, which makes it easier for my client to communicate with the manager. For more information on that, check out my previous blog: Building HTTP Server with REST API in Python REST API For the server communication part, I implemented four methods: GET: api for a render job(s) query request from the clients (submitter or worker) POST: api for a new render job creation request from the submitter PUT: api for a render job update request from the worker DELETE: api for a render job deletion request from the clients 1234567@app.delete(&#x27;/api/delete/&lt;uid&gt;&#x27;)def delete_request(uid): &quot;&quot;&quot; Server DELETE api response, delete render request from database :param uid: str. render request uid &quot;&quot;&quot; renderRequest.remove_db(uid) Job Coordination Another important role of the manager is to coordinate jobs among the available worker/render node. This is obviously a complex problem to solve on its own and is not the focus of my simple render farm implementation, thus, I currently have it automatically assign any new job to a specific worker: 1234567891011121314def new_request_trigger(rrequest): &quot;&quot;&quot; Triggers when a client posts a new render request to the server &quot;&quot;&quot; if rrequest.worker: return # currently, as a test, assigns all job to one worker worker = &#x27;RENDER_MACHINE_01&#x27; assign_request(rrequest, worker) # if multiple jobs came in at once, interval between each assignment time.sleep(4) LOGGER.info(&#x27;assigned job %s to %s&#x27;, rrequest.uid, worker) Render HTML Landing Page I experimented with rendering the index page to display the all render job requests in the database, which looks like this: 12345@app.route(&#x27;/&#x27;)def index_page(): rrequests = renderRequest.read_all() jsons = [rrequest.to_dict() for rrequest in rrequests] return render_template(&#x27;index.html&#x27;, requests=jsons) The tables are generated using a javascript where the columns can be customized 123456789101112131415161718192021222324252627function createTable(list)&#123; // header row cols = [&#x27;uid&#x27;, &#x27;name&#x27;, &#x27;owner&#x27;, &#x27;worker&#x27;, &#x27;time_created&#x27;, &#x27;status&#x27;, &#x27;priority&#x27;, &#x27;time_estimate&#x27;, &#x27;progress&#x27;]; var table = document.createElement(&quot;table&quot;); var tr = table.insertRow(-1); for (var i = 0; i &lt; cols.length; i++) &#123; // header th elements var theader = document.createElement(&quot;th&quot;); theader.innerHTML = cols[i]; tr.appendChild(theader); &#125; // data rows for (var i = 0; i &lt; list.length; i++) &#123; var trow = table.insertRow(-1); var uid = list[i][&#x27;uid&#x27;]; for (var j = 0; j &lt; cols.length; j++) &#123; var cell = trow.insertCell(-1); cell.innerHTML = list[i][cols[j]]; &#125; &#125; var el = document.getElementById(&quot;table&quot;); el.innerHTML = &quot;&quot;; el.appendChild(table);&#125; For the progress bar render 1234567891011121314// add id tag to specific cells for ajaxif (cols[j] == &#x27;progress&#x27;)&#123; // container cell.innerHTML = &#x27;&#x27;; cell.style.width = &#x27;200px&#x27;; var container = document.createElement(&quot;div&quot;); cell.appendChild(container); // bar var bar = document.createElement(&quot;div&quot;); container.appendChild(bar); bar.style.width = list[i][&#x27;progress&#x27;] + &#x27;%&#x27;; bar.innerHTML = list[i][&#x27;progress&#x27;] + &#x27;%&#x27;;&#125; Asynchronous Update using AJAX To update data on the index page asynchronously with the PUT method, I opted in for AJAX (Asynchronous JavaScript and XML). I’ve attached ids to specific HTML elements and set it up so the webpage updates the render status, time remaining estimated and overall progress every given period of time. 12345678910111213141516171819202122232425262728$(document).ready(function()&#123; setInterval( function()&#123;ajaxRequest()&#125;, 2000)&#125;)function ajaxRequest()&#123; $.getJSON(&#x27;/api/get&#x27;, function(data)&#123; updateProgress(data); &#125;)&#125;function updateProgress(data)&#123; var requests = data.results; for (var i = 0; i &lt; requests.length; i++)&#123; var uid = requests[i][&#x27;uid&#x27;]; var progress = requests[i][&#x27;progress&#x27;]; var time_estimate = requests[i][&#x27;time_estimate&#x27;]; var status = requests[i][&#x27;status&#x27;]; var bar = document.getElementById(uid + &#x27;_progress&#x27;); bar.style.width = progress + &#x27;%&#x27;; bar.innerHTML = progress + &#x27;%&#x27;; document.getElementById(uid + &#x27;_estimate&#x27;).innerHTML = time_estimate; document.getElementById(uid + &#x27;_status&#x27;).innerHTML = status; &#125;&#125; Submitter Since the server side is established, the submitter part is actually quite easy. All we need to do is to pass a data with render request data structure and use the POST method (I’m also using the requests standard library) 12345678910111213141516171819202122232425import requestsdef add_request(d): try: response = requests.post(SERVER_API_URL+&#x27;/post&#x27;, json=d) except requests.exceptions.ConnectionError: LOGGER.error(&#x27;failed to connect to server %s&#x27;, SERVER_API_URL) return return RenderRequest.from_dict(response.json()) if __name__ == &#x27;__main__&#x27;: test_job = &#123; &#x27;name&#x27;: &#x27;test&#x27;, &#x27;owner&#x27;: &#x27;TEST_SUBMITTER_01&#x27;, &#x27;umap_path&#x27;: &#x27;/Game/Cinematics/Street/Level_Cin_Street.Level_Cin_Street&#x27;, &#x27;useq_path&#x27;: &#x27;/Game/Cinematics/Street/LS_Master_Street.LS_Master_Street&#x27;, &#x27;uconfig_path&#x27;: &#x27;/Game/Cinematics/Preset/Test.Test&#x27; &#125; rrequest = add_request(test_job) if rrequest: LOGGER.info(&#x27;request %s sent to server&#x27;, rrequest.uid) Worker Each worker represents a render node; The render node unlike other render machine, is a full-fledged PC with the complete Unreal Engine installed. In order to render the requested job, it also needs to have the corresponding Unreal project installed. Before a worker starts rendering a job, it first needs to fetch the latest change of the Unreal project, this can be done using the versioning system supported by Unreal, like Unreal Game Sync with Perforce. When a worker is brought online, it continuously works on the job assigned to it, then periodically pings the server for new jobs. When a job is available, the worker launches an Unreal render process from the command line and calls for the custom Unreal Python executor. Unreal Custom Executor An Unreal custom executor instance is created using command line, for more detail please read the blog regarding Unreal Movie Render Queue (MRQ) Custom Executor 123456789101112131415161718192021def render(uid, umap_path, useq_path, uconfig_path): command = [ UNREAL_EXE, UNREAL_PROJECT, umap_path, &quot;-JobId=&#123;&#125;&quot;.format(uid), &quot;-LevelSequence=&#123;&#125;&quot;.format(useq_path), &quot;-MoviePipelineConfig=&#123;&#125;&quot;.format(uconfig_path), &quot;-game&quot;, &quot;-MoviePipelineLocalExecutorClass=/Script/MovieRenderPipelineCore.MoviePipelinePythonHostExecutor&quot;, &quot;-ExecutorPythonClass=/Engine/PythonTypes.MyExecutor&quot;, ] env = os.environ.copy() env[&quot;UE_PYTHONPATH&quot;] = MODULE_PATH proc = subprocess.Popen( command, stdout=subprocess.PIPE, stderr=subprocess.PIPE, env=env ) return proc.communicate() Within the executor class, a PUT request is sent to the server after every frame render with the latest time remaining estimate and overall pipeline progress. 123456789101112131415161718192021222324252627282930@unreal.uclass()class MyExecutor(unreal.MoviePipelinePythonHostExecutor): ... @unreal.ufunction(override=True) def on_begin_frame(self): super(MyExecutor, self).on_begin_frame() if not self.pipeline: return status = renderRequest.RenderStatus.in_progress progress = 100 * unreal.MoviePipelineLibrary.\\ get_completion_percentage(self.pipeline) time_estimate = unreal.MoviePipelineLibrary.\\ get_estimated_time_remaining(self.pipeline) if not time_estimate: time_estimate = unreal.Timespan.MAX_VALUE days, hours, minutes, seconds, _ = time_estimate.to_tuple() time_estimate = &#x27;&#123;&#125;h:&#123;&#125;m:&#123;&#125;s&#x27;.format(hours, minutes, seconds) self.send_http_request( &#x27;&#123;&#125;/put/&#123;&#125;&#x27;.format(client.SERVER_API_URL, self.job_id), &quot;PUT&quot;, &#x27;&#123;&#125;;&#123;&#125;;&#123;&#125;&#x27;.format(progress, time_estimate, status), unreal.Map(str, str) ) Conclusion And that’s concludes the break-down of my dummy distributed rendering system; once again the complete project source code can be found here along with a video demo There are still lots of components that can be expanded further, namely the job coordination functionality, the web application implementation (can replace the submitter), the database implementation and actually testing this across multiple machines in a network. Unfortunately, I don’t have the resources to touch upon these. Hope this is useful and see you in the next blog! References YouTube - UE4 | Creating a Swarm Farm YouTube - DIY Renderfarm Building Tutorial for Distributed Blender Rendering CG Director - How to Build your own Render Farm [Ultimate Guide]","categories":[{"name":"unreal cinematic","slug":"unreal-cinematic","permalink":"https://www.xingyulei.com/categories/unreal-cinematic/"}],"tags":[{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"rendering","slug":"rendering","permalink":"https://www.xingyulei.com/tags/rendering/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Take Your Unreal Movie Renders to the Next Level with Custom MRQ Executors","slug":"ue-rendering-custom-executor","date":"2023-01-16T08:00:00.000Z","updated":"2023-09-02T18:07:55.013Z","comments":true,"path":"post/ue-rendering-custom-executor/","link":"","permalink":"https://www.xingyulei.com/post/ue-rendering-custom-executor/","excerpt":"","text":"Introduction In an earlier blog: Learn to Automate Unreal Rendering Using Python I mentioned how Unreal Movie Render Queue (MRQ) is more powerful than the legacy Movie Scene Capture but didn’t really have time to show it. In this blog, I will create a customized Unreal Python executor using the Movie Render Pipeline Plugin; The example script provided by Epic can be found here: “Engine\\Plugins\\MovieScene\\MovieRenderPipeline\\Content\\Python\\MoviePipelineExampleRuntimeExecutor.py” Walk-through We can find the example code provided by Epic mentioned above, or from my render farm tool located here Executor Class An “executor,” which is responsible for deciding how a queue is rendered, giving you complete control over the before, during, and after of each render. The Python class inherit from the unreal.MoviePipelinePythonHostExecutor, is a class override which allows us to make an executor that can process render jobs in an Unreal standalone commandline launch with ‘-game’ flag; It also provides async HTTP request functionality, which can be useful in implementing remote rendering. 1234567891011121314import unreal@unreal.uclass()class MyExecutor(unreal.MoviePipelinePythonHostExecutor): pipeline = unreal.uproperty(unreal.MoviePipeline) queue = unreal.uproperty(unreal.MoviePipelineQueue) job_id = unreal.uproperty(unreal.Text) def _post_init(self): self.pipeline = None self.queue = None self.job_id = None Instead of using __init__() function in Python, the _post_init() gets called when created by C++ or Python. Per the example provided by Unreal, this is also how we declare class properties/variables, which we have to specify the type. Python classes are transient, to allow C++ to spawn a Python type, we have to specify the type as a member variable. There is special code in C++ which checks that type and spawns that type (instead of the default) Executed Delayed The execute_delayed() is called once the map has finished loading and the executor has fully instantiated. This is the best place to parse commandline arguments and connect to socket, and also where we can initialize a render job using the commandline arguments. 1234567891011121314151617181920212223242526272829@unreal.ufunction(override=True)def execute_delayed(self, queue): # parse commandline (cmd_tokens, cmd_switches, cmd_parameters) = unreal.SystemLibrary.\\ parse_command_line(unreal.SystemLibrary.get_command_line()) self.map_path = cmd_tokens[0] self.job_id = cmd_parameters[&#x27;JobId&#x27;] self.seq_path = cmd_parameters[&#x27;LevelSequence&#x27;] self.preset_path = cmd_parameters[&#x27;MoviePipelineConfig&#x27;] # initialize pipeline self.pipeline = unreal.new_object( self.target_pipeline_class, outer=self.get_last_loaded_world(), base_type=unreal.MoviePipeline ) # initialize queue self.queue = unreal.new_object(unreal.MoviePipelineQueue, outer=self) job = self.queue.allocate_new_job(unreal.MoviePipelineExecutorJob) job.map = unreal.SoftObjectPath(self.map_path) job.sequence = unreal.SoftObjectPath(self.seq_path) preset_path = unreal.SoftObjectPath(self.preset_path) u_preset = unreal.SystemLibrary.\\ conv_soft_obj_path_to_soft_obj_ref(preset_path) job.set_configuration(u_preset) self.pipeline.initialize(job) Add Callbacks In the execute_delayed() method, we can add callback functions when the current pipeline job has finished and when the entire pipeline has finished. We even have control over when the pipeline has finished processing individual shots of a render job’s sequence using: on_movie_pipeline_shot_work_finished_delegate. 12345678self.pipeline.on_movie_pipeline_finished_delegate.add_function_unique( self, &quot;on_job_finished&quot;)self.pipeline.on_movie_pipeline_work_finished_delegate.add_function_unique( self, &quot;on_pipeline_finished&quot;) There are also callback functions for socket message received: socket_message_recieved_delete and http response received: http_response_recieved_delegate. We could register those in the _post_init() method. The on_begin_frame() built-in callback function is called once every frame, which can be used to update elapse time, remaining time and the completion percentage of the pipeline. 12345678@unreal.ufunction(override=True)def on_begin_frame(self): super(MyExecutor, self).on_begin_frame() if not self.pipeline: return unreal.log(unreal.MoviePipelineLibrary.get_completion_percentage(self.pipeline)) Pipeline Finished Callbacks Here’s how I implement the job finished callback on_movie_pipeline_finished_delegate and pipeline finished callback on_movie_pipeline_work_finished_delegate. After a job has finished, I manually called the on_executor_finished_impl() which marks the end of the render; But if there were more than one job to process per execution (for example, a multi-pass render), we should process the next job of a render pass during this callback function instead of ending it. 123456789101112131415161718@unreal.ufunction(ret=None, params=[unreal.MoviePipeline, bool])def on_job_finished(self, pipeline, error): self.pipeline = None unreal.log(&quot;Finished rendering movie!&quot;) self.on_executor_finished_impl() @unreal.ufunction(ret=None, params=[unreal.MoviePipelineOutputData])def on_pipeline_finished(self, results): output_data = results if output_data.success: for shot_data in output_data.shot_data: render_pass_data = shot_data.render_pass_data for k, v in render_pass_data.items(): if k.name == &#x27;FinalImage&#x27;: outputs = v.file_paths # get all final output images unreal.log(outputs) Using Commandline In the init_unreal.py Unreal startup script, we should include the module where we declared the customized python class. 12# init_unreal.pyimport myExecutor 123# myExecutor.pyclass MyExecutor(unreal.MoviePipelinePythonHostExecutor): pass Now in the commandline, we need to include -MoviePipelineLocalExecutorClass=/Script/MovieRenderPipelineCore.MoviePipelinePythonHostExecutor and then -ExecutorPythonClass=/Engine/PythonTypes.MyExecutor which is the custom python executor class. An example of the full commandline arguments can be found as follows, I also included the “-JobId” custom flag which we are able to parse above. 1234567891011121314151617181920212223command = [ UNREAL_EXE, UNREAL_PROJECT, umap_path, &quot;-JobId=a5qo3e80&quot;, &quot;-LevelSequence=&#123;&#125;&quot;.format(useq_path), &quot;-MoviePipelineConfig=&#123;&#125;&quot;.format(uconfig_path), # required &quot;-game&quot;, &quot;-MoviePipelineLocalExecutorClass=/Script/MovieRenderPipelineCore.MoviePipelinePythonHostExecutor&quot;, &quot;-ExecutorPythonClass=/Engine/PythonTypes.MyExecutor&quot;, # render preview &quot;-windowed&quot;, &quot;-resX=1280&quot;, &quot;-resY=720&quot;, # logging &quot;-StdOut&quot;, &quot;-FullStdOutLogOutput&quot;] Preset For convenience, I created a custom Unreal render preset class to easily overwrite configuration settings by passing in custom flags. 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556import unreal@unreal.uclass()class MyPreset(unreal.MoviePipelineMasterConfig): def __init__(self, preset): super(MyPreset, self).__init__(preset) self.copy_from(preset) self.set_flush_disk() @unreal.ufunction(ret=None, params=[]) def set_flush_disk(self): u_setting = self.find_setting_by_class( unreal.MoviePipelineOutputSetting ) u_setting.flush_disk_writes_per_shot = True @classmethod def get_base_preset(cls): u_preset = unreal.MoviePipelineMasterConfig() u_setting = u_preset.find_setting_by_class( unreal.MoviePipelineOutputSetting ) # A job should have a render pass and a file output. u_setting.output_resolution = unreal.IntPoint(1280, 720) render_pass = u_preset.find_or_add_setting_by_class( unreal.MoviePipelineDeferredPassBase ) render_pass.disable_multisample_effects = True u_preset.find_or_add_setting_by_class( unreal.MoviePipelineImageSequenceOutput_PNG ) u_preset.initialize_transient_settings() return cls(u_preset) @property def output_path(self): u_setting = self.find_setting_by_class( unreal.MoviePipelineOutputSetting ) return u_setting.get_editor_property(&#x27;output_directory&#x27;) @unreal.ufunction(ret=None, params=[str]) def set_output_path(self, path): u_setting = self.find_setting_by_class( unreal.MoviePipelineOutputSetting ) u_setting.set_editor_property( &#x27;output_directory&#x27;, unreal.DirectoryPath(path) ) This can be used like such, the benefit of this is that it will use a base preset .uasset and create a temporary copy of it to overwrite settings. Once used, the preset created are discarded. 1234567891011121314@unreal.ufunction(override=True)def execute_delayed(self, queue): # parse commandline ... self.preset_path = cmd_parameters[&#x27;MoviePipelineConfig&#x27;] self.output_path = cmd_parameters[&#x27;OutputDirectory&#x27;] ... preset_path = unreal.SoftObjectPath(self.preset_path) u_preset = unreal.SystemLibrary.conv_soft_obj_path_to_soft_obj_ref(preset_path) my_preset = MyPreset(u_preset) my_preset.set_output_path(self.output_path) ... Reference Unreal Forum - Command Line Rendering With Unreal Engine Movie Render Queue","categories":[{"name":"unreal cinematic","slug":"unreal-cinematic","permalink":"https://www.xingyulei.com/categories/unreal-cinematic/"}],"tags":[{"name":"pipeline","slug":"pipeline","permalink":"https://www.xingyulei.com/tags/pipeline/"},{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"rendering","slug":"rendering","permalink":"https://www.xingyulei.com/tags/rendering/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Python REST API: Build and Deploy Your Own Custom Server","slug":"py-http-server","date":"2023-01-07T08:00:00.000Z","updated":"2023-03-29T21:17:40.000Z","comments":true,"path":"post/py-http-server/","link":"","permalink":"https://www.xingyulei.com/post/py-http-server/","excerpt":"","text":"HTTP Server Basic In a client-server model, HTTP server plays the role of a server and implements using HTTP/HTTPS network protocol. HTTP runs on a socket and uses TCP/IP connection, but is a higher-level connection that takes care of the send and receive process in a predefined format. Request and Respond An HTTP request contains a URL, a method, a header and a body; “POST” and “GET” are the two most common request methods: &quot;POST&quot;: from the client submits information to the server &quot;GET&quot;: from the client expect information back from the server A response is what the client receives from the server in answer to the HTTP request. An HTTP response contains a status code, a header and a body Rest API A REST (also known as RESTful) API is a web API that conforms to the constraints of REST (representational state transfer) architectural style and allows for interaction with RESTful web services. When a client request is made via a RESTful API, it transfers a representation of the state of the resource to the requester or endpoint. The touch point of this request/communication is the endpoint. Each endpoint is the location (URL of a service) from which APIs can access the resources they need to carry out their function. The resource or information is delivered in one of several formats via HTTP (JSON being the most popular). Using http.server To build a simple HTTP Server with “POST” and “GET” methods: 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354import jsonimport loggingimport refrom http.server import BaseHTTPRequestHandler, HTTPServerclass LocalData(object): records = &#123;&#125;class HTTPRequestHandler(BaseHTTPRequestHandler): def do_POST(self): if re.search(&#x27;/api/post/*&#x27;, self.path): length = int(self.headers.get(&#x27;content-length&#x27;)) data = self.rfile.read(length).decode(&#x27;utf8&#x27;) record_id = self.path.split(&#x27;/&#x27;)[-1] LocalData.records[record_id] = data logging.info(&quot;add record %s: %s&quot;, record_id, data) self.send_response(200) else: self.send_response(403) self.end_headers() def do_GET(self): if re.search(&#x27;/api/get/*&#x27;, self.path): record_id = self.path.split(&#x27;/&#x27;)[-1] if record_id in LocalData.records: self.send_response(200) self.send_header(&#x27;Content-Type&#x27;, &#x27;application/json&#x27;) self.end_headers() # Return json, even though it came in as POST URL params data = json.dumps(LocalData.records[record_id]).encode(&#x27;utf-8&#x27;) logging.info(&quot;get record %s: %s&quot;, record_id, data) self.wfile.write(data) else: self.send_response(404, &#x27;Not Found: record does not exist&#x27;) else: self.send_response(403) self.end_headers() if __name__ == &#x27;__main__&#x27;: server = HTTPServer((&#x27;localhost&#x27;, 8000), HTTPRequestHandler) logging.info(&#x27;Starting httpd...\\n&#x27;) try: server.serve_forever() except KeyboardInterrupt: pass server.server_close() logging.info(&#x27;Stopping httpd...\\n&#x27;) On the client side, we’re utilizing the requests module for sending requests: 12345import requestsid = &#x27;test&#x27;data = &#123;&#x27;key&#x27;: &#x27;value&#x27;&#125;r = requests.post(&#x27;http://localhost:8000/api/post/&#123;&#125;&#x27;.format(id), json=data) Here, we send a “POST” method request to access the http://localhost:8000/api/post endpoint which added a dictionary type data payload. The data has an id of test and content of &#123;'key': 'value'&#125;. 123id = &#x27;test&#x27;r = requests.get(&#x27;http://localhost:8000/api/get/&#123;&#125;&#x27;.format(id))print(r.text) Then, we can send a “GET” request to retrieve the data we just added by accessing another endpoint http://localhost:8000/api/get/; this can be done either through a browser with the corresponding id (http://localhost:8000/api/get/test), or by sending an HTTP “GET” request using requests module. The response from the server gives the output: &#123;'key': 'value'&#125; Using flask Flask is a micro web framework written in Python I am going to re-created the HTTP server above with “POST” and “GET” endpoints using flask, this is much simpler: 1234567891011121314151617181920from flask import Flaskfrom flask import requestapp = Flask(__name__)class LocalData(object): records = &#123;&#125;# POST endpoint@app.post(&#x27;/api/post/&lt;id&gt;&#x27;)def create_entry(id): data = request.get_json(force=True) LocalData.records[id] = data return data# GET endpoint@app.get(&#x27;/api/get/&lt;id&gt;&#x27;)def get_record(id): return LocalData.records[id] Now to run the server, we run the following command flask --app &lt;appName.py&gt; run; Additional --debug flag can be added before run to auto reload the latest script change when debugging. Rendering Webpage One of the common cases, when hosting an HTML server, is that users have the ability access our endpoint with their browser. Instead of spitting out raw data, we often want to format it to a nice HTML page. 1234567@app.route(&#x27;/&#x27;)def index_page(): datas = get_all_local_datas() if not datas: return &#x27;Welcome!&#x27; return render_template(&#x27;index.html&#x27;, jsons=datas) Here we are specifying an ‘index.html’ landing page using the root path (’’), then a dummpy function that gets all the data from our storage (e.g. database). For HTML We can pass in the datas to a variable named json which is defined in the .html: 123&lt;body&gt; &lt;p&gt;&#123;&#123;jsons&#125;&#125;&lt;/p&gt;&lt;/body&gt; Note: it is required that the .html files rest in a folder called “templates”, unless we overwrite that configuration. For JavaScript In javascript, we need to use a jinja2 filter: 123&lt;script&gt; myfunc( &#123;&#123;jsons|tojson|safe&#125;&#125; );&lt;/script&gt; Linking External Files If you would like to include additional external .js or .css files, they all need to rest in a folder called “static”. Linking the files can then be done as such: 1&lt;script src = &#123;&#123;url_for(&#x27;static&#x27;, filename=&quot;myJS.js&quot;)&#125;&#125;&gt;&lt;/script&gt; 1&lt;link rel=&quot;stylesheet&quot; type=&quot;text/css&quot; href= &#123;&#123;url_for(&#x27;static&#x27;, filename=&quot;main.css&quot;)&#125;&#125;&gt; References Cloud Flare - What is HTTP? Red Hat - What is a REST API Flask Linode - Create a RESTful API Using Python and Flask Stack Overflow - Difference between socket programing and http programming Stack Overflow - Pass Variable from python (flask) to HTML in render template? GitHub Gist - simple_server.py by dfrankow","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"server","slug":"server","permalink":"https://www.xingyulei.com/tags/server/"}]},{"title":"Boost Your Unreal Rendering Workflow with Python Automation","slug":"ue-rendering-basic","date":"2022-12-03T08:00:00.000Z","updated":"2023-09-02T18:07:17.017Z","comments":true,"path":"post/ue-rendering-basic/","link":"","permalink":"https://www.xingyulei.com/post/ue-rendering-basic/","excerpt":"","text":"Introduction In this post, I’ll cover Python automation using Movie Render Queue (MRQ) and Movie Scene Capture. I’ll go over how to make Python tools to run in the Unreal Editor as well as outside Unreal through command line; How to change settings and add call backs. The MRQ is more preferred over Movie Scene Capture as it’s much more customizable, both in supported render setting and in automation (In a later post you’ll see). Movie Render Queue Movie Render Queue is a successor to the Sequencer Render Movie feature, and is built for higher quality, easier integration into production pipelines, and user extensibility. With Movie Render Queue you can accumulate multiple render samples together to produce the final output frame, which allows for higher quality anti-aliasing, radial motion blur, and reduced noise in ray tracing. The Movie Render Queue (MRQ) is the latest and the greatest from Unreal for Rendering out cinematic, over the legacy Movie Scene Capture Tool. Movie Render Queue in Editor Here we can find the full example from Epic: Engine\\Plugins\\MovieScene\\MovieRenderPipeline\\Content\\Python\\MoviePipelineEditorExample.py Bare Minimal Through Unreal Editor, we use a render executor called PlayInEditor (PIE) executor. 1234567891011121314def movie_queue_render(u_level_file, u_level_seq_file, u_preset_file): subsystem = unreal.get_editor_subsystem(unreal.MoviePipelineQueueSubsystem) queue = subsystem.get_queue() executor = unreal.MoviePipelinePIEExecutor() # config render job with movie pipeline config job = queue.allocate_new_job(unreal.MoviePipelineExecutorJob) job.job_name = &#x27;test&#x27; job.map = unreal.SoftObjectPath(u_level_file) job.sequence = unreal.SoftObjectPath(u_level_seq_file) preset = unreal.EditorAssetLibrary.find_asset_data(u_preset_file).get_asset() job.set_configuration(preset) subsystem.render_queue_with_executor_instance(executor) Override Settings All the render settings are stored as an unreal.MoviePipelineMasterConfig object. It has sub setting components class unreal.MoviePipeline, for example: unreal.MoviePipelineOutputSetting, unreal.MoviePipelineCameraSetting, unreal.MoviePipelineColorSetting and etc Each Setting class then have properties, for unreal.MoviePipelineOutputSetting, it has properties such as: use_custom_frame_rate frame_number_offset output_directory etc All of which can be modified, attached, and removed. Example: 123uPreset = unreal.MoviePipelineMasterConfig()uSetting = uPreset.find_setting_by_class(unreal.MoviePipelineOutputSetting)uSetting.output_resolution = unreal.IntPoint(1280, 720) Callback Callbacks can be added upon each Shot, Job, Queue Finished. The callback function has to be kept as global variable here to prevent it being destroyed by GC. 1234def render_finished(params): unreal.log(params)executor.on_individual_job_work_finished_delegate.add_callable_unique(render_finished) or. 123456def render_errored(executor, pipeline, is_fatal, error_msg): passERROR_CALLBACK = unreal.OnMoviePipelineExecutorErrored()ERROR_CALLBACK.add_callable(render_errored)exector.on_executor_errored_delegate = ERROR_CALLBACK See my convenient class for PIE here: https://github.com/leixingyu/unrealUtil/blob/master/render/render.py Movie Render Queue Commandline The default MRQ command line offers customization by using either an Unreal Render Preset/Config asset or an Unreal Render Queue asset. Since there are so many settings in the MRQ we can modify, it’s hard to expose all of the little details through command line. If you do wish to do so, I have an entire blog about Unreal MRQ Custom Executor. 12345678910111213141516171819202122def movie_queue_render(u_level_file, u_level_seq_file, u_preset_file): command = [ UNREAL_EXE, U_PROJECT, u_level_file, # required &quot;-LevelSequence=%s&quot; % u_level_seq_file, # The sequence to render &quot;-MoviePipelineConfig=\\&quot;%s\\&quot;&quot; % u_preset_file, &quot;-game&quot;, # options &quot;-NoLoadingScreen&quot;, &quot;-log&quot;, # window size not resolution &quot;-Windowed&quot;, &quot;-ResX=800&quot;, &quot;-ResY=600&quot;, ] proc = subprocess.Popen(command) return proc.communicate() Movie Scene Capture Now this part may or may not be relevant anymore as many people treats the Movie Scene Capture as deprecated. But I thought I write it down anyway, as it might be helpful as a comparison to MRQ Movie Scene Capture Editor Here we can find an example from Epic: Engine\\Plugins\\MovieScene\\SequencerScripting\\Content\\Python\\sequencer_examples.py Bare Minimal 1234import unrealcapture = unreal.AutomatedLevelSequenceCapture()capture.level_sequence_asset = unreal.SoftObjectPath(sequencer_path)unreal.SequencerTools.render_movie(capture, unreal.OnRenderMovieStopped()) In this example, we only need to supply the path to the Unreal sequencer asset. Note that the render happens in the current level, so make sure to pre-load the map before running the Movie Scene Capture. Callback 12345def on_render_movie_finished(success): unreal.log(&quot;Movie has finished rendering&quot;) on_finished_callback = unreal.OnRenderMovieStopped()on_finished_callback.bind_callable(on_render_movie_finished) Note the on_finished_callback is a global variable so it is persistent and won’t get destroyed during GC. The next step is to register the callback function: unreal.SequencerTools.render_movie(capture_settings, unreal.OnRenderMovieStopped()) Override Setting The settings can be modified through class unreal.MovieSceneCaptureSettings Example: 123capture = unreal.AutomatedLevelSequenceCapture()setting = capture.settingssetting.output_directory = unreal.DirectoryPath(export_path) Movie Scene Capture Commandline A lot of custom flags can be specified through the command line, see the full list of control commands: Command Line Arguments for Rendering Movies Console variables can even be set through command line which is decent. 123456789101112131415161718192021222324252627282930313233import subprocessdef movie_scene_capture(u_level_file, u_level_seq_file, output_folder): command = [ UNREAL_EXE, U_PROJECT, u_level_file, # required &quot;-LevelSequence=%s&quot; % u_level_seq_file, # The sequence to render &quot;-MovieSceneCaptureType=/Script/MovieSceneCapture.AutomatedLevelSequenceCapture&quot;, &quot;-NoLoadingScreen&quot;, &quot;-game&quot;, &quot;-log&quot;, &quot;-MovieCinematicMode=yes&quot;, # general property &quot;-MovieFolder=%s&quot; % output_folder, # if doing .avi &quot;-MovieFormat=Video&quot;, # JPG, BMP, PNG or Video &quot;-MovieFrameRate=24&quot;, &quot;-MovieQuality=100&quot;, # compression quality in percentage &quot;-Windowed&quot;, &quot;-ResX=1920&quot;, &quot;-ResY=1080&quot;, # other &quot;-NoTextureStreaming&quot;, # for final render &quot;-NoScreenMessages&quot;, # no screen debug message ] proc = subprocess.Popen(command) return proc.communicate() Additional References Unreal Forums - Unable to execute MoviePipelineQueue from Python","categories":[{"name":"unreal cinematic","slug":"unreal-cinematic","permalink":"https://www.xingyulei.com/categories/unreal-cinematic/"}],"tags":[{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"rendering","slug":"rendering","permalink":"https://www.xingyulei.com/tags/rendering/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Unlock the Power of Unreal Command Line with Python: 3 Easy Methods","slug":"ue-commandline-python","date":"2022-11-06T07:00:00.000Z","updated":"2023-09-02T18:06:44.041Z","comments":true,"path":"post/ue-commandline-python/","link":"","permalink":"https://www.xingyulei.com/post/ue-commandline-python/","excerpt":"","text":"Introduction The Unreal official documentation has two simple examples to run Python through commandline, one being Commandlet: a headless mode without even opening the Editor, the other one being the Full Editor mode which has Unreal Editor fully opened and loaded. Do you know there’s actually a “third” way? And today, I’ll discuss my experience and preferences of using all of them. Commandlet 1UnrealEditor.exe &quot;C:\\projects\\MyProject.uproject&quot; -run=pythonscript -script=&quot;c:\\\\my_script.py&quot; The “Commandlet” mode runs Unreal in headless mode without editor opened, this means no asset and level loading (but we have access to the unreal python module). This is great if we want to write to the project (for example, importing/creating assets), but it’s not going to work well for reading from the project. Full Editor 1UnrealEditor.exe &quot;C:\\projects\\MyProject.uproject&quot; -ExecutePythonScript=&quot;c:\\my_script.py&quot; Using “Full Editor” mode, we now have everything loaded in engine and are able to do almost all operations, the trade-off being there’s a longer loading time, and also the editor will be opened. Note that at this point, once the python script finishes executing, the editor and the command prompt window will close automatically. UI If we ever needs to create a simple UI that launches from the “Full Editor” mode, we could do something like this in the python script. 12345678910111213141516171819import sysimport unrealif __name__ == &quot;__main__&quot;: global app global window if not QtWidgets.QApplication.instance(): app = QtWidgets.QApplication(sys.argv) window = TestWindow() unreal.parent_external_window_to_slate( window.winId().__init__(), unreal.SlateParentWindowSearchMethod.ACTIVE_WINDOW ) window.show() sys.exit(app.exec_()) Note that we are using sys.exit(app.exec_()) to prevent the UI being immediately destroyed. This does mean the Qt event loop would take over the main thread which renders Unreal editor non-interactable until function calls hands over the process to Unreal. However, I do find in rare cases (for example: when launching Movie Render Queue through commandline), either the UI still hangs the editor with the operation, or (without the UI) the editor just exit immediately after the operation is being called. Either of this will not let the render to finish. This brings me to method number three that perfectly solves this issue. Init Cmd 1UnrealEditor.exe &quot;C:\\projects\\MyProject.uproject&quot; -ExecCmds=&quot;py c:/my_script.py&quot; This method, although not present on Unreal Engine’s wiki, it is mentioned in the FAQ by the official Epic Games account on Linear Content Creation. For Automation/Testing we can pass the following to keep the editor running. –ExecCmds=“py PathToPyFile” Once we are done, we can call: unreal.SystemLibrary.execute_console_command(None,“QUIT_EDITOR”) This is almost like running a specified startup python script in Unreal, and the editor is fully interactable when the script is running. The editor exit automatically when calling “QUIT_EDITOR”, if running a script with UI, we can hook up to the closeEvent(). 123def closeEvent(self, event): QtWidgets.QMainWindow.closeEvent(event) unreal.SystemLibrary.execute_console_command(None, &quot;QUIT_EDITOR&quot;) to override closeEvent() in instance-level instead of class-level, see here Logging To generate output from the commandline we can add two arguments: -stdout and -FullStdOutLogOutput. 12345678910111213141516def call(python_script): command = [ UNREAL_EXE, UPROJECT, &quot;-ExecCmds=py &#123;&#125;&quot;.format(python_script), &quot;-stdout&quot;, &quot;-FullStdOutLogOutput&quot; ] proc = subprocess.Popen( command, stdout=subprocess.PIPE, stderr=subprocess.PIPE, ) return proc.communicate() and we can filter out only the log generated from Python as such 1234output = call(&#x27;python_script.py&#x27;)for line in str(output).split(r&#x27;\\r\\n&#x27;): if &#x27;LogPython&#x27; in line: print(line) Environment Another thing to consider is that, running in batch mode can mess up our tools and start up scripts. due to it being a different environment. We might want to re-configure our environment which we can do like such: 12345678910111213import osimport subprocessenv = os.environ.copy()env[&#x27;FOO&#x27;] = &#x27;BAR&#x27;# more env ...proc = subprocess.Popen( command, stdout=subprocess.PIPE, stderr=subprocess.PIPE, env=env ) Reference Unreal Doc - Scripting the Unreal Editor Using Python Unreal Forum - Unreal Engine Technical Guide to Linear Content Creation FAQs Adamrehn Docs - UE4CLI","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"batch","slug":"batch","permalink":"https://www.xingyulei.com/tags/batch/"}]},{"title":"Transform Your Workflow: Learn How to Convert Matrices between DCCs","slug":"math-xform-conversion","date":"2022-10-22T07:00:00.000Z","updated":"2023-03-29T21:09:24.000Z","comments":true,"path":"post/math-xform-conversion/","link":"","permalink":"https://www.xingyulei.com/post/math-xform-conversion/","excerpt":"","text":"Introduction Have you noticed the different transform values when one asset is imported to a different package? When we do .fbx importing and exporting, the plugin does this conversion for us. FBX is very reliable and hassle-free, but how does the math works? Important: Before continuing, I highly recommend reading these previous posts Euler Angles Change of Basis Transformation Value To demonstrate the different transform between DCCs, here I have some ‘axis’ object placed in Maya, Unity and Unreal. When inspecting the ‘axis’ located on the top-right, the transformation values are seen as follow: translation rotation scale Maya x: -1.31, y: 0.33, z: 0.19 x: -335, y: -12, z: 98 x: 1, y: 1, z: 1 Unity x: 1.31, y: 0.33, z: 0.19 x: 7, y: -27, z: -102 x: 1, y: 1, z: 1 Unreal x: -1.31, y: 0.19, z: 0.33 x: 149, y: 75, z: 123 x: 1, y: 1, z: 1 Usually, for translation and scale there is a pattern to be found, usually the operation involves swapping values between axes, and flipping them. For rotation, however, the values don’t seem to have connections between one another, so how can we compute them? The fundamental reason for all of this is that even though all DCCs use a Cartesian coordinate system, they have different axis direction and rotation order. Methods Overview The method I use are all fundamental matrix calculation. From the source package, retrieve translation, rotation and scale (tsource,rsource,ssourcet_{source}, r_{source}, s_{source}tsource​,rsource​,ssource​) and compose a transformation matrix: MsourceM_{source}Msource​ Convert the transformation matrix to the target software coordinate system using change of basis operation: Mtarget=Mcob∗Msource∗Mcob−1M_{target} = M_{cob} * M_{source} * {M_{cob}}^{-1}Mtarget​=Mcob​∗Msource​∗Mcob​−1 Decompose the transformation matrix: MtargetM_{target}Mtarget​ and re-order the target translation, rotation and scale value such (ttarget,rtarget,stargett_{target}, r_{target}, s_{target}ttarget​,rtarget​,starget​) Composition and De-composition It is helpful to re-visit the transform matrix calculation, but we will later use a math library to handle them. Translation: a translating along t=&lt;dx,dy,dz&gt;t = &lt;d_x, d_y, d_z&gt;t=&lt;dx​,dy​,dz​&gt; can be thought as multiplying by the translation matrix: Mtranslation=[100dx010dy001dz0001] M_{translation} = \\begin{bmatrix} 1 &amp; 0 &amp; 0 &amp; d_x\\\\ 0 &amp; 1 &amp; 0 &amp; d_y\\\\ 0 &amp; 0 &amp; 1 &amp; d_z\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} Mtranslation​=⎣⎢⎢⎡​1000​0100​0010​dx​dy​dz​1​⎦⎥⎥⎤​ Scale: a scaling upon s=&lt;βx,βy,βz&gt;s = &lt;\\beta_x, \\beta_y, \\beta_z&gt;s=&lt;βx​,βy​,βz​&gt; can be thought as multiplying by the scale matrix: Mscale=[βx0000βy0000βz00001] M_{scale} = \\begin{bmatrix} \\beta_x &amp; 0 &amp; 0 &amp; 0\\\\ 0 &amp; \\beta_y &amp; 0 &amp; 0\\\\ 0 &amp; 0 &amp; \\beta_z &amp; 0\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} Mscale​=⎣⎢⎢⎡​βx​000​0βy​00​00βz​0​0001​⎦⎥⎥⎤​ Shear: good to know, but not very commonly use; sh=&lt;shx,shy,shz&gt;sh = &lt;sh_x, sh_y, sh_z&gt;sh=&lt;shx​,shy​,shz​&gt; represents shear along x, y and z axis; Mshx=[1000hyx100hzx0100001] M_{sh_x} = \\begin{bmatrix} 1 &amp; 0 &amp; 0 &amp; 0\\\\ h_{yx} &amp; 1 &amp; 0 &amp; 0\\\\ h_{zx} &amp; 0 &amp; 1 &amp; 0\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\\\ \\end{bmatrix} Mshx​​=⎣⎢⎢⎡​1hyx​hzx​0​0100​0010​0001​⎦⎥⎥⎤​ Mshy=[1hxy0001000hzy100001] M_{sh_y} = \\begin{bmatrix} 1 &amp; h_{xy} &amp; 0 &amp; 0\\\\ 0 &amp; 1 &amp; 0 &amp; 0\\\\ 0 &amp; h_{zy} &amp; 1 &amp; 0\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} Mshy​​=⎣⎢⎢⎡​1000​hxy​1hzy​0​0010​0001​⎦⎥⎥⎤​ Mshz=[10hxz001hyz000100001] M_{sh_z} = \\begin{bmatrix} 1 &amp; 0 &amp; h_{xz} &amp; 0\\\\ 0 &amp; 1 &amp; h_{yz} &amp; 0\\\\ 0 &amp; 0 &amp; 1 &amp; 0\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} Mshz​​=⎣⎢⎢⎡​1000​0100​hxz​hyz​10​0001​⎦⎥⎥⎤​ A 2D shearing operation Rotation: a rotation can be thought as a combination of shearing and scaling, a visual demonstration can be found here. A rotation along x, y and z axis can then be represented as such: Mrx=[10000cosθ−sinθ00sinθcosθ00001] M_{r_x} = \\begin{bmatrix} 1 &amp; 0 &amp; 0 &amp; 0\\\\ 0 &amp; cos\\theta &amp; -sin\\theta &amp; 0\\\\ 0 &amp; sin\\theta &amp; cos\\theta &amp; 0\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} Mrx​​=⎣⎢⎢⎡​1000​0cosθsinθ0​0−sinθcosθ0​0001​⎦⎥⎥⎤​ Mry=[cosθ0sinθ00100−sinθ0cosθ00001] M_{r_y} = \\begin{bmatrix} cos\\theta &amp; 0 &amp; sin\\theta &amp; 0\\\\ 0 &amp; 1 &amp; 0 &amp; 0\\\\ -sin\\theta &amp; 0 &amp; cos\\theta &amp; 0\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} Mry​​=⎣⎢⎢⎡​cosθ0−sinθ0​0100​sinθ0cosθ0​0001​⎦⎥⎥⎤​ Mrz=[cosθ−sinθ00sinθcosθ0000100001] M_{r_z} = \\begin{bmatrix} cos\\theta &amp; -sin\\theta &amp; 0 &amp; 0\\\\ sin\\theta &amp; cos\\theta &amp; 0 &amp; 0\\\\ 0 &amp; 0 &amp; 1 &amp; 0\\\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} Mrz​​=⎣⎢⎢⎡​cosθsinθ00​−sinθcosθ00​0010​0001​⎦⎥⎥⎤​ Real Examples I used numpy.ndarray to store matrix, and used a third-party library for computing the composition and de-composition of transformation matrix. Computation Now let’s put our code to the test: Here are the transformation values I have in maya: 123maya_t = [-1.307, 0.331, 0.188]maya_r = [-335, -12, 98]maya_s = [1, 1, 1] Maya to Unity From the previous post, I’ve computed the change of basis matrix for Unreal 123456MAYA_TO_UNITY = np.array([ [-1, 0, 0, 0], [0, 1, 0, 0], [0, 0, 1, 0], [0, 0, 0, 1]], dtype=int) Now followed by our methods: 123maya_matrix = compose_matrix(maya_t, maya_r, maya_s, order=&#x27;sxyz&#x27;)unity_matrix = change_xform(maya_matrix, MAYA_TO_UNITY)unity_t, unity_r, unity_s = decompose_matrix(unity_matrix, order=&#x27;szxy&#x27;) Result: 1234# transform in Unitytranslation = [1.307, 0.331, 0.188] rotation = [7.3413883536944935, -26.641453221201548, -102.41010358310075] scale = [1.0, 1.0, 1.0] Important: for rotation since the returned values corresponds to the first, second and third rotation angle specified in the rotation order: which is in ‘zxy’, we need to swap values to re-order it as ‘xyz’. Maya to Unreal Same goes for Unreal, the change of basis matrix is: 123456MAYA_TO_UNREAL = np.array([ [1, 0, 0, 0], [0, 0, -1, 0], [0, 1, 0, 0], [0, 0, 0, 1]], dtype=int) Then comes our conversion method: 123maya_matrix = compose_matrix(maya_t, maya_r, maya_s, order=&#x27;sxyz&#x27;)unreal_matrix = change_xform(maya_matrix, MAYA_TO_UNREAL)unreal_t, unreal_r, unreal_s = decompose_matrix(unreal_matrix, order=&#x27;sxyz&#x27;) Result: 1234# transform in Unrealtranslation = [-1.307, 0.188, 0.331] rotation = [149.05728077227823, 75.61041143412538, 123.21509334477231] scale = [1.0, 1.0, 1.0] Caveat: I need to inverse the value of translation z, the reason I haven’t figured out yet, but translation is hardly our concern since we just need to flip axes between Maya values; The rotation value is the important one. Reference Transform3d API ThreeJS - Convert from one coordinate system to another? Tech Art Hub - A Practical Guide to Unreal Engine 4’s Coordinate System","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"unity","slug":"unity","permalink":"https://www.xingyulei.com/tags/unity/"},{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"math","slug":"math","permalink":"https://www.xingyulei.com/tags/math/"}]},{"title":"A Key to Unlocking 3D Software: Understanding Change of Basis Matrix","slug":"math-change-of-basis","date":"2022-09-25T07:00:00.000Z","updated":"2023-09-02T17:48:46.239Z","comments":true,"path":"post/math-change-of-basis/","link":"","permalink":"https://www.xingyulei.com/post/math-change-of-basis/","excerpt":"","text":"Introduction Different DCCs uses coordinate systems with different axis directions. For example, Maya by default uses a Y-up right-handed system; Unity uses a Y-up left-handed system; and Unreal uses a Z-up left-handed system. (Image from: Techart Hub) Up Direction: is what consider to be the up direction of the world. Moving an object up translating in direction of positive Y in Maya and Unity, but for Unreal, it’s translating in the direction of positive Z. Handed System: not only affects the forward/front direction of the world, it also dictates the direction of rotation; for left-handed system, positive rotation about the axis is clockwise, and for right-handed system, it’s counter-clockwise (same way as how our hand would curl, hence the name). The nature of the coordinate system affects how an object’s transformation is calculated. The Change of Basis matrix transforms a vector lies in one coordinate system to another. Basis Vectors In the world of 2D, the basis vectors xxx and yyy of one coordinate system A, corresponds to vx=[10] v_x = \\begin{bmatrix} 1 \\\\ 0 \\\\ \\end{bmatrix} vx​=[10​] and vy=[01] v_y = \\begin{bmatrix} 0 \\\\ 1 \\\\ \\end{bmatrix} vy​=[01​] Now, if these two basis vectors were to transfer to a different coordinate system B, this exact set of basis vectors is written differently in that system. This represents A’s basis vectors in B’s system. vx=[21] v_x = \\begin{bmatrix} 2 \\\\ 1 \\\\ \\end{bmatrix} vx​=[21​] and vy=[−11] v_y = \\begin{bmatrix} -1 \\\\ 1 \\\\ \\end{bmatrix} vy​=[−11​] Correspondingly, any vector in system B could translate to system A, pre-multiply using this change of basis matrix: Mcob=[2−111] M_{cob} = \\begin{bmatrix} 2 &amp; -1\\\\ 1 &amp; 1\\\\ \\end{bmatrix} Mcob​=[21​−11​] where the first column is the basis vector xxx and second column is the basis vector yyy. And alternatively, to translate any vector in system A to system B, we pre-multiply by the inverse of this change of basis matrix: Mcob−1{M_{cob}}^{-1}Mcob​−1. Transformation Now we know how to convert vectors between coordinate systems, how do we do it for transformation? Here are some simple step to understand: Given any vector in system B, apply a change of basis operation, so it’s in system A: Mcob∗vBM_{cob} * v_BMcob​∗vB​. Now we can apply a transformation represented in the same system A: MtransformA∗Mcob∗vBM_{transformA} * M_{cob} * v_BMtransformA​∗Mcob​∗vB​. Finally, we can transfer the end result back to system B by pre-multiplying the inverse of the change of basis matrix: Mcob−1∗MtransformA∗Mcob∗vB{M_{cob}}^{-1} * M_{transformA} * M_{cob} * v_BMcob​−1∗MtransformA​∗Mcob​∗vB​. Conclusion The frontal part Mcob−1∗MtransformA∗Mcob{M_{cob}}^{-1} * M_{transformA} * M_{cob}Mcob​−1∗MtransformA​∗Mcob​ represents the same transformation but in system B: MtransformBM_{transformB}MtransformB​. Alternatively, any transformation in system B: MtransformBM_{transformB}MtransformB​ can be represented as Mcob∗MtransformB∗Mcob−1M_{cob} * M_{transformB} * {M_{cob}}^{-1}Mcob​∗MtransformB​∗Mcob​−1 in system A. Here’s the function I’ve written Python: Example Maya to Unreal The first thing to identify is the change of basis from Maya to Unreal, as illustrated before, Maya is a Y-up left-hand system and Unreal is a Z-up right-hand system. Maya Axis Direction Forward Z Up Y Right -X Unreal Axis Direction Forward -Y Up Z Right -X The change of basis can be represented as such $ M_{cob} = \\begin{bmatrix} 1 &amp; 0 &amp; 0 &amp; 0\\ 0 &amp; 0 &amp; -1 &amp; 0\\ 0 &amp; 1 &amp; 0 &amp; 0\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} $ 123456MAYA_TO_UNREAL = np.array([ [1, 0, 0, 0], [0, 0, -1, 0], [0, 1, 0, 0], [0, 0, 0, 1]], dtype=int) Maya to Unity Same thing for Maya to Unity conversion, a Y-up left-hand system to a Y-up right-hand system; the yyy and zzz are respectively inverted between the two systems, therefore: Maya Axis Direction Forward Z Up Y Right -X Unity Axis Direction Forward Z Up Y Right X The change of basis can be represented as such $ M_{cob} = \\begin{bmatrix} -1 &amp; 0 &amp; 0 &amp; 0\\ 0 &amp; 1 &amp; 0 &amp; 0\\ 0 &amp; 0 &amp; 1 &amp; 0\\ 0 &amp; 0 &amp; 0 &amp; 1 \\end{bmatrix} $ 123456MAYA_TO_UNITY = np.array([ [-1, 0, 0, 0], [0, 1, 0, 0], [0, 0, 1, 0], [0, 0, 0, 1]], dtype=int) Reference YouTube - Change of basis | Chapter 13, Essence of linear algebra Unreal Engine Forum - “Forward” in unreal engine, Which is it? Dario Mazzanti - Change of Basis","categories":[{"name":"3d math","slug":"3d-math","permalink":"https://www.xingyulei.com/categories/3d-math/"}],"tags":[{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"unity","slug":"unity","permalink":"https://www.xingyulei.com/tags/unity/"},{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"math","slug":"math","permalink":"https://www.xingyulei.com/tags/math/"}]},{"title":"Euler Angles and Gimbal Lock: Things You Need to Know","slug":"math-euler-gimbal","date":"2022-09-17T07:00:00.000Z","updated":"2023-09-02T17:49:48.029Z","comments":true,"path":"post/math-euler-gimbal/","link":"","permalink":"https://www.xingyulei.com/post/math-euler-gimbal/","excerpt":"","text":"Introduction When talking about rotation, most of us would picture gimbal movement: an object rotate about a set of three axes. This is the same principle of the Euler angles presentation of rotation. It being the most popular representation for rotation, is used across many DCCs, it is intuitive and easy for us to understand. While an Euler angles are usually written as a list of three values representing rotation degrees in x, y, z axis. Scientifically it is actually denoted as α\\alphaα, β\\betaβ, γ\\gammaγ with radian as rotation unit where α\\alphaα is rotation about the first axis β\\betaβ is rotation about the second axis γ\\gammaγ is rotation about the third axis Rotation Order There are two major issue with Euler angles. Ambiguity The target orientation is rotation order dependent, meaning even with the same rotation α\\alphaα, β\\betaβ, γ\\gammaγ values, the results differs using different order of rotation. A zyx order refers to rotation about axis z, y, x in that order (think of it as x axis being a child of y axis being a child of z axis). Therefore, to represent a target rotation, aside from providing rotation values α\\alphaα, β\\betaβ, γ\\gammaγ, we also need to provide the rotation order and Rotation Type. There are a total of 12 possible rotation orders per rotation type/group. Gimbal Problem In short, the Gimbal problem is due to euler angle decomposing a (linear) rotational movement as a product of more than one axis rotations. Although any target orientation can be achieved using Euler rotation, the rotational movements are sometimes undesired. This is due to a problem in Animation field known as Gimbal Lock. Gimbal lock happens when two of the three axes are rotated to a parallel configuration, 'locking' the system into a two-dimensional space. In order to “break free” of this configuration, the system needs to input rotation along two or more axes simultaneously. In the context of keyframe Animation, interpolation along more than one axis means the rotational movement will not appear linear, but in an unpredictable trajectory, which is bad. (See video illustration here) Test in Maya We can test out the gimbal problem in Maya ourselves. Going into rotation tools and select “Axis Orientation” to “Gimbal”, we can now interact with the object using gimbal rotation. This rotation is what actually get recorded by Maya and presented in the channel box. If we go back to the “Object” mode rotation, even though our rotation gizmo is now unlocked, the gimbal problem don’t just go away. Maya is still recording the gimbal rotation in the background. The “Object” mode rotation is just an interaction tool. Gimbal Mode Object Mode Quaternion Rotation lies in non-Euclidean space. Luckily there is a more advanced representation for rotation: Quaternion, which game engines uses internally. This is due to it being data compact (only stores four numbers) and computational efficient (rotational movement using Euler angles usually need to be converted to rotation matrix, which involves a lot of sin and cos calculation). The bigger advantage comes from it producing linear and predictable results (the shortest path along source and target rotation). It is, however, very hard for users to comprehend. A quaternion consists of a scaler part and a vector part: q=[s,(x,y,z)]q = [s, (x, y, z)]q=[s,(x,y,z)] where s,x,y,z∈Rs, x, y, z \\in Rs,x,y,z∈R or. q=s+ix+ij+kzq = s + ix + ij + kzq=s+ix+ij+kz where i2=j2=k2=ijk=−1i^2 = j^2 = k^2 = ijk = -1i2=j2=k2=ijk=−1 Rotation Type Intrinsic and Extrinsic Rotations Intrinsic rotations are elemental rotations that occur about the axes of a coordinate system XYZ attached to a moving body. (i.e. rotation about axis in the current coordinate, like object space) Extrinsic rotations are elemental rotations that occur about the axes of the fixed coordinate system xyz. (i.e. rotation about axis in the original coordinate, like world space) (Fig.1: Intrinsic rotations; Fig.2: Extrinsic rotations) Example Rotation calculation usually happens along with other transform type using matrix. Here I made a matrix composition and decomposition function in Python, utilizing a third party math library transforms3d. As we can see, since the rotation matrix varies depending on rotation order and type, this is reflected as one of the argument. The first character is ‘r’ (rotating == intrinsic), or ‘s’ (static == extrinsic). The next three characters give the axis (‘x’, ‘y’ or ‘z’) about which to perform the rotation, in the order in which the rotations will be performed. For example the string ‘szyx’ specifies that the angles should be interpreted relative to extrinsic (static) coordinate axes, and be performed in the order: rotation about z axis; rotation about y axis; rotation about x axis. Conversion Any extrinsic rotation can be represented in intrinsic rotation with the same angle values but inverted order or elemental rotation. So a α\\alphaα, β\\betaβ, γ\\gammaγ with extrinsic zyx order is equivalent to the same angle with intrinsic xyz order. Reference Stack Exchange - Confusion about order of rotations for Euler Angles Unreal Engine Forum - What is the rotation order for Components or Bones? Stack Exchange - Proof of the extrinsic to intrinsic rotation transform YouTube - Euler (Gimbal Lock) Explained TD Matt - Rotation Orders CSDN - Understanding Euler Angles","categories":[{"name":"3d math","slug":"3d-math","permalink":"https://www.xingyulei.com/categories/3d-math/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"math","slug":"math","permalink":"https://www.xingyulei.com/tags/math/"}]},{"title":"Unreal Engine Cinematic FBX Workflow Explained","slug":"ue-cinematic-fbx","date":"2022-08-13T07:00:00.000Z","updated":"2023-09-02T18:05:03.227Z","comments":true,"path":"post/ue-cinematic-fbx/","link":"","permalink":"https://www.xingyulei.com/post/ue-cinematic-fbx/","excerpt":"","text":"Introduction How do we transfer assets and animation to Unreal needed for cinematic? .fbx is the way to go (at least for now). For each component of a cinematic, we want to set it up nicely so the data can be correctly presented in Unreal. However, do note there are limitations in .fbx and differences between DCCs, certain things just can’t be transferred through .fbx and certain things can’t be represented in Unreal. Always test your workflow before going into full scale production. Please refer to Unreal’s FBX Content Pipeline General The important thing to keep in mind is that consistency is king, we want to have consistent world unit, identify coordinate system for each DCC, and maintain a hierarchy standard for assets across DCCs. Certain workflow involves animating or placing components within Unreal instead of importing outside the engine which is totally fine. Static Mesh Static Meshes represents anything that is not animated, like a background environment. There shouldn’t be any keys on any of the transforms or attribute. They are meant to be modeled outside Unreal, and imported as a static mesh asset, placed in the level as a static mesh actor. Export: In the outliner, select all the meshes and export as .fbx Import: Make sure ‘combine mesh’ is checked, otherwise the asset will be imported as separate meshes (probably not what we want) We have three types of Unreal assets created: Static Mesh, Textures and Materials. Static Mesh Animation If a mesh is animated in any capacity, even if it’s just translating or rotating as a whole without any deformation, it needs to be skinned with joint(s). Consider this as a common standard. See the process of Skeletal Mesh in the immediate following. Note: the joint transform pivot needs to be align with the mesh transform pivot. Example: Take a look at our previous flag prop. If we want to animate the flag like moving it around in Unreal, it needs to have joint hierarchy where we can apply animation to, even if it’s simple as this. Applying animation directly to transform is not recommended. Also, no need to worry about the extra joint and weight data added, the file size increase is negligible (&lt;10%). Skeletal Mesh (SKM) Skeletal Mesh could be used to represent an animated foreground prop or environment, or something as complicated as a character/creature. Example: Export Rigging in Game vs Animation A complex animation rig can’t translate 1 to 1 to game engine, the rigging phase needs to be planned to accommodate the limitation of the engine. Once we have a suitable rig in Maya, we need to prepare it for the engine. We would clean the rig up to get a desired hierarchy which contains only joints and meshes. So remove components like controllers and constraints, also get rid of any redundant namespace. Import In addition to Textures and Materials, we have three major components imported: Skeleton, Skeletal Mesh and Physics Asset. Skeleton: refers the joint hierarchy, it uses the Skeletal Mesh as the preview mesh Skeletal Mesh: is the Skinned Mesh along with the Skeleton Physics Asset: defines physics and collision used by the Skeletal Mesh (sometimes even rendering), a rough physics collision body is defined during import. Note: Blendshape / Morph Target can be imported during the Skeletal Mesh import step by toggling on the checkbox, this is required if we want to import blendshape animation. Skeletal Mesh Animation The exported animation should maintain the exact same hierarchy structure of the exported rig Generally, the root of the rig/skeleton, whether it’s a transform group or a root joint, should not have animation/keyed data on it, as it is generally used to offset world transform (and keyed transform can’t do that) Export Since keyframes are usually on controllers, so we have to bake the keys on all joints. Select the joint hierarchy and Bake Simulation, after that we can get rid of the controllers and constraints just like what we did during the rig clean up. This time, we only need to export the joint hierarchy (no meshes). Import (as Animation Sequence) Now during import phase simply select the Skeleton Unreal asset that matches our animation, no need to create a new Skeletal Mesh. An Animation Sequence Unreal asset is now created, we can also see a preview mesh through the Editor window. It is now ready to be used in the Sequencer. Blend Shape / Morph Target Animation Unreal supports blend shape (or morph target in Unreal’s term) animation, there are two ways it can be done: https://docs.unrealengine.com/4.27/en-US/WorkingWithContent/Importing/FBX/MorphTargets/ (Preferred) Custom Attribute on Joint https://docs.unrealengine.com/5.1/en-US/animation-curves-in-unreal-engine/ This feature is new in Unreal 5.0 add custom attribute(s) on any joint in the skeleton hierarchy (match all the blend shape attribute names 1 to 1) export only the joint chains (no need to include any meshes, no need to check ‘blend shape’ during export) import in Unreal with ‘Import Custom Attribute’ checked This will ensure the keys on custom attributes which are on the joint chain to propagate through and drive the morph targets. Ideally, all the custom attributes can be set on the skeleton root. This method is preferred as it makes the export process easier by only needing to export the skeleton / joint chain, which is faster and light weight. Blend Shape Node find all meshes with blend shape node attached traverse in the node editor and locate the blend shape node bake simulation on the blend shape node include these meshes (ones with blend shape) during the export process, also make sure the ‘blend shape’ is checked in the fbx export option import in Unreal (can leave ‘Import Custom Attribute’ unchecked) Although this process doesn’t need setting up custom attributes on joint(s), it exports out redundant mesh data which is why it’s not a preferable way. Camera Animation Maya Camera cannot be imported as an Unreal asset. Unreal has its own native Camera object, which is not 1-to-1 match to Maya’s Camera. What we can do is export Maya camera’s animation and attribute and import on an Unreal Cinematic Camera Actor. See video guide here Export The camera node has to be on the scene root, with no transform node on top. Otherwise, the animation won’t be imported correctly as Unreal is searching for the top node. Import (as Keyframes) Cameras are linked to the game viewport, therefore animation import needs to be plotted on the Sequencer as individual keyframes instead of being an Unreal asset. Create a camera track and bind it to a newly created Unreal CineCameraActor and hit ‘Import’. Maya FBX Export Option Reference FBX Export options: Full Help Embed Media: Could be checked during Static Mesh/Skeletal Mesh export based on needs, the Unreal import can pick up the texture and materials embedded. Smoothing Group: Usually needs to be checked so Unreal can use the smoothing group exported from Maya as opposed to perform smoothing calculation on Unreal side. Include Children: Almost always keep unchecked, and explicitly select nodes to export. Input Connections: Keep unchecked is usually a good idea to avoid exporting extra data, but also depends on different circumstances Deformed Models: For Skeletal Mesh export which is commonly a rig, check “Skins” to export skin deformation like skin clusters, check “Blend Shapes” to export all blend shape targets. For Skeletal Mesh Animation export, uncheck “Skins” and “Blend Shapes”. Skinning data is embedded within the Skeletal Mesh Asset in Unreal, and for blend shapes, as long as we are following this step, the imported .fbx would also carry over blend shape animation. Bake Animation: Leave this unchecked and use Maya’s Edit | Keys | Bake Simulation, as it offers more flexible solutions and is also generally much faster. Unreal FBX Import Option Reference FBX Import Options Reference: Full Help Static Mesh: “Import Mesh” checked “Create New Materials” and “Import Textures” as needed Skeletal Mesh: Leave “Skeleton” blank, if you need to create a new skeleton asset “Create Physics Asset”, if you need to create a new PA “Skeletal Mesh” and “Import Mesh” checked to import skinned meshes “Create New Materials” and “Import Textures” as needed “Import Morph Targets” if blend shape animation will be needed Skeletal Animation: (Import as Animation Sequence) Choose existing skeleton for “Skeleton” “Import Mesh” unchecked to avoid importing blend shape source mesh if blend shape was exported during Maya export “Import Animations” checked “Import Custom Attribute” checked if using custom attribute on joint for blend shape animation Camera Animation: (Import as keyframes in Sequencer) “Matches by Name Only” unchecked “Create Cameras” unchecked “Replace Transform Track” checked “Reduce Keys” unchecked","categories":[{"name":"unreal cinematic","slug":"unreal-cinematic","permalink":"https://www.xingyulei.com/categories/unreal-cinematic/"}],"tags":[{"name":"pipeline","slug":"pipeline","permalink":"https://www.xingyulei.com/tags/pipeline/"},{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"}]},{"title":"Create Professional-Quality Cinematics with Unreal Engine: An Easy-to-Follow Guide","slug":"ue-cinematic-sequencer","date":"2022-07-16T07:00:00.000Z","updated":"2023-09-02T18:05:37.487Z","comments":true,"path":"post/ue-cinematic-sequencer/","link":"","permalink":"https://www.xingyulei.com/post/ue-cinematic-sequencer/","excerpt":"","text":"Introduction In this blog, I’m going to introduce the different components of a cinematic, how they are represented. This hopefully will give you an overview of how cinematic works in Unreal. Glossary Skeleton: a hierarchy that is used to define Bones (sometimes called joints), In Unreal, skeletons are used to store/driven by associated animation data. Static Mesh: a piece of geometry that consists of a set of polygons that can be cached in video memory and rendered out. Skeletal Mesh: in short is a collection of a skeleton hierarchy, and mesh(es) skinned to that skeleton. A set of polygons composed to make up the surface of the Skeletal Mesh, and a hierarchical set of interconnected bones which can be used to animate the vertices of the polygons Level: is all or part of our game’s “world”. Levels contain everything a player can see and interact with, like environments, usable objects, other characters, and so on. Actor: an Actor is any object that can be placed into a Level, such as a camera, Static Mesh, or player start location. Actors support 3D transformations such as translation, rotation, and scaling. They can be created and destroyed. Binding: a track in sequencer that binds a specific actor in the level, enables the level sequence to modify or animate its property when the level sequence is active. What makes a Sequencer Similar to other film and animation editing software, Sequencer requires us to add tracks in order to reference elements in our sequence. Any character, prop, camera, effect, or other viewport element can be referenced and manipulated in Sequencer Level Sequence A Level Sequence asset is a container for cinematic data, which includes tracks, animation and binding. Level Sequence Track If you used any video editing software, then tracks shouldn’t be new to you. Tracks are like layers, and the Level Sequence is the whole canvas; Tracks usually are used to reference different actors in the level, and then animated its properties. So in most time, tracks don’t overlay each other like layers in Photoshop do, they’re more like controlling different color channels that compose the final image. Level Sequence Section Asset Sections are the components that laid out in a Track, sections can be treated as individual animation clips of which make up the whole track. Some common section are Camera Cuts section, Shots section and Animation section. Basic Cinematic Component We’ll break down a cinematic as the following components and tackle them one by one. Camera (Camera Actor) Background (Static Mesh Actor) Foreground &amp; Character (Skeletal Mesh Actor) Lighting (Light Actor) FX (Visual Effects Actor) Audio (Sound Wave Asset) Other Actor to Sequence (Object Binding) The level sequence operates within levels and operates on actors in the level. It can bind to an existing actor and animates its properties. It can also spawn an actor as needed. Spawnables vs. Possessables Static Mesh This is the simplest scenario, a static mesh actor is bound to the level sequence and the transform are keyed. Skeletal Mesh When it comes to skeletal mesh, another component is exposed: Animation. This sub-track takes Unreal Animation Sequence assets, which consists the skeleton animation, this effectively drives the skeleton within the skeletal mesh actor. Camera Binding and Camera Cut In order to set up camera view properly, in-addition to the camera binding, we also need a Camera Cuts Track. Whatever is on this track is what the viewport is capturing, it allows us to switch and blend between different cameras. (In short, the Camera Binding tracks drives the Camera Actor, the Camera Cut track decides what takes over the viewport) Audio Audio can be created using by possessing an audio/sound actor, or alternatively it can be created by adding Unreal Sound Wave asset. I would recommend the latter as it allows us to scrub in the timeline and still have the correct audio playback. Note: Set Sound Wave Asset’s ‘Sound Asset Compression Type’ to ‘PCM’ so it plays correctly when scrubbing in timeline. More There are of course different actor types in the level that the level sequence can possess/bind to. Such as Light Actors, Gameplay Actors, Visual Effects Actors and more. Sub-sequence and Shot There are other two types of concept I’d like to touch upon: Subsequences and Shots. They are usually not directly bound to an actor, but they are containers for a level sequence that does. They can be very useful to organize and composite the cinematic level sequence structure. Subsequences represent an entire Level Sequence. Having subsequences allows multiple level sequence to be added into a “parent” level sequence, These subsequences can be considered as the partition of the “parent” and can be worked on as different sub-scenes by different artists. (Image from Unreal) Similar to Subsequence, each Shot Section represents a Level Sequence, it allows multiple level sequences be assembled and re-arranged freely on the Shots Track as Shot Section to form the full sequence/cinematic. This is to get rendering in Unreal to work correctly, and able to set per-shot preset in Movie Render Queue. Note: avoid using the “lock” property in any of the clip as it sometimes causes un-wanted behaviours. High Quality Render with Motion Blur When implementing a setup with a full sequence length animation clip (skeletal mesh .fbx not being broken down into shots). It is important to follow the following to ensure there’s no Motion Blur produce during camera cuts. Camera: separate camera actor for each shot. Animation: leave the animation clip as ‘Keep State’ when finished if possible. Subsequence: a good practice is to not extend sub-sequence range over the shot active range; Unreal still calculates motion in sub-sequence extending beyond the range of the shot active range such as Motion Blur, which can produce unwanted result during cuts between shots. Render Preset Camera Setting has to be set to ‘Frame Close’ Anti-aliasing Setting can be toggled on for better quality For more information on setting up a sequencer with correct first frame, see Epic’s post on render warm-ups References Unreal Engine Documentation - Cinematics and Sequencer","categories":[{"name":"unreal cinematic","slug":"unreal-cinematic","permalink":"https://www.xingyulei.com/categories/unreal-cinematic/"}],"tags":[{"name":"pipeline","slug":"pipeline","permalink":"https://www.xingyulei.com/tags/pipeline/"},{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"}]},{"title":"Say Goodbye to Freezing with Qt Multithreading: Learn with Examples","slug":"qt-threading","date":"2022-05-15T07:00:00.000Z","updated":"2023-09-02T18:04:34.782Z","comments":true,"path":"post/qt-threading/","link":"","permalink":"https://www.xingyulei.com/post/qt-threading/","excerpt":"","text":"Introduction It is inevitable that some of our tasks in the program will take long time to run, leaving the user staring at a frozen screen, whether it is reading/writing a large file, searching database or syncing assets. In a production environment, these seconds can really add up for the entire team; can you imagine how many working hours are wasted when every user need to wait for, let’s say, a library tool to query the entire asset database and finally displaying them every single time. We can surely improve the query, but that’s usually not where the bottleneck is. The speed of querying is usually sufficient for human brain to process. What we want is not to be slow down by un-interactive GUI. So, why not have assets to fill little by little in a continuous stream, or just query their name first, and use a separate thread to load in rest of the information like date created, author and thumbnail. Now, let’s get straight to the point. I’m going to show three basic examples of different methods to deal with frozen GUI, each has its own use cases. Example Issue 1234567891011121314151617181920212223242526272829import timeclass Window(QtWidgets.QMainWindow): def __init__(self, parent=None): QtWidgets.QMainWindow.__init__(self, parent) # ui setup: please ignore widget = QtWidgets.QWidget() layout = QtWidgets.QGridLayout() button = QtWidgets.QPushButton(&#x27;run task!&#x27;) button.clicked.connect(self.run_long_task) edit = QtWidgets.QLineEdit() layout.addWidget(edit, 0, 0) layout.addWidget(button, 1, 0) widget.setLayout(layout) self.setCentralWidget(widget) def run_long_task(self): time.sleep(2)if __name__ == &#x27;__main__&#x27;: app = QtWidgets.QApplication(sys.argv) win = Window() win.show() sys.exit(app.exec_()) Here I created a simple example to show how a long-running task can block controls in our Qt Gui. The run_long_task() is simply a time.sleep() that will halt for 2 seconds util returning control back to the main event loop. After evoking the run_long_task() method, we can no longer interact with the line edit from our UI, until the task has finished. (Clicking and typing has no effect while task is running) processEvent() Using QApplication.processEvent() can achieve a semi-interactive GUI during a long-running task. Here’s to show what I meant. Let’s add a progress bar to track our task status. 123456789101112131415161718192021class Window(QtWidgets.QMainWindow): def __init__(self, parent=None): QtWidgets.QMainWindow.__init__(self, parent) # ui setup: add progress bar self.ui_progress = QtWidgets.QProgressBar() self.statusBar().addPermanentWidget(self.ui_progress) ... def update_status(status_bar, msg): status_bar.showMessage(msg, 2000)def update_progress(progress_bar, value): progress_bar.setValue(value) if value &gt;= 100: progress_bar.setVisible(False) elif progress_bar.isHidden(): progress_bar.setVisible(True) And now, by evoking the static method processEvent() during the long-running task, we enforce Qt to handle normal events like updating GUI, and respond to our user input, before handing the control back to the task. 1234567def run_long_task(self): for i in range(1, 11): sleep(0.5) update_status(self.statusBar(), str(i)) update_progress(self.ui_progress, i*10) QtCore.QCoreApplication.processEvents() Now, as we can see, our main GUI can update the progress bar and messages, and even allow us to sort of interact with the line edit, but the interaction is by no means smooth. (Somewhat interactive, yet choppy) Before we create a real multi-threading solution, first, let’s establish a signal slot workflow that Qt provides: instead of updating the progress bar and status bar by calling its method directly, we emit a signal to handle that. 12345678910def __init__(self): ... self.progressed.connect(lambda value: update_progress(self.ui_progress, value)) self.messaged.connect(lambda msg: update_status(self.statusBar(), msg))def run_long_task(self): for i in range(1, 11): sleep(0.5) self.progressed.emit(int(i*10)) self.messaged.emit(str(i)) QThread Instead of directly subclassing QThread(), it is recommended by many to create a QObject() and attach it to a QThread(). The QObject() we created, known as the worker, will be running our long-running task, and emits the update signals. It is important to keep a note that, the QThread() that houses our worker needs to live in the main event loop (i.e. kept in the main application as self.__thread). If not, it will be collected by gc and the thread will exit pre-maturely. thread.worker = worker is also essential if the worker doesn’t live in the main event loop (i.e. self.__worker). Now as we can see, we can freely interact with the line edit while the long-running task is handled in the background. (Very smooth typing) QThreadPool and QRunnable A natural progression would be handling multiple long-running tasks, luckily, we have QThreadPool for that. In the following example, we have three long-running task in the background, while we still have free control of the main GUI. (Multiple threads and smooth typing) QThreadPool manages QRunnable, which doesn’t have built-in signals, thus we need to attach signals externally by creating a QObject to store them. QThreadPool also deletes the QRunnable instances automatically when it finishes by default. if max thread is exceeded, the process is queued until a thread is available. Reference PythonGUIs - Multithreading PyQt5 applications with QThreadPool Maya’s Programming &amp; Electronics Blog - How To Really, Truly Use QThreads; The Full Explanation Stack Overflow - Background thread with QThread in PyQt Qt doc - Process Events","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"threading","slug":"threading","permalink":"https://www.xingyulei.com/tags/threading/"},{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"}]},{"title":"Create Stunning Pie Charts in Qt : A Step-by-Step Tutorial (with Examples)","slug":"qt-pie-chart","date":"2022-04-27T07:00:00.000Z","updated":"2023-09-02T17:59:21.039Z","comments":true,"path":"post/qt-pie-chart/","link":"","permalink":"https://www.xingyulei.com/post/qt-pie-chart/","excerpt":"","text":"Introduction It’s time to learn new stuff again. This time, I want to implement a data visualization component in my tool: pie charts. I had some experience with matplotlib before, but I’m excited to find out that Qt has an add-on module QtCharts that can integrate with Qt application. Here are my learning results: on the left side, I created a static and simplistic design and on the right side, a slightly more flashy, animated design. In this blog, I will break down how they are created. They are also available in my guiUtil with full code. Example #1 Example #2 Installing QtCharts QtCharts was first introduced as an add-on module in Qt in version 5.7, so the Qt.py for Python Qt binding doesn’t support QtCharts as it isn’t available in PyQt and PySide. check your PySide2 or PyQt5 version:QtCore.qVersion(). (I’m using PyQt5 version 5.15.2) install the corresponding version of PyQtChart using 1pip install PyQtChart finally, test import from PyQt5 import QtCharts The Basics Classes QChart: QChart refers to the main diagram, in our case the pie chart is a QChart object. QPieSeries: To draw a pie chart, we’ll need one or more QPieSeries added to our QChart object, to form the circular shape. To build other types of chart, we’ll want to use Series such as QBoxPlotSeries, QCandlestickSeries, QXYSeries, QAreaSeries or QAbstractBarSeries. QPieSlice: a QPieSlice object represents a slice inside a QPieSeries object. Components There are other components that the examples will cover. Value reflects the size/span of each slice, and is added one by one in run-time to the QPieSeries. We’re able to retrieve useful information such as percentage and span angle once all the data is added. Label is a crucial component within the scope of the QPieSlice. Label can be displayed in different ways (Inside the slice: LabelInsideHorizontal, LabelInsideTangential, LabelInsideNormal or outside the slice: LabelOutside with labelArm). Legend in default, is attached to QChart, connecting with the labels of all the QPieSlice. We can separate it by detaching it or setting each individual markers (items) of the legend. We also defined an immutable data structure to represent the data fed into the QChart, which we’ll take a look shortly. Example 1 1234567891011121314151617181920212223242526class MySimpleChart(QtChart.QChart): def __init__(self, datas, parent=None): super(MySimpleChart, self).__init__(parent) self._datas = datas self.outer = QtChart.QPieSeries() self.set_outer_series() self.addSeries(self.outer) def set_outer_series(self): slices = list() for data in self._datas: slice_ = QtChart.QPieSlice(data.name, data.value) slice_.setLabelVisible() slice_.setColor(data.primary_color) slice_.setLabelBrush(data.primary_color) slices.append(slice_) self.outer.append(slice_) # label styling for slice_ in slices: label = &quot;&lt;p align=&#x27;center&#x27; style=&#x27;color:&#123;&#125;&#x27;&gt;&#123;&#125;%&lt;/p&gt;&quot;.format(round(slice_.percentage()*100, 2)) slice_.setLabel(label) We start off by subclassing QChart, we then would want to add a QPieSeries as a container for inserting our slices (generated from our data). A simplified process: 123456pie_chart = QChart()series = QPieSeries()slice_ = QPieSlice(label, value)series.append(slice_)pie_chart.addSeries(series) note: slice is a Python built-in name so I’m against using it as variable name Labels and Legend As we can see from the example above, we have some flexibility with label formatting (QLabel methods and HTML formatting), we can also do legend formatting to some extent. Such as alignment and marker shapes. 12self.legend().setAlignment(QtCore.Qt.AlignRight)self.legend().setMarkerShape(QtChart.QLegend.MarkerShapeCircle) we can even separate legend vs. slice label, so they could display different content (but it may be bad being practice to unlink the two) 12for index, marker in enumerate(self.legend().markers()): marker.setLabel(self._datas[index].name) Other Adding variation can be easily done by shifting angles of all the slices. 123offset = 40self.outer.setPieStartAngle(offset)self.outer.setPieEndAngle(offset+360) If the outside labels are cramped together, we can create additional spacing by extending the label arm: 1slice_.setLabelArmLengthFactor(0.4) Example 2 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152class MyChart(QtChart.QChart): def __init__(self, datas, parent=None): super(MyChart, self).__init__(parent) self._datas = datas self.legend().hide() self.setAnimationOptions(QtChart.QChart.SeriesAnimations) self.outer = QtChart.QPieSeries() self.inner = QtChart.QPieSeries() self.outer.setHoleSize(0.35) self.inner.setPieSize(0.35) self.inner.setHoleSize(0.3) self.set_outer_series() self.set_inner_series() self.addSeries(self.outer) self.addSeries(self.inner) def set_outer_series(self): slices = list() for data in self._datas: slice_ = QtChart.QPieSlice(data.name, data.value) slice_.setLabelVisible() slice_.setColor(data.primary_color) slice_.setLabelBrush(data.primary_color) slices.append(slice_) self.outer.append(slice_) # label styling for slice_ in slices: color = &#x27;black&#x27; if slice_.percentage() &gt; 0.1: slice_.setLabelPosition(QtChart.QPieSlice.LabelInsideHorizontal) color = &#x27;white&#x27; label = &quot;&lt;p align=&#x27;center&#x27; style=&#x27;color:&#123;&#125;&#x27;&gt;&#123;&#125;&lt;br&gt;&#123;&#125;%&lt;/p&gt;&quot;.format( color, slice_.label(), round(slice_.percentage()*100, 2) ) slice_.setLabel(label) def set_inner_series(self): for data in self._datas: slice_ = self.inner.append(data.name, data.value) slice_.setColor(data.secondary_color) slice_.setBorderColor(data.secondary_color) Inner and Outer Series To create a circular/loop shape pie chart, we need to create a hole with setHoleSize(). And the inner loop and outer loop are two separate series adjacent to each other. In the example, I used a light color for inner loop (50% blend with white) and used solely the outer loop to display labels and values. Also, in order for labels to be displayed properly, I added a condition so that label will be displayed outside when the angle span is less than a threshold. Exploding Animation QPieSlice has a built-in hovered signal for us to achieve the exploding effect when mouse hovering over. 12345678910111213141516def set_outer_series(self): ... slice_.hovered.connect(partial(self.explode, slice_))def explode(self, slice_, is_hovered): if is_hovered: start = slice_.startAngle() end = slice_.startAngle()+slice_.angleSpan() self.inner.setPieStartAngle(end) self.inner.setPieEndAngle(start+360) else: self.inner.setPieStartAngle(0) self.inner.setPieEndAngle(360) slice_.setExplodeDistanceFactor(0.1) slice_.setExploded(is_hovered) The outer loop explosion can be set using slice_.setExploded(); The inner loop shifting is done by offsetting the pie start and end angle. Also, make sure we have set QChart.SeriesAnimations on the QChart object. Bonus Custom Data Class 1234567from collections import namedtupleData = namedtuple(&#x27;Data&#x27;, [&#x27;name&#x27;, &#x27;value&#x27;, &#x27;primary_color&#x27;, &#x27;secondary_color&#x27;])node = Data(&#x27;Node&#x27;, 333, QtGui.QColor(&quot;#82d3e5&quot;), QtGui.QColor(&quot;#cfeef5&quot;))connection = Data(&#x27;Connection&#x27;, 105, QtGui.QColor(&quot;#fd635c&quot;), QtGui.QColor(&quot;#fdc4c1&quot;))other = Data(&#x27;Other&#x27;, 20, QtGui.QColor(&quot;#feb543&quot;), QtGui.QColor(&quot;#ffe3b8&quot;)) A helper data structure for adding items to our pie chart. Generally, only the label/name and the value are required. I also assigned specific color values to achieve certain palette, but they can be randomly generated in the QChart class as well. Putting it Together The last thing we need to do is add a main body and instantiate a pie chart with some random data. We do this using a QChartView container. All the code is available at guiUtil. 12345678910111213141516171819202122import sysclass ChartView(QtWidgets.QMainWindow): def __init__(self, parent=None): super(ChartView, self).__init__(parent) self.setFixedSize(QtCore.QSize(700, 400)) datas = [node, connection, other] chart = MySimpleChart(datas) chart_view = QtChart.QChartView(chart) chart_view.setRenderHint(QtGui.QPainter.Antialiasing) self.setCentralWidget(chart_view)if __name__ == &#x27;__main__&#x27;: global win app = QtWidgets.QApplication(sys.argv) win = ChartView() win.show() sys.exit(app.exec_()) Reference Qt Doc - Nested Donut Example Qt Doc - QLegend Qt Doc - QChart Qt Doc - QPieSeries Qt Doc - QPieSlice Stack Overflow - Attach colors of my choosing to each slice of QPieSeries","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"}]},{"title":"Python Power Move: Run Commands as Admin with These Simple Examples","slug":"py-admin","date":"2022-03-19T07:00:00.000Z","updated":"2023-03-29T21:22:54.000Z","comments":true,"path":"post/py-admin/","link":"","permalink":"https://www.xingyulei.com/post/py-admin/","excerpt":"","text":"Introduction We often find ourselves needing to automate tasks on Windows machine, Although there are many Python libraries out there that supports some common Windows operations and even cross-platforms. It is really hard to substitute Window’s Command Prompt and PowerShell, as they are extremely useful in cases where we need to access different Windows components, configure settings and troubleshooting. User Account Control (UAC) Standard user accounts are for day-to-day activities with less permission, while the administrator account has elevated access for all features. For my personal machine, I’m operating on admin account all time (as the sole user). But Windows, for security reasons, still treats most of my actions as standard account. It only elevates to admin privilege when my operations want to make internal changes to Windows settings and my machine. The UAC feature when enabled, prompts the user when such action occurred and request for admin access. Additionally, for standard user, it means they need to ask for administrator account login. When the sign in is an administrator type account When the sign in is a standard type account Now, in terms of task automation in Python, we’ll also want to figure out how to run certain operations with Admin privilege. Using subprocess Like most of us, I have been using subprocess to evoke cmd.exe or powershell.exe as desired by passing arguments as list into the function. Command Prompt: command = ['cmd.exe', '/c', &lt;argument&gt;] PowerShell: command = ['powershell.exe', '-command', &lt;argument&gt;] 12345678910import subprocessdef runCmd(*args): p = subprocess.Popen( *args, stdout=subprocess.PIPE, stderr=subprocess.STDOUT ) out, error = p.communicate() return out, error But this doesn’t grant the process with admin privilege, and won’t notify us with UAC. How to achieve this? here are some ways to do it. Using ShellExecute runas 12345678910import ctypescommands = u&#x27;/k echo hi&#x27;ctypes.windll.shell32.ShellExecuteW( None, u&quot;runas&quot;, u&quot;cmd.exe&quot;, commands, None, 1 ) runas from the Windows API launches an application as Administrator. User Account Control (UAC) will prompt the user for consent to run the application elevated or enter the credentials of an administrator account used to run the application. What about a more pythonic approach? Using runas in Command Prompt runas application runs command as a different user; it is most commonly used but not limited to perform operation with administrator account for granting admin access. Note: the password is handled outside UAC, which may not be the desired behavior 1234command = [&#x27;cmd.exe&#x27;, &#x27;/c&#x27;, &#x27;runas&#x27;, &#x27;/user:administrator&#x27;, &#x27;regedit&#x27;]p = subprocess.Popen(command, stdin=subprocess.PIPE)p.stdin.write(&#x27;password&#x27;)p.communicate() Using PowerShell -Verb Runas This is my preferred method, since it is most flexible and also evokes UAC for admin access. Start-Process 1Start-Process &lt;executable&gt; -argumentlist &lt;arugments&gt; -Verb Runas Call operator (&amp;) by adding call operator, we are able to run commands not limited in the environment path, also not need to worry about spaces in our path. 1&amp; &#123;Start-Process &lt;executable&gt; -argumentlist &lt;arugments&gt; -Verb Runas&#125; -ExecutionPolicy Bypass Sometimes, a security setting will prevent PowerShell running a .ps1 file, and we’ll need to bypass execution policy: 1Start-Process &lt;executable&gt; -ExecutionPolicy Bypass -File &lt;file&gt; It is very obvious from the above example, we can basically use PowerShell to wrap around anything, including Command Prompt. 1Start-Process cmd.exe -argumentlist &#x27;/k &quot;dir&quot;&#x27; -Verb Runas To bundle everything together, a working example would look like this in Python: 123ps_command = &quot;&amp; &#123;&#123;Start-Process cmd.exe -argumentlist &#x27;/k \\&quot;dir\\&quot;&#x27; -Verb Runas&#125;&#125;&quot;command = [&#x27;powershell.exe&#x27;, &#x27;-command&#x27;, ps_command]runCmd(command) essentially using subprocess to run PowerShell in admin using -Verb Runas to execute command /k dir in Command Prompt (which also has elevated access). Redirect Output By doing the above, we are running an executable within a process. the sacrifice is that it is difficult to pass the output, but here’s a few workarounds: Output results to a file 1Start-Process cmd.exe -argumentlist &#x27;/c &quot;dir&quot;&#x27; -redirectStandardOutput &quot;C:\\Users\\xlei\\Desktop\\temp.txt&quot; Output result to the console Just the exit code: 12$output = Start-Process cmd.exe -argumentlist &#x27;/c &quot;dir&quot;&#x27; -PassThru -Wait$output.ExitCode A neat function I found here 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051function Start-ProcessWithOutput&#123; param ([string]$Path,[string[]]$ArgumentList) $Output = New-Object -TypeName System.Text.StringBuilder $Error = New-Object -TypeName System.Text.StringBuilder $psi = New-object System.Diagnostics.ProcessStartInfo $psi.CreateNoWindow = $true $psi.UseShellExecute = $false $psi.RedirectStandardOutput = $true $psi.RedirectStandardError = $true $psi.FileName = $Path if ($ArgumentList.Count -gt 0) &#123; $psi.Arguments = $ArgumentList &#125; $process = New-Object System.Diagnostics.Process $process.StartInfo = $psi [void]$process.Start() do &#123; if (!$process.StandardOutput.EndOfStream) &#123; [void]$Output.AppendLine($process.StandardOutput.ReadLine()) &#125; if (!$process.StandardError.EndOfStream) &#123; [void]$Error.AppendLine($process.StandardError.ReadLine()) &#125; Start-Sleep -Milliseconds 10 &#125; while (!$process.HasExited) #read remainder while (!$process.StandardOutput.EndOfStream) &#123; #write-verbose &#x27;read remaining output&#x27; [void]$Output.AppendLine($process.StandardOutput.ReadLine()) &#125; while (!$process.StandardError.EndOfStream) &#123; #write-verbose &#x27;read remaining error&#x27; [void]$Error.AppendLine($process.StandardError.ReadLine()) &#125; return @&#123;ExitCode = $process.ExitCode; Output = $Output.ToString(); Error = $Error.ToString(); ExitTime=$process.ExitTime&#125;&#125;$p = Start-ProcessWithOutput cmd.exe -argumentlist &#x27;/c &quot;dir&quot;&#x27;$p.ExitCode$p.Output$p.Error Run Python as Admin Running the whole python script in Admin, meaning that the subsequent processes will have admin access, if this is the behaviour you prefer. References Stack Exchange - Run .exe file via Python as Administrator Stack Overflow - How do I capture the output into a variable from an external process in PowerShell? Stack Overflow - Redirection of standard and error output appending to the same log file Stack Overflow - Powershell: Capturing standard out and error with Process object Windows Commandline - Windows runas command syntax and examples","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"windows","slug":"windows","permalink":"https://www.xingyulei.com/tags/windows/"},{"name":"batch","slug":"batch","permalink":"https://www.xingyulei.com/tags/batch/"}]},{"title":"Automate IK FK Matching in Maya with 2 Simple Steps","slug":"maya-ik-fk-match","date":"2022-02-27T08:00:00.000Z","updated":"2023-09-02T17:53:17.547Z","comments":true,"path":"post/maya-ik-fk-match/","link":"","permalink":"https://www.xingyulei.com/post/maya-ik-fk-match/","excerpt":"","text":"Introduction IK/FK matching refers to the ability to match any IK pose to FK pose and vice versa. But how does it work? I’m going to summarize the basic approaches I learned along the way. One of them is math-based, and the other being Maya operational-based, which utilizes Maya’s built-in constraint nodes, this is more straight-forward and easy as it does the calculation for us. Since we use controllers to drive joint movement in rigs, the general idea of a IK/FK matching is to reverse this process, and find the transformation of a controller based off the joint’s transformation. Note: There’s no one easy way to deal with all custom rig setups, this is due to operations like parenting, orienting joint and freezing transformation. Transformation offsets occurs between joint and controller, even in world space. I’ll cover these more complex scenarios as references here. FK Matching FK is all about matching rotation, given that FK controller constraints the corresponding joint’s orientation. Thus, in reverse, given the result joint’s transform, we should be able to find the FK controller’s rotation. And knowing how one of them works can translate to all the other joints and FKs (respectively, shoulder, elbow and wrist in arm and clavicle, knee and ankle in leg). Script obtain the world space rotation of the joint while it is still in IK mode 12# in IK moderotation = cmds.xform(jnt, ro=1, ws=1, q=1) switch to FK mode and apply the world space rotation onto the FK controller 123# in FK modedef snap_fk_to_jnt(ctrl, target_rotation): cmds.xform(ctrl, ro=target_rotation, ws=1) Maya Operation We can utilize Maya’s constraint to match rotation. Such as, in a three-chain setup, we could let IK joints to rotation constraint the FK controllers without maintaining offset. But for a single-chain setup with both FK and IK controllers sharing the joint, doing so will cause cycle evaluation. To get around this, we use a temporary empty transform node that is relatively parented under the joint. This temporary node (the match node) will be used to constraint the FK controller, and once the matching completes, we can safely delete the constraint and the match node itself. IK Matching IK Matching matches IK controller to the joint’s transform in FK mode. For IK handle, we need to match both the top joint’s (wrist or ankle) translation and rotation value; For IK pole vector, we only need to match the mid-joint’s (elbow or knee) translation. We already figured out how to acquire and match rotation in FK matching, which can be directly used in matching IK handle, so we’ll focus on how to match translation below. Script obtain the world space translation of the joint while it is still in FK mode 12# in FK modetranslation = cmds.xform(jnt, t=1, ws=1, q=1) switch to IK mode and apply the world space translation onto the IK Handle 123# in IK modedef snap_ik_to_jnt(ik, target_pos): cmds.xform(ik, t=target_pos, ws=1) Maya Operation Similar to FK matching, we create a match node that inherits the target joint’s transformation in FK mode; Then we use it to parent constraint the IK handles (position constraint the IK pole) without maintain offset. Once the IKs snaps to the target position, we then safely delete the constraint and the match node. Pole Vector: One Step Further In the example above, IK pole vector will directly snap on top of the elbow or knee joint. Doing so will achieve the IK matching effect, but we often want the pole vector to extend a little further outwards, this gives more room for animators and avoids joint flipping. To extend the pole vector outwards, we need to acquire the directional vector from mid-point of the root and top joint of the rig chain to the mid-joint. It is easier to achieve this through script: convert positional value to vector as Maya doesn’t support operation on position (represented as list[3]) 1234567root_vec = Vector3(root_pos)mid_vec = Vector3(mid_pos)top_vec = Vector3(top_pos)# alternatively, use maya&#x27;s built-in MVectorfrom maya.api import OpenMaya as omvec = om.MVector(pos[0], pos[1], pos[2]) find the mid-point between the root joint and the top joint 1mid_point = (root_vec + top_vec) * 0.5 find the directional vector from mid-point to the mid-joint 1pole_dir = mid_pos - mid_point the pole vector’s target position can be found by extending this directional vector beyond the mid-joint position with an arbitrary multiplier 1pole_pos = mid_pos + (pole_dir * multiplier) Further Reading The above matching logics aren’t bulletproof. What???!! Yeah, because not long after releasing my Snap tool, Squirrel Daph found the tool not behaving correctly and kindly sent me the rig for further testing. After some troubleshooting, I found that because I built the tool around my auto-generated rig, so there are many things I didn’t account for. The following sections aim to overcome some of my Snap tool’s previous limitations. Transformation Matrix Transformation matrix are commonly used in Computer Graphics, it can be used to represent an object’s transformation in 3D world; It is an extremely useful knowledge to have in terms of rigging. Maya has many built-in ways get the matrix representation of a node’s transformation. 1234def get_matrix(node, is_world=1): return om.MMatrix( cmds.xform(node, q=1, matrix=1, ws=is_world, os=not is_world) ) Converting the Maya matrix representation MMatrix to MTransformationMatrix, gives access to more built-in functions including decomposition. 1mxform_matrix = om.MTransformationMatrix(mmatrix) Or construct by using function set MFnTransform: 123456789def get_transform_matrix(dag_node): &quot;&quot;&quot; Get the local transformation matrix of a given dag node :param dag_node: om.MObject. input maya dag node :return: om.MTransformationMatrix. local transformation matrix &quot;&quot;&quot; fn_transform = om.MFnTransform(dag_node) return fn_transform.transformation() The differences between om.MMatrix and om.MTransformationMatrix: om.MMatrix constructed by cmds.xform has access to both local and world transformation matrix, but unable to track rotation greater than 360 degrees. om.MTransformationMatrix using MFnTransform only gets local transformation matrix, but it stores rotation information greater than 360 degrees. Translation Offset When there’s world space offset between IK controller and joint, we would want to account for the offset when calculating the IK result position. 12345jnt_pos = Vector(cmds.xform(jnt, ws=1, q=1, t=1))ik_pos = Vector(cmds.xform(ik, ws=1, q=1, t=1))offset = jnt_pos - ik_posik_target_pos = jnt_target_pos - offset Rotation Offset Rotational offset can be caused by axis in-alignment during constraints, we’ll need to use matrix multiplication to find it instead of simple vector math. Example of rotation offset between joint and controller Pre-multiplying Matrix Important: the order of matrix multiplication matters to get a unit matrix, instead of dividing matrix, we multiply its inverse matrix Joint transformation is the result of controller constraints, in which the constraint matrix serves as a pre-multiplication matrix. Mjoint=Mconst∗MctrlM_{joint} = M_{const} * M_{ctrl} Mjoint​=Mconst​∗Mctrl​ We are then able to get the constraint matrix by post-multiplying the inverse of controller matrix. Mjoint∗Mctrl−1=Mconst∗Mctrl∗Mctrl−1{M_{joint}} * M_{ctrl}^{-1} = M_{const} * M_{ctrl} * M_{ctrl}^{-1} Mjoint​∗Mctrl−1​=Mconst​∗Mctrl​∗Mctrl−1​ Mconst=Mjoint∗Mctrl−1M_{const} = {M_{joint}} * M_{ctrl}^{-1} Mconst​=Mjoint​∗Mctrl−1​ In the function below, the result matrix argument would be the joint matrix, and source matrix argument would be the controller matrix. 123456789def get_pre_mult_matrix(result_mat, source_mat): &quot;&quot;&quot; Get pre-multiplying matrix :param result_mat: om.MMatrix. the result matrix after multiplication :param source_mat: om.MMatrix. the source matrix used in pre multiplying :return: om.MMatrix. matrix used in pre multiplication &quot;&quot;&quot; return result_mat * source_mat.inverse() Similar process, we are able to find the target controller’s transform based off the rotational offset and the target joint transform. Mctrl=Mconst−1∗MjointM_{ctrl} = M_{const}^{-1} * {M_{joint}} Mctrl​=Mconst−1​∗Mjoint​ Implementation Bringing this back to the context of our IK matching process: We know the current controller rotation and current joint rotation, this will give us the constraint matrix (rotational offset), We also know the target joint rotation in world space, Therefore, we can convert this target joint rotation to target controller rotation in world space. Now through script: 123456789# step 1: obtain the constraint matrixcurrent_jnt_rot = matrix.get_matrix(jnt)current_fk_rot = matrix.get_matrix(fk)cons_mat = matrix.get_pre_mult_matrix(current_jnt_rot, current_fk_rot)# step 2: get controller&#x27;s target matrix target_ctrl_mat = om.MTransformationMatrix( cons_mat.inverse() * target_jnt_mat) We can later extract the rotation data from the transformation matrix. Model Matrix Model matrix converts transformation matrix from world space to object space, this has no direct usage in the IK/FK matching, as cmds.xform() already does the work for us. But it’s good to cover as it is very relevant. Post-multiplying Matrix Model matrix is a post-multiplying matrix: Mworld=Mlocal∗MmodelM_{world} = M_{local} * M_{model} Mworld​=Mlocal​∗Mmodel​ We now pre-multiply the inverse of the local transform matrix: Mlocal−1∗Mworld=Mlocal−1∗Mlocal∗MmodelM_{local}^{-1} * M_{world} = M_{local}^{-1} * M_{local} * M_{model} Mlocal−1​∗Mworld​=Mlocal−1​∗Mlocal​∗Mmodel​ Mmodel=Mlocal−1∗MworldM_{model} = M_{local}^{-1} *{M_{world}} Mmodel​=Mlocal−1​∗Mworld​ So similarly we can create the following function, with the result matrix argument being the world transform matrix, and source matrix argument being the local transform matrix. 123456789def get_post_mult_matrix(result_mat, source_mat): &quot;&quot;&quot; Get post multiplying matrix :param result_mat: om.MMatrix. the result matrix after multiplication :param source_mat: om.MMatrix. the source matrix used in post multiplying :return: om.MMatrix. matrix used in post multiplication &quot;&quot;&quot; return source_mat.inverse() * result_mat Decomposing Matrix Decomposing a transformation matrix (om.MTransformationMatrix) refers to acquiring translation, rotation and scale values as individual list[3] type. These values can now be applied using cmds.xform() either in local space or in world space depending on the input transformation matrix. Translation 1translation = matrix.translation(om.MSpace.kWorld) Scale 1scale = matrix.scale(om.MSpace.kWorld) Rotation Extract rotation in axis angles in default xyz rotation order. 1234import mathrot_vec = matrix.rotation().asVector()rotation = [math.degrees(angle) for angle in (rot_vec.x, rot_vec.y, rot_vec.z)] References Tech Artists Org - Convert world space coordinates to object space coordinates in Maya? Stack Exchange - Given this transformation matrix, how do I decompose it into translation, rotation and scale matrices? AK Eric - Find Euler rotation values of Maya matrix Maya Help - MFnTransform Class Reference Maya Help - MMatrix Class Reference Maya Help - MTransformationMatrix Class Reference","categories":[{"name":"3d math","slug":"3d-math","permalink":"https://www.xingyulei.com/categories/3d-math/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Step-by-Step Guide to Using namedtuple in Python for Beginners","slug":"py-named-tuple","date":"2022-01-23T08:00:00.000Z","updated":"2023-09-02T17:56:55.768Z","comments":true,"path":"post/py-named-tuple/","link":"","permalink":"https://www.xingyulei.com/post/py-named-tuple/","excerpt":"","text":"I recently got side-tracked into exploring the basics of namedtuple() as I got a glimpse of its usage in our engineering codebase. Here’s my summary: Mutable and Hashable To understand the behavior of namedtuple(), it is best to also visit the concept of Python object’s mutability and hashability. These two concepts are closely linked. Hashability: an object’s is hashable when its hash value never changed during its lifetime Most of Python’s immutable built-in objects are hashable; mutable containers (such as lists or dictionaries) are not; immutable containers (such as tuples and frozensets) are only hashable if their elements are hashable. Objects which are instances of user-defined classes are hashable by default Mutability: an object with a fixed value and cannot be altered is immutable (For example: int, float, string, tuple). in contrast, an object can keep its value while keeping its id() is mutable. (For example: list, dict) hash() and id() identity: id(), the identity of the two same value variables are the same If two objects (that exist at the same time) have the same identity, they’re actually two references to the same object. The is operator compares items by identity, a is b is equivalent to id(a) == id(b). hash value: hash(), hash value is based off an object’s value, and hash value must remain the same for the lifetime of the object. If an object is mutable, then it doesn’t make sense for it to have hash. The hash value is an integer which is used to quickly compare dictionary keys or sets. Why Hash? Hash values are very useful, as they enable quick look-up of values in a large collection of values, it’s commonly used in set and dict. with if x in elements:: In a list, Python needs to go through the whole list and compare x's value with each value in the list elements. In a set, Python keeps track of each element’s hash, Python will get the hash-value for x, look that up in an internal structure and find elements that have the same hash as x. It also means we can have non-hashable objects in a list, but not in a set or as keys in a dict. Example: There is no way to change an int object’s value without re-assigning (copy) it to a different object. 1234x = 5# id(x) is equal to 3054677212104x = 6# id(x) is equal to 3054677212080 But for list, we can edit its value after assignment while keeping its id() the same. (note: use list built-in function rather than re-assignment, this is the same for x.sort vs. x=sorted(x)) 123456x = [5]# ORIGINAL: id(x) is equal to 3054706521672x.append(6)# CORRECT: id(x) is equal to 3054706521672x = [5, 6]# WRONG: id(x) is equal to 3054713375816 NamedTuple A data class are just regular classes that are geared towards storing state, rather than containing a lot of logic, namedtuple() is one kind of data classes. Every time we create a class that mostly consists of attributes, we make a data class. With namedtuple(), we can create immutable sequence types that allow us to access their values using descriptive field names and the dot notation instead of unclear integer indices. Initialization typename: str, class name of the namedtuple field names: names that are used to access values in the namedtuple, it can be declared using any of the following: iterable of strings: [“a”, “b”, “c”] a string with name seperated by white spaces: “a b c” a string with name separated by commas: “a, b, c” Example: 12345678from collections import namedtuplePoint = namedtuple(&quot;Point&quot;, [&quot;x&quot;, &quot;y&quot;])&gt;&gt; Point# &lt;class &#x27;__main__.Point&#x27;&gt;&gt;&gt; Point(2, 4)# Point(x=2, y=4) Access and Edit Value It is very straight-forward to access a tuple’s attribute value using dot notation this gives namedtuple a great edge against dict or tuple. 12345Person = namedtuple(&#x27;Person&#x27;, &#x27;name children&#x27;)jj = Person(&#x27;Johnny J&#x27;, [&#x27;Tobby&#x27;])&gt;&gt; jj.children# [&#x27;Tobby&#x27;] Since namedtuple is immutable, we can’t assign value to its attribute; what we can do is to use ._replace(); and also, its value can be mutable, like a list. 12345678&gt;&gt; jj.children = [&#x27;Tobby&#x27;, &#x27;Wang&#x27;]# AttributeError: can&#x27;t set attribute&gt;&gt; jj.children.append(&#x27;Wang&#x27;)# Correct&gt;&gt; jj = jj._replace(name=&#x27;John J&#x27;)# Correct Using ._asdict() The built-in function ._asdict() converts namedtuple into a dictionary. 12345Person = namedtuple(&quot;Person&quot;, &quot;name age height&quot;)jane = Person(&quot;Jane&quot;, 25, 1.75)&gt;&gt; jane._asdict()# &#123;&#x27;name&#x27;: &#x27;Jane&#x27;, &#x27;age&#x27;: 25, &#x27;height&#x27;: 1.75&#125; and to generate a namedtuple object from dictionary 1234567d = &#123; &#x27;name&#x27;: &#x27;Jane&#x27;, &#x27;age&#x27;: 25, &#x27;height&#x27;: 1.75&#125;jane = Person(**d) @dataclass @dataclass came out after Python 3.7, which is similar to namedtuple, but they are mutable. thus, we can set value to a @dataclass attribute. 12345678910111213from dataclasses import dataclass@dataclassclass Person: name: str age: int country: str = &quot;Canada&quot;jane = Person(&quot;Jane&quot;, 25)&gt;&gt; jane.name = &quot;Jane Doe&quot;&gt;&gt; jane.name&#x27;Jane Doe&#x27; frozen attribute if we want @dataclass to behave like namedtuple with an un-editable “protected” attribute, just use @dataclass(frozen=True). override __iter__() @dataclass are also not iterable by default, unlike namedtuple. We can achieve that by implementing the special method .__iter__(): 1234567from dataclasses import astuple, dataclass@dataclassclass Person: ... def __iter__(self): return iter(astuple(self)) Subclassing namedtuple Subclassing namedtuple gives us additional functionality. 123456789101112BasePerson = namedtuple(&quot;BasePerson&quot;, &quot;name birthdate country&quot;)class Person(BasePerson): &quot;&quot;&quot;A namedtuple subclass to hold a person&#x27;s data.&quot;&quot;&quot; __slots__ = () def __repr__(self): return &quot;Name: &#123;&#125;, age: &#123;&#125; years old&quot;.format(self.name, self.age) @property def age(self): return (date.today() - self.birthdate).days // 365 In the above example, subclassing from namedtuple provides us better documentation (i.e. Person.__doc__), better string representation (i.e. print jane) and an extra property to access based off a Person’s instance attribute value. __new__() constructor Zechong Hu’s Blog - Inheritance for Python Namedtuples To override the constructor for namedtuple class with default value: 123456BasePerson = namedtuple(&quot;BasePerson&quot;, [&quot;name&quot;, &quot;birthdate&quot; ,&quot;country&quot;])class Person(BasePerson): __slots__ = () def __new__(cls, name, birthdate=&quot;2000.01.01&quot;, country=None): return super(Person, cls).__new__(cls, name, birthdate, country) __slots__ The special attribute __slots__ explicitly state what attribute we want our class instances to have. By default, when an instance (object) is created, __dict__ is used to store an object’s (writable) attributes. A dynamic dictionary: requires more memory takes longer time to create. Because namedtuple makes immutable instances that are lightweight, we need to prevent the creation of __dict__ to get the benefit while subclassing by setting __slots__ as empty tuple. In a more general note, please consider using __slots__ when creating tons of objects, this saves memory and time when instancing. Comparison __dict__ vs. __slots__ 123456789class Person(object): def __init__(self, name, age): self.name = name self.age = agejohn = Person(&#x27;john&#x27;, 15)&gt;&gt; john.__dict__# &#123;&#x27;age&#x27;: 15, &#x27;name&#x27;: &#x27;john&#x27;&#125; 123456789101112class Person(object): __slots__ = [&#x27;name&#x27;, &#x27;age&#x27;] def __init__(self, name, age): self.name = name self.age = agejohn = Person(&#x27;john&#x27;, 15)&gt;&gt; john.__slots__# [&#x27;name&#x27;, &#x27;age&#x27;]&gt;&gt; john.__dict__# AttributeError: &#x27;Person&#x27; object has no attribute &#x27;__dict__&#x27; Reference Python Docs - Glossary Medium megha mohan - Mutable vs Immutable Objects in Python Real Python - namedtuple Stack Overflow - What are data classes and how are they different from common classes? Geeks for Geesk - Use of __slots__ Stack Overflow - Usage of __slots__? Stack Overflow - Difference between hash() and id() Stack Overflow - Two variables in Python have same id, but not lists or tuples Stack Overflow - What does hash do in python?","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"style","slug":"style","permalink":"https://www.xingyulei.com/tags/style/"}]},{"title":"Streamline Your Maya Communication (2. Streaming Output)","slug":"maya-streaming","date":"2022-01-09T08:00:00.000Z","updated":"2023-03-29T21:15:00.000Z","comments":true,"path":"post/maya-streaming/","link":"","permalink":"https://www.xingyulei.com/post/maya-streaming/","excerpt":"","text":"Maya Connector I’ve combined the two parts together and created the end result: Maya Connector tool. The tool will utilize command port to send open streaming command, which establishes the connection and enables the callback. The output is being sent back to the tool and the output is updated in the GUI. Introduction Make sure to see Part 1 for more context in socket programming and maya command port Like mentioned in the previous blog, this chapter is independent for enabling output streaming, but would work even better with command port to send command and get active response from Maya. This kind of log streaming feature can be helpful not only for monitoring but for catching errors like when Maya crashes, or to connect with an IDE similar to PyCharm’s plugin MayaCharm and Sublime’s plugin MayaSublime Listening Server Separation I’ve been looking at Maya’s command port to see if the return message would be sufficient for debugging log, as command port already is a server. But it turns out that this approach is not recommended by many, as there’s little control on the return message as the TCP communication returns one message per command, more explained in the previous blog. The correct way suggested, and widely used is to stream Maya script output back to the external application. As shown in the graph, two separate communications are established instead of utilizing just the command port. external application (client) send command to Maya’s command port (server) where Maya would process normally. This is achieved through TCP to ensure no loss in sending command. Maya’s MCommandMessage callback triggers (client) send the latest output result to external application’s listening port (server). This is achieved through UDP to keep the connection fast and easy, but may result in lost in feedbacks (which isn’t that important) Procedures to establish listening server, need to use a different port number than the command port number if we are also connecting to it. 12345678910111213141516import socketSERVER = &#x27;127.0.0.1&#x27;PORT = 5051ADDR = (SERVER, PORT)server = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)server.bind(ADDR)while True: data = server.recvfrom(1024) message = data[0] address = data[1] print(message) On the maya client side, there are two parts: setup MCommendMessage callback stream the data to the listening server 123456789101112131415161718192021222324252627import socketimport maya.OpenMaya as omSERVER = &#x27;127.0.0.1&#x27;PORT = 5051if &#x27;STREAM_CALLBACK&#x27; in globals(): try: om.MMessage.removeCallback(STREAM_CALLBACK) except RuntimeError: passSTREAM_CALLBACK = Nonedef openStream(addr=(SERVER, PORT)): global STREAM_CALLBACK print(&quot;Enable Streaming ScriptEditor at (&#123;&#125;:&#123;&#125;)\\n&quot;.format(addr[0], addr[1])) STREAM_CALLBACK = om.MCommandMessage.addCommandOutputCallback(streamToConsole, addr)def closeStream(): global STREAM_CALLBACK print(&quot;Disable Streaming ScriptEditor\\n&quot;) om.MMessage.removeCallback(STREAM_CALLBACK) STREAM_CALLBACK = None borrowed some code from MayaSublime for stringIO 1234567891011121314151617181920212223242526272829303132def streamToConsole(msg, mtype, addr): buf = StringIO() buf.seek(0) buf.truncate() buf.write(msg) buf.seek(0) # start with trying to send 8kb packets bufsize = 8*1024 # loop until the buffer is empty while True: while bufsize &gt; 0: # save our position in case we error and need to roll back pos = buf.tell() part = buf.read(bufsize) if not part: # buffer is empty. Nothing else to send return try: client.sendto(part, addr) except Exception as e: if e.errno == errno.EMSGSIZE: # we have hit a message size limit. # scale down and try the packet again bufsize /= 2 buf.seek(pos) continue # some other error raise # message sent without error break Message Type Command message type support: 1234567891011121314if mtype == om.MCommandMessage.kWarning: buf.write(&#x27;# Warning: &#x27;) buf.write(msg) buf.write(&#x27; #\\n&#x27;)elif mtype == om.MCommandMessage.kError: buf.write(&#x27;// Error: &#x27;) buf.write(msg) buf.write(&#x27; //\\n&#x27;)elif mtype == om.MCommandMessage.kResult: buf.write(&#x27;# Result: &#x27;) buf.write(msg) buf.write(&#x27; #\\n&#x27;)else: buf.write(msg) Logging GUI Like a logger, instead of sending output string to standard output, I created a QPlainTextEdit and use insertPlainText(string) to display it. We opened a thread to receive data, so that we still have control over the main tool, and can send command to maya if wanted. Note: we shouldn’t update the GUI in the listening thread, instead we emit a custom signal and pass the return message as argument, we then create a custom slot to handle GUI update. so instead of doing: 1234while True: data = server.recvfrom(1024) message = data[0] self.ui_text_edit.insertPlainText(message) we should be doing: 1234while True: data = server.recvfrom(1024) message = data[0] self.message_received.emit(message) Clean up During application close, we need to do the following clean up: send command to Maya to remove the callback close the tool’s UDP listening server end the thread to the listening server References Maya Help - OpenMaya.MCommandMessage Class Reference Google Groups - Extracting data from Output Window Github - MayaCharm Github - MayaSublime","categories":[{"name":"maya communication","slug":"maya-communication","permalink":"https://www.xingyulei.com/categories/maya-communication/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"socket","slug":"socket","permalink":"https://www.xingyulei.com/tags/socket/"},{"name":"threading","slug":"threading","permalink":"https://www.xingyulei.com/tags/threading/"}]},{"title":"Streamline Your Maya Communication Workflow (1. Command Port)","slug":"maya-commandport","date":"2021-12-17T08:00:00.000Z","updated":"2023-03-29T21:12:00.000Z","comments":true,"path":"post/maya-commandport/","link":"","permalink":"https://www.xingyulei.com/post/maya-commandport/","excerpt":"","text":"Maya Connector The end result of this two-part blog is the Maya Connector tool. This external standalone tool is able to send command to maya and receive real-time feedback from maya’s script editor output. Introduction If you are already familiar with maya command port and socket programming, skip to Part 2 for Maya output streaming. Although there are a lot of tools that can run internally in Maya which facilitate the pipeline. The capability of communicating (monitor and control) with Maya externally is very handy. Why? we sometime don’t need to interact with Maya GUI directly or have way too many maya instances to manage. examples are: sending cross-application remote command to active maya sessions or syncing between different maya sessions batch processing on either maya standalone sessions or active maya sessions This requires two components which I will be covering: command port: sending commands to maya to execute output streaming: actively listening/receiving maya outputs (next blog) These two parts can work independently, but are powerful as a whole. Also, references in creating maya standalone sessions Using cmds.commandPort() cmds.commandPort(): The command port comprises a socket to which a client program may connect Traditional socket connection provides the basic communication between client and server. But Maya’s built-in command port provides us a very convenient way of sending command for maya to execute. Procedures Open command port The port needs to be opened on Maya’s (server) end first in order for client to send command; ideally this would be achieved by adding a cmds.commandPort() open during Maya startup. 1234import maya.cmds as cmdsport = 5050if not cmds.commandPort(&quot;:&#123;&#125;&quot;.format(port), query=True): cmds.commandPort(name=&quot;:&#123;&#125;&quot;.format(port)) Send command through an external application the command sent can be either MEL or Python command which must be specified during the opening the port determined by sourceType flag 123456789101112131415import socket# the local hostHOST = &#x27;127.0.0.1&#x27; PORT = 5050ADDR = (HOST, PORT)def sendCommand(): client = socket.socket(socket.AF_INET, socket.SOCK_STREAM) client.connect(ADDR) command = &#x27;polyCube()&#x27; client.send(command) client.close() TCP Return Message We are using TCP for our communication protocol to guarantee command being sent when the connection is established successfully. Important: At this point, we are not attempting to use client.recv(xxx) for data returning from Maya, unless it’s a super simple single statement. Trying to use client.recv(xxx) will result in either None data returned or single return as it is the behaviour of TCP. See here Also sending command line by line is not reliable as there are no context between lines for Maya server to understand. Unless it’s super simple series of commands In order to receive output, we need a custom listening server to do that which is explained in Part 2. SourceType We are opening a default command port which takes MEL input, we don’t need to specify Python as source type, as we can just use python(&quot;[insert command here]&quot;) to wrap it into MEL, this can be blocks of independent codes or importing and executing python files. Mixed Quotation symbol Note that when doing a source type conversion with a string type command , quotation symbol may cause conflicts. the solution is to replace it with backslash before quotation symbol. 1command = &#x27;python(&quot;&#x27; + command.replace(r&#x27;&quot;&#x27;, r&#x27;\\&quot;&#x27;) + &#x27;&quot;)&#x27; Socket Programming Introduction It is also very helpful to know the basics of socket programming in Python to better understand how server and client communicates, and the difference between TCP and UDP, which will be used in the next part. This tutorial is very handy, and the following are a basic template for setting up client and server using socket and thread Reference Google Group - Receiving data from commandPort Stack Overflow - c socket programming, only receiving one line at a time CG Talk - Telnet or Socket: no result back from Maya Youtube - Python Socket Programming Tutorial","categories":[{"name":"maya communication","slug":"maya-communication","permalink":"https://www.xingyulei.com/categories/maya-communication/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"socket","slug":"socket","permalink":"https://www.xingyulei.com/tags/socket/"},{"name":"command port","slug":"command-port","permalink":"https://www.xingyulei.com/tags/command-port/"}]},{"title":"A Complete Comparison: Understanding QEnum and QFlags in Qt","slug":"qt-enum-flag","date":"2021-12-06T08:00:00.000Z","updated":"2023-09-02T17:59:04.281Z","comments":true,"path":"post/qt-enum-flag/","link":"","permalink":"https://www.xingyulei.com/post/qt-enum-flag/","excerpt":"","text":"Introduction I often take Qt namespace for granted, it became a natural habit of setting a Qt parameter using Qt namespace, for instance: setting alignment for a QStandardItem 123item = QtGui.QStandardItem(&#x27;test&#x27;)item.setTextAlignment(QtCore.Qt.AlignRight)type(QtCore.Qt.AlignRight) Here, the Qt.AlignRight is an AlignmentFlag Enum type object which has a value of 0x0002 or 2, which creates the behavior of aligning with the right edge. Now, let’s try parsing the alignment of the QStandardItem again, using: 12align = item.textAlignment()type(align) this returns a PyQt5.QtCore.Alignment object, which we don’t really know the value of. And also note that it is not a AlignmentFlag object like previously. So, What’s the difference between these two, and how should I retrieve the namespace value? QEnum and QFlags QFlags is used to store combinations of Enum, which provides type checking safety. thus, Alignment QFlags type is simply a typedef for AlignmentFlag QEnum. Qt.AlignmentFlag is QEnum type; AlignmentFlag being the enum name Qt.Alignment is QFlags type; Alignment being the type name there’s also non-flag enums, which have the same type and enum name Example Declaration of both object types 12345678# &lt;class &#x27;PyQt5.QtCore.AlignmentFlag&#x27;&gt;align_flag = QtCore.Qt.AlignRightalign_flag_value = 2# &lt;class &#x27;PyQt5.QtCore.Alignment&#x27;&gt;align = QtCore.Qt.Alignment(align_flag)# or &lt;class &#x27;int&#x27;&gt;align = QtCore.Qt.Alignment(align_flag_value) As we can see, setAlignment() takes a Qt.Alignment parameter, which means that any combination of Qt.AlignmentFlag values, or int, is legal. 123456789item = QtGui.QStandardItem(&#x27;test&#x27;)# Alignment type is compatible with either int or AlignmentFlag(Enum)# &lt;class &#x27;PyQt5.QtCore.AlignmentFlag&#x27;&gt;item.setTextAlignment(QtCore.Qt.AlignRight)# or &lt;class &#x27;PyQt5.QtCore.Alignment&#x27;&gt;item.setTextAlignment(align)# or &lt;class &#x27;int&#x27;&gt;item.setTextAlignment(2) The return value is QFlags type, but it can be cast to an integer type to reveal its Enum value 12345# &lt;class &#x27;PyQt5.QtCore.Alignment&#x27;&gt;align = pathItem.textAlignment()# to get the Alignment value, convert the QFlags to intint(align) Parse Namespace and Value Mapping Still not sure what the Enum value means? We can either check the docs, or use this to print out a mapping of the namespace and its corresponding value 12345678910111213def enum_mapping(cls, enum): mapping = dict() for key in dir(cls): value = getattr(cls, key) if isinstance(value, enum): mapping[key] = value return mappingenum = enum_mapping(QtCore.Qt, QtCore.Qt.AlignmentFlag)# enum = enum_mapping(QtWidgets, QtWidgets.QStyle)for item in sorted(enum.items(), key=str): print(&#x27;%s: %s&#x27; % item) Reference GitHub - qutebrowser Qt Doc - QFlags Class Reference Qt Doc - QEnum/QFlag","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"}]},{"title":"Simplify Windows Process Management with Python: Find PIDs and End Processes","slug":"py-end-process","date":"2021-10-25T07:00:00.000Z","updated":"2023-09-02T17:40:02.207Z","comments":true,"path":"post/py-end-process/","link":"","permalink":"https://www.xingyulei.com/post/py-end-process/","excerpt":"","text":"Introduction Interacting with Windows shell to end process is very common, there are many ways to do so, like through the traditional batch script but to gain more flexibility, using python is probably a better idea. os.system is not the most elegant way to use, and it is meant to be replaced by subprocess subprocess comes with Python standard library and allows us to spawn new processes, connect to their input/output/error pipes, and obtain their return codes psutil (python system and process utilities) is a cross-platform library for retrieving information on running processes and system utilization. However, it is a third-party library Bare Minimum the bare minimum command to kill process utilizes window’s taskkill; which doesn’t matter if we use os.system or subprocess 1234567import osPROCESS = &#x27;notepad.exe&#x27;STATUS = &#x27;running&#x27; # running or not respondingCMD = r&#x27;taskkill /fi &quot;IMAGENAME eq &#123;&#125;&quot; /fi &quot;STATUS eq &#123;&#125;&quot; &#x27;.format(PROCESS, STATUS)os.system(CMD) Using os.system Now consider a more flexible case where we want to gather information about the processes like its PID, and then proceed on ending the process. One of the downside of window shell command is that the output can’t be passed on to other command, the output is just text. Therefore, we output the text to a csv file which we will later process. 12345678910111213141516171819202122232425import csvimport osimport signalimport subprocessPROCESS = &#x27;notepad.exe&#x27;STATUS = &#x27;running&#x27; # running or not respondingTMP = r&#x27;&#123;&#125;/Desktop/tmp.txt&#x27;.format(os.environ[&#x27;userprofile&#x27;])CMD = r&#x27;tasklist /fi &quot;IMAGENAME eq &#123;&#125;&quot; /fi &quot;STATUS eq &#123;&#125;&quot; /fo &quot;csv&quot; &gt; &quot;&#123;&#125;&quot;&#x27;.format(PROCESS, STATUS, TMP)# output as csv formatos.system(CMD)with open(TMP, &#x27;r&#x27;) as temp: reader = csv.reader(temp) header = next(reader) pids = [int(row[1]) for row in reader]# kill processfor pid in pids: os.kill(pid, signal.SIGTERM) # or signal.SIGKILL print(&#x27;killed process with pid: &#123;&#125;&#x27;.format(pid))if os.path.exists(TMP): os.remove(TMP) Using subprocess With subprocess, we no longer need to create a temp file to store the output. Using psutil 1234567891011121314151617import psutilPROGRAM = r&#x27;maya.exe&#x27;def findProcess(name): procs = list() #Iterate over the all the running process for proc in psutil.process_iter(): try: if proc.name() == name and proc.status() == psutil.STATUS_RUNNING: pid = proc.pid procs.append(pid) except: pass return procsprocesses = findProcess(PROGRAM) we can find process start time by using 12import timestartTime = time.strftime(&#x27;%Y-%m-%d %H:%M:%S&#x27;, time.localtime(proc.create_time())) to kill process, either kill() or terminate() will work respectfully, SIGKILL or SIGTERM 1234p = psutil.Process(PID)p.terminate()p.kill()p.wait Bonus: Find Open Port (for socket connection) 123456process = psutil.Process(pid=PID)connections = process.connections(kind=&#x27;tcp4&#x27;)for c in [x for x in connections if x.status == psutil.CONN_LISTEN]: # gets the port number print(&#x27;port opened: &#123;&#125;&#x27;.format(c.laddr[-1])) Bonus: Find Main Window Title ctypes is a foreign function library for python, resulting a not-pythonic function Reference Microsoft Doc - tasklist ThisPointer - Python : Check if a process is running by name and find it’s Process ID (PID) Johannes Sasongko - Win32 Python: Getting all window titles Stack Overflow - Obtain Active window using Python Microsoft Docs - winuser.h header","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"windows","slug":"windows","permalink":"https://www.xingyulei.com/tags/windows/"},{"name":"batch","slug":"batch","permalink":"https://www.xingyulei.com/tags/batch/"}]},{"title":"Create Dynamic Animation Behaviors with Unity's State Machine Scripting API","slug":"unity-api-statemachine","date":"2021-08-29T07:00:00.000Z","updated":"2023-09-02T18:08:53.907Z","comments":true,"path":"post/unity-api-statemachine/","link":"","permalink":"https://www.xingyulei.com/post/unity-api-statemachine/","excerpt":"","text":"Introduction This post is not about state machine basic, rather how we would setup/access state machine parameters. There is a higher level Animator class to access a part of the animator features, but we need to use Unity’s Animations package in order to dive deeper. 1using UnityEditor.Animations; There’s a lot of parts composing Unity’s Animator: Layer, Parameter, State machine (and everything inside it including states of different kind, transition between states), there are of course multiple parameters inside a single state. The examples in this post is only about accessing states and state machines, as the rest is translatable. We start from the root: Base layer, if we think about it, a layer is essentially a state machine. Inside this root state machine are sets of states (including blend tree/state/sub-state machine) 12// getting the base layer state machineAnimatorStateMachine rootStateMachine = controller.layers[0].stateMachine; (Base Layer) Next up, a very confusing part of the scripting process are the definition of AnimatorStateMachine vs. ChildAnimatorStateMachine and AnimatorState vs. ChildAnimatorState. I really wish Unity provides internal ways to cast these to each other. To summarize: ChildAnimatorStateMachine[] and ChildAnimatorState[] is used in conjunction with Arrays as AnimatorStateMachine.states and AnimatorStateMachine.stateMachines will return the previous mentioned type. Instead of casting, they have an internal property ChildAnimatorStateMachine.stateMachine and ChildAnimatorState.state which respectively returns AnimatorStateMachine and AnimatorState type object States All states (state or. state with blendtree inside) 1234567891011121314151617181920212223ChildAnimatorState[] childStates = rootStateMachine.states;foreach(var childState in childStates)&#123; AnimatorState state = childState.state; print(state.name); // state with blendtree try &#123; var blendTree = (BlendTree)state.motion; foreach (var child in blendTree.children) &#123; print(&quot;\\t&quot; + child.motion.name); &#125; &#125; // simple state catch &#123; print(&quot;\\t&quot; + state.motion.name); &#125;&#125; (Simple state only contains a single clip) (BlendTree nested in a state) Sub-state Machine 12345678910111213141516ChildAnimatorStateMachine[] childSubStateMachines = rootStateMachine.stateMachines;foreach(var childSubStateMachine in childSubStateMachines)&#123; // Convert `ChildAnimatorStateMachine` to `AnimatorStateMachine` AnimatorStateMachine subStateMachine = childSubStateMachine.stateMachine; print(subStateMachine.name); // all states in idle sub state machine ChildAnimatorState[] states = subStateMachine.states; foreach (var childState in states) &#123; print(&quot;\\t&quot; + childState.state.name); &#125;&#125; (Essentially, another sub layer of state machine) Reference Unity Manual - State Machine Basics Unity Scripting API - AnimatorStateMachine Unity Scripting API - Animator.Play","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"unity","slug":"unity","permalink":"https://www.xingyulei.com/tags/unity/"},{"name":"c#","slug":"c","permalink":"https://www.xingyulei.com/tags/c/"}]},{"title":"A Simple Guide to Resizing Pixmap in PyQt","slug":"qt-pixmap-scale","date":"2021-08-22T07:00:00.000Z","updated":"2023-03-29T21:27:56.000Z","comments":true,"path":"post/qt-pixmap-scale/","link":"","permalink":"https://www.xingyulei.com/post/qt-pixmap-scale/","excerpt":"","text":"Introduction During my attempts to create custom alignment push buttons, I encountered an issue with icon having jagged looking (even if with low resolution). I use a custom paintEvent() drawing QPixmap, and this happens when I use scaled() to resize my pixmap. I noticed the icon does not have the jagged look with the built-in setIcon() and setIconSize in QPushButton. So I know there’s some wrong with my approach. Example To really show out the difference, I first reduce the resolution of my image. 12345low_rez = QtCore.QSize(40, 40)high_rez = QtCore.QSize(400, 400)pixmap = QtGui.QPixmap(path)pixmap = pixmap.scaled(low_rez) I then increase the resolution back to normal. The default scale uses FastTransformation 1pixmap = pixmap.scaled(high_rez) This is the result: The Solution I’ve searched many forums and people were all saying: enable the SmoothTransformation, I tried but didn’t work. Later on I found out that the Qt translation to Python has a mis-match keyword argument: so instead of transformMode=Qt.SmoothTransformation, it should actually be mode=Qt.SmoothTransformation So here’s the solution: 12345pixmap = pixmap.scaled( high_rez, aspectRatioMode=QtCore.Qt.KeepAspectRatio, mode=QtCore.Qt.SmoothTransformation) and result: Extra I also found post saying it might be some settings with the QPainter, but it is not the issue for me. 1234painter = QtGui.QPainter(self)painter.setRenderHint(QtGui.QPainter.Antialiasing, True)painter.setRenderHint(QtGui.QPainter.SmoothPixmapTransform, True)painter.drawPixmap(self.pixmap) Reference Qt Documentation - QPixmap Class","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"}]},{"title":"Create Beautiful Qt Button Interfaces: Left-align Icon and Center-align Text","slug":"qt-button-alignment","date":"2021-08-21T07:00:00.000Z","updated":"2023-03-29T21:24:30.000Z","comments":true,"path":"post/qt-button-alignment/","link":"","permalink":"https://www.xingyulei.com/post/qt-button-alignment/","excerpt":"","text":"Introduction I recently needed to display a series of buttons for my shelf tool, the problem I’m having with this is that although every button has an icon and text label, they are displayed as different width. Using center-align made it look not uniform. Should I go with left-align? Well, there are buttons with relatively longer label and some with shorter ones, so it doesn’t look nice either with empty spaces on the right side. So the solution is obvious, separate the alignment of the icon and the label: the icon stays left-align to give a clear sign of broader, and the label would be center-align to make the width look uniform. (Left: default center align, Center: left align, Right: custom align) In the following section, I will demonstrate three methods of achieving this custom alignment effect: Overriding QPushButton paintEvent() This method subclass from QPushButton and override the paintEvent() and sizeHint() to extend how a button is drawn; The alignment of content of the button is default to center-aligned, but we make the pixmap to be drawn on the left-side (5px margin against the left border) With this method, we no longer use QIcon, we use QPixmap instead; that is why we created a custom setPixmap() method to our MyButton to give user access to the pixmap being drawn. Custom layout inside pushbutton Here is another interesting approach: this method defaults its style to left-aligned, but it only contains the icon. What about the push button label(text)? It is actually a QLabel placed in the QPushButton layout, and being vertically center-aligned; To modify the push button text, use setText() to the label inside the button layout, instead of the button. Use QProxyStyle I haven’t personally test it because my Qt python binding doesn’t have QProxyStyle included but it’s worth putting it here in case someone is able to try it. 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566class ProxyStyle(QtWidgets.QProxyStyle): def drawControl(self, element, option, painter, widget=None): if element == QtWidgets.QStyle.CE_PushButtonLabel: icon = QtGui.QIcon(option.icon) option.icon = QtGui.QIcon() super(ProxyStyle, self).drawControl(element, option, painter, widget) if element == QtWidgets.QStyle.CE_PushButtonLabel: if not icon.isNull(): iconSpacing = 4 mode = ( QtGui.QIcon.Normal if option.state &amp; QtWidgets.QStyle.State_Enabled else QtGui.QIcon.Disabled ) if ( mode == QtGui.QIcon.Normal and option.state &amp; QtWidgets.QStyle.State_HasFocus ): mode = QtGui.QIcon.Active state = QtGui.QIcon.Off if option.state &amp; QtWidgets.QStyle.State_On: state = QtGui.QIcon.On window = widget.window().windowHandle() if widget is not None else None pixmap = icon.pixmap(window, option.iconSize, mode, state) pixmapWidth = pixmap.width() / pixmap.devicePixelRatio() pixmapHeight = pixmap.height() / pixmap.devicePixelRatio() iconRect = QtCore.QRect( QtCore.QPoint(), QtCore.QSize(pixmapWidth, pixmapHeight) ) iconRect.moveCenter(option.rect.center()) iconRect.moveLeft(option.rect.left() + iconSpacing) iconRect = self.visualRect(option.direction, option.rect, iconRect) iconRect.translate( self.proxy().pixelMetric( QtWidgets.QStyle.PM_ButtonShiftHorizontal, option, widget ), self.proxy().pixelMetric( QtWidgets.QStyle.PM_ButtonShiftVertical, option, widget ), ) painter.drawPixmap(iconRect, pixmap)if __name__ == &quot;__main__&quot;: app = QtWidgets.QApplication(sys.argv) app.setStyle(&#x27;fusion&#x27;) proxy_style = ProxyStyle(app.style()) app.setStyle(proxy_style) w = QtWidgets.QWidget() lay = QtWidgets.QVBoxLayout(w) icons = [ app.style().standardIcon(standardIcon) for standardIcon in ( QtWidgets.QStyle.SP_MediaPlay, QtWidgets.QStyle.SP_MediaPause, QtWidgets.QStyle.SP_MediaSeekBackward, QtWidgets.QStyle.SP_MediaSeekForward, ) ] for text, icon in zip(&quot;Play Pause Backward Forward&quot;.split(), (icons)): button = QtWidgets.QPushButton(text) button.setIcon(icon) lay.addWidget(button) w.show() sys.exit(app.exec_()) Reference Stack Overflow - QPushButton icon aligned left with text centered Stack Overflow - qpushbutton icon left alignment text center alignment","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"}]},{"title":"Make Your Qt Button More Dynamic with Double-Click and Hover Effects","slug":"qt-detect-click","date":"2021-08-08T07:00:00.000Z","updated":"2023-03-29T21:25:22.000Z","comments":true,"path":"post/qt-detect-click/","link":"","permalink":"https://www.xingyulei.com/post/qt-detect-click/","excerpt":"","text":"Introduction I want to showcase some examples that I used to create push button with custom behaviours. (Double click button) (Button hover effect) Double Click Problem with MouseButtonDblClick Hey, I thought this would be easy, since Qt offers a built-in event type: QEvent.MouseButtonDblClick. But the issue is it couldn’t distinguish a single click vs. a double click. Which means, the single click event will also be invoked when double-clicked. Solution using timeout Subclass QPushButton and override eventFilter() Using eventFilter() eventFilter() takes three argument, a QObject that the filter is installed on, a QObject that is being watched, and a reference to a QEvent type object to be filtered. Be sure to add self.installEventFilter(self) so to override event filtering. Now it’s only the matter of adding condition logic to filter out different event types such as QEvent.MouseButtonPress and QEvent.MouseButtonDblClick with event.type() We can also filter which button is being used using event.button(). timeout Using a built-in timer from Qt QTimer(), we are able to fire off timer events between our clicks. A timeout signal is fired after a certain interval we defined using setInterval(). the timeout() method is then used to determine what custom signal to emit. Custom Signal Note that I created three custom signals for three different clicking type I want to register. 123right_clicked = QtCore.Signal()left_clicked = QtCore.Signal()double_clicked = QtCore.Signal() This enhanced the usability of the click behaviour, meaning that this extended QPushbutton can tell whether the user did a single left or right click or a double click. In my example above, I wrapped all the click events in the class itself. But in the main application, we can also instantiate MyButton and connect click event to method of our choice. 123btn = MyButton(&#x27;Button1&#x27;)btn.doubled_clicked.connect(func1)btn.right_clicked.connect(func2) Hover Effect As a bonus, I want to include a “Button” with custom hover effect, but it is technically a QLabel object with extended functionality, which is being used in my SnapTool. 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950class HoverBtn(QtWidgets.QLabel): clicked = QtCore.Signal(QtCore.QObject) def __init__(self, parent): super(HoverBtn, self).__init__(parent) style = &quot;&quot;&quot; QFrame&#123; border-radius: 25px; border-width: 2px; border-style: solid; border-color: rgb(20, 20, 20); background-color: rgb(170, 170, 170); &#125; &quot;&quot;&quot; self.installEventFilter(self) self.setStyleSheet(style) def eventFilter(self, obj, event): if event.type() == QtCore.QEvent.Enter: self.set_outline(1) return True elif event.type() == QtCore.QEvent.Leave: self.set_outline(0) return True if event.type() == QtCore.QEvent.MouseButtonPress \\ and event.button() == QtCore.Qt.LeftButton: self.clicked.emit(self) return True return False def set_outline(self, status): &quot;&quot;&quot; Update widget stylesheet when highlight &quot;&quot;&quot; style = self.styleSheet() border_pattern = r&#x27;border-color\\: rgb\\(\\d+, \\d+, \\d+\\)&#x27; dark = &#x27;border-color: rgb(20, 20, 20)&#x27; light = &#x27;border-color: rgb(21, 255, 9)&#x27; if status == 1: style = re.sub(border_pattern, light, style) elif status == 0: style = re.sub(border_pattern, dark, style) self.setStyleSheet(style) The hover effect is achieved by swapping stylesheet properties, and the rest of the event filtering is very similar to the previous double click button. Reference Qt Centre - Double Click Capturing Stack Overflow - Pyqt Mouse MouseButtonDblClick event","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"}]},{"title":"Best Practices Connecting Qt Signal in For Loop","slug":"qt-signal-in-for-loop","date":"2021-04-17T07:00:00.000Z","updated":"2023-09-02T17:59:54.131Z","comments":true,"path":"post/qt-signal-in-for-loop/","link":"","permalink":"https://www.xingyulei.com/post/qt-signal-in-for-loop/","excerpt":"","text":"Introduction We often need to create ui elements on the fly, sometimes we do it in something like a for loop. An example would be creating a series of QPushButton and connect them to a function through different argument values. An example is shown below: 1234567891011121314151617class Demo(QtWidgets.QWidget): def __init__(self, parent=None): super(Demo, self).__init__(parent) # initialization object layout = QtWidgets.QVBoxLayout() for index in range(6): pushbutton = QtWidgets.QPushButton(&#x27;button &#123;&#125;&#x27;.format(index)) pushbutton.clicked.connect(lambda: self.trigger(index)) layout.addWidget(pushbutton) self.setLayout(layout) @staticmethod def trigger(index): print(&#x27;button &#123;&#125; clicked&#x27;.format(index)) Here I created six QPushButton and when I click them it should output which button is being clicked. But if we run this script and try to click each button it will always output “button 5 clicked” (aka, the last button). It is safely to assume that the argument passed during the for loop always result in the last index. Explanation Based on a kind response from stackoverflow: lambdas do not store the value of button when it is defined. The code describing the lambda function is parsed and compiled but not executed until we actually call the lambda. Therefore, when a button is clicked, the current value of that variable is used (the last index). What’s the solution? Lambda with solid variable Passing solid variable to the lambda 1pushbutton.clicked.connect(lambda _, i=index: self.trigger(index=i)) Note that we created another temporary variable before index as the first argument passed in the lambda will always return as False. Because Qt defines the signal QAbstractButton.clicked to take a single argument with a default value of False. Since our lambda is handling that signal, it gets called with False. Partial approach Use functools.partial also works 12from functools import partialpushbutton.clicked.connect(partial(self.trigger, index)) Note that in some cases where wrappers are being used in trigger function, it could be trickier to use this as oppose to lambda Reference Stack Overflow - First lambda capture of local variable always False Stack Overflow - Connecting multiples signal/slot in a for loop in pyqt","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"}]},{"title":"Take Your Qt App to the Next Level with Custom Widgets and Dialogs (No .ui File Needed)","slug":"qt-template-no-ui","date":"2021-02-11T08:00:00.000Z","updated":"2023-09-02T18:03:26.306Z","comments":true,"path":"post/qt-template-no-ui/","link":"","permalink":"https://www.xingyulei.com/post/qt-template-no-ui/","excerpt":"","text":"UI Module without .ui file There is a different between inheriting from QWidget class vs QMainWindow Inheriting from QWidget: 12345678910111213141516class InheritQWidget(QtWidgets.QWidget): def __init__(self, parent=None): super(InheritQWidget, self).__init__(parent) # initialization object layout = QtWidgets.QGridLayout() listWidget = QtWidgets.QListWidget() #treeWidget = QtWidgets.QTreeWidget() # set # treeWidget.setParent(listWidget) layout.addWidget(listWidget) self.setLayout(layout) listWidget.addItem(&#x27;item A&#x27;) listWidget.addItem(&#x27;item B&#x27;) Inheriting from QMainWindow 123456789101112131415161718class InheritQMainWindow(QtWidgets.QMainWindow): # Window inherits from QMainWindow the layout is already defined # to accommodate any toolbars or any other QMainWindow component # use the setCentralWidget() to accommodate this def __init__(self, parent=None): super(InheritQMainWindow, self).__init__(parent) # initialization object widget = QtWidgets.QWidget() layout = QtWidgets.QGridLayout() # set self.setCentralWidget(widget) widget.setLayout(layout) label = QtWidgets.QLabel(&#x27;test&#x27;) layout.addWidget(label, 0, 0) Custom Dialog Sometimes we need a quick window to display some information, but the built-in qt message boxes aren’t suitable for the job. Custom Widget We can choose to create a widget class, but also for saving time, we can create a temporary custom widget example: Couple of things worth noting: correctly initialize the widget self.customWidget = QtWidgets.QWidget() will allow widget be child of the main window, thus allow widget to close when main window is closed so not customWidget = QtWidgets.QWidget() or self.customWidget = QtWidgets.QWidget(self) use getattr in combination with QStyle and name of the built-in icon use win.setAttribute(QtCore.Qt.WA_DeleteOnClose) to make sure the child widget is killed after main window is closed, because default close only hides window objects self.customWidget.show() is the core command to call it to display Custom QMessageBox add custom buttons to the QMessageBox layout 123456789101112131415dialog = QtWidgets.QMessageBox()dialog.setText(&quot;Overwrite?&quot;)dialog.setIcon(QtWidgets.QMessageBox.Critical)yes_btn = dialog.addButton(&quot;Yes!&quot;, QtWidgets.QMessageBox.YesRole)no_btn = dialog.addButton(&quot;No&quot;, QtWidgets.QMessageBox.NoRole)abort_btn = dialog.addButton(&quot;Abort&quot;, QtWidgets.QMessageBox.RejectRole)dialog.exec_()if dialog.clickedButton() == yes_btn: print(&quot;yes&quot;)elif dialog.clickedButton() == no_btn: print(&quot;no&quot;)elif dialog.clickedButton() == abort_btn: print(&quot;abort&quot;) Don’t use the return value of QMessageBox::exec, as it only makes sense for standard buttons. Also don’t rely on buttonRole as multiple buttons could be sharing the same role. Reference Programiz - Python getattr() GUIS - Q&amp;A: Are there any built-in QIcons?","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"}]},{"title":"A Simple Template with Qt Menus, Submenus and Actions","slug":"qt-template-context-menu","date":"2021-02-05T08:00:00.000Z","updated":"2023-03-29T21:33:14.000Z","comments":true,"path":"post/qt-template-context-menu/","link":"","permalink":"https://www.xingyulei.com/post/qt-template-context-menu/","excerpt":"","text":"Reference Stack Overflow - How to add submenu in Qt","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"}]},{"title":"Learn Qt Custom Sorting with Our Easy Guide","slug":"qt-sorting","date":"2021-01-23T08:00:00.000Z","updated":"2023-09-02T18:01:37.928Z","comments":true,"path":"post/qt-sorting/","link":"","permalink":"https://www.xingyulei.com/post/qt-sorting/","excerpt":"","text":"Sorting Overview Sorting happens a lot in qt viewports like list, table and tree. Using convenience class such as item-based widget provides limited sorting options. One common thing may occur when we are sorting items is the widget treats their value as string instead of int, which will result incorrect ordering 12345678910111213141516list = [&quot;3&quot;, &quot;1&quot;, &quot;2&quot;, &quot;20&quot;, &quot;92&quot;, &quot;89&quot;, &quot;40&quot;, &quot;10&quot;, &quot;11&quot;]if __name__ == &#x27;__main__&#x27;: app = QtWidgets.QApplication(sys.argv) mywidget = QtWidgets.QTableWidget() mywidget.insertColumn(0) for index in range(len(list)): mywidget.insertRow(index) value = list[index] item = QtWidgets.QTableWidgetItem(value) mywidget.setItem(index, 0, item) mywidget.sortItems(0, QtCore.Qt.AscendingOrder) mywidget.show() sys.exit(app.exec_()) This will sort the list of items based on their string, so the order will be: 1234- 1- 10- 11- 2 instead of 123- 1- 2- ... So naturally, we would need to specify the item value as integer type, but we cannot instantiate item with integer, but setData() will work 1234# intead of item = QtWidgets.QTableWidgetItem(int(value))# do thisitem.setData(QtCore.Qt.ItemDataRole, int(value)) Now everything will sort by numeric order Custom Sorting (Operator override) What if we need more than numeric value for our data, for example, when displaying frame number, we would like to include frame range too. Like frame 1, frame 2, frame 3-7, frame 8, frame 9-14. It looks like using string is the only option. This time we need to override value compare operator for these value, that is making our own item class like the following example the __lt__ is the less than operator (&lt;) Everything should behave correctly Custom Sorting (QSortFilterProxyModel Class) https://doc-snapshots.qt.io/qtforpython-5.15/PySide2/QtCore/QSortFilterProxyModel.html Reference Stack Overflow - Is it possible to sort numbers in a QTreeWidget column?","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"}]},{"title":"Achieve Realistic Physics in Unity with Verlet Integration","slug":"unity-verlet-integration","date":"2020-11-19T08:00:00.000Z","updated":"2023-03-29T21:44:14.000Z","comments":true,"path":"post/unity-verlet-integration/","link":"","permalink":"https://www.xingyulei.com/post/unity-verlet-integration/","excerpt":"","text":"Introduction When simulating a particle movement, we naturally think of Euler integration, where the position of the particle can be expressed as such: (free falling motion) x=0.5∗g∗t2x = 0.5*g*t^2 x=0.5∗g∗t2 This is an extremely easy use case. The position of the particle can be represented using a function of time. But in real life, a particle can be affected by multiple forces (and even unstabled force caused non-constant acceleration) and Euler integration also has inaccurate estimation when time step is very large. In my understanding, the use of Verlet is good for complex particle movement. What it essentially does is relate force with position rather than velocity. The process first calculate the current particle position and the position one step back: velocity=X current −X previous ;velocity = X~current~-X~previous~; velocity=X current −X previous ; X previous =X current ;X current =X current +velocityX~previous~ = X~current~; X~current~ = X~current~+velocity X previous =X current ;X current =X current +velocity This works magically, here’s some sample code to help understand it, and a Demo. 1234// without other influence, the following updates the particle positionvelocity = posNow - posOld;posOld = posNow;posNow += velocity; Calculate Force What if we want to add gravity to the particle like the free falling above? Just add the acceleration to the current position, and the change will add-up on the next integration. The following also applies to forces like friction. 1posNow += GRAVITY; // not sure if we should multipy Time.deltatime Constraint Constraint are usually in the form of constraining particles to a specific distance, like spring. When mulitple constraints acts on single particle, one constraint will affect the other. To solve this, loop the constraint multiple time for each time step. 123456789101112131415161718192021222324252627for (int count = 0; count &lt; ITERATION; count++)&#123; Constriants();&#125;// constraint on rope to make fixed distance between segmentsvoid Constriants()&#123; for(int index = 0; index &lt; segment-1; index++) &#123; float distance = (currentSeg.posNow - nextSeg.posNow).magnitude; float error = Mathf.Abs(distance - ropeDist); Vector2 changeDir = Vector2.zero; if (distance &gt; ropeDist) changeDir = (currentSeg.posNow - nextSeg.posNow).normalized; else if (distance &lt; ropeDist) changeDir = (nextSeg.posNow - currentSeg.posNow).normalized; Vector2 changeAmount = changeDir * error; if (index == 0) nextSeg.posNow += changeAmount; else&#123; currentSeg.posNow -= changeAmount * 0.5f; nextSeg.posNow += changeAmount * 0.5f; &#125; &#125;&#125; Collision Penalty based system or projection collision reaction 12345678910111213141516171819// example for bounding box collisionVector2 velocity = posNow - posOld;if (posNow.x &gt; screenWidth)&#123; posNow.x = screenWidth; posOld.x = posNow.x + velocity.x;&#125;else if (posNow.x &lt; 0)&#123; posNow.x = 0; posOld.x = posNow.x + velocity.x;&#125;if (posNow.y &gt; screenWidth)&#123; posNow.y = screenWidth; posOld.y = posNow.y + velocity.y;&#125;else if (posNow.y &lt; 0)&#123; posNow.y = 0; posOld.y = posNow.y + velocity.y;&#125; Resources Gamedev.net - A Verlet based approach for 2D game physics Youtube - Coding Math: Episode 36 - Verlet Integration Part I Youtube - 2D Rope Tutorial - Make Swinging Rope in Unity (Verlet Integration) Wikipedia - Velocity Verlet","categories":[{"name":"3d math","slug":"3d-math","permalink":"https://www.xingyulei.com/categories/3d-math/"}],"tags":[{"name":"unity","slug":"unity","permalink":"https://www.xingyulei.com/tags/unity/"},{"name":"c#","slug":"c","permalink":"https://www.xingyulei.com/tags/c/"}]},{"title":"Beginner's Guide to Graphics Lighting and Shading","slug":"graphics-shading-basics","date":"2020-09-16T07:00:00.000Z","updated":"2023-09-02T17:48:27.551Z","comments":true,"path":"post/graphics-shading-basics/","link":"","permalink":"https://www.xingyulei.com/post/graphics-shading-basics/","excerpt":"","text":"Glossary Wikipedia - Computer Graphics Glossary Shader: programs running on gpu that describes general computation (vertex transformation: vertex shader; shading calculation: fragment shader) G-buffer: a screen space representation of geometry and material information (e.g. color, normal, position/depth) Fragment: is the corresponding pixel generated by geometric primitives, but a pixel on screen can be a product of more than one fragment due to Z-buffering, blending etc. Vertex lighting vs. Per-pixel lighting Vertex Lighting Lighting is computed per-vertex calculation happens in the vertex shader lighting/color information is then linearly interpolated across faces and rasterized it is cheaper, faster (since there are fewer vertices compared to pixels) but noticeable artifact with low-poly objects Per-Pixel Lighting Lighting is computed per-pixel/fragment (but what is this exactly? see the example below) Calculation happens in the fragment shader normal information (passed from vertex shader) is interpolated on the faces, lighting/color is calculated and rasterized. it is more expensive but less artifact Example of a per-pixel lighting shader Vertex Shader 123456789101112131415161718#version 330 corelayout (location = 0) in vec3 aPos;layout (location = 1) in vec3 aNormal;out vec3 FragPos;out vec3 Normal;uniform mat4 model;uniform mat4 view;uniform mat4 projection;void main()&#123; FragPos = vec3(model * vec4(aPos, 1.0)); Normal = mat3(transpose(inverse(model))) * aNormal; gl_Position = projection * view * vec4(FragPos, 1.0);&#125; Fragment Shader 123456789101112131415161718192021222324252627282930313233#version 330 coreout vec4 FragColor;in vec3 Normal; in vec3 FragPos; uniform vec3 lightPos; uniform vec3 viewPos; uniform vec3 lightColor;uniform vec3 objectColor;void main()&#123; // ambient float ambientStrength = 0.1; vec3 ambient = ambientStrength * lightColor; // diffuse vec3 norm = normalize(Normal); vec3 lightDir = normalize(lightPos - FragPos); float diff = max(dot(norm, lightDir), 0.0); vec3 diffuse = diff * lightColor; // specular float specularStrength = 0.5; vec3 viewDir = normalize(viewPos - FragPos); vec3 reflectDir = reflect(-lightDir, norm); float spec = pow(max(dot(viewDir, reflectDir), 0.0), 32); vec3 specular = specularStrength * spec * lightColor; vec3 result = (ambient + diffuse + specular) * objectColor; FragColor = vec4(result, 1.0);&#125; As we can see, fragment position and normal information are passed into the fragment shader from vertex shader (where the pre-compute happens), the lighting calculation (Phong lighting) is calculated per-fragment. On a related note: gpu cost are related to how many vertices are passed in to the gpu from buffer and how complex the lighting calculation is in the fragment shader (this could be the algorithm/model complexity, and the number of passes); Forward vs. Deferred Rendering Forward Rendering The standard, out-of-the-box rendering technique Geometries are passed to gpu, going through vertex shader and fragment shader, with each geometry and each light computed separately one at a time to form the final render. Render complexity: O(num of geometry fragments * num of lights) Deferred Rendering Render is deferred until all geometry has been processed Geometries are passed to gpu, going through vertex shader and fragment shader (without lighting pass), final rendering is computed/combined with multiple render passes (one pass for getting all geometry information to G-buffer, second pass for compute lighting based on the G-buffer). Render complexity: O(screen resolution * num of lights) Discussion Everything all comes down to lighting, as gpu can easily handle vertex information, but the most expensive are lighting calculation which can easily slow down the rendering. Forward rendering iterates and compute each fragments of each geometry, no matter if it overlaps or is hidden by other fragments. So for each pixel, we could have already run multiple fragment shaders. This is where deferred rendering come in handy, the G-buffer stores information such as color, normal and depth. The lighting later on can know how to produce the final render by combining all the information (For example: depth test can also cull out all the fragments that are being obscured). So essentially, each pixel only runs a single fragment shader. Rasterization vs. Ray tracing The forward, deferred rendering techniques are all in the realm of rasterization, which is the most popular and traditional real-time rendering technique. With the advance of hardware, ray tracing, which is computationally demanding (usually used in films/animation) can now be used in real-time video games. Rasterization We gather objects information and projects each one by one on screen (per fragment), fragment shader computes the final color of every fragment to form pixels on screen. The fundamental of rasterizing is that for each object/geometry, we look at (rasterize it) it’s verts/triangles to cover pixels. So, as discussed in deferred rendering, every object is drawn but not all of them are displayed on screen. This overdraw can be accelerated by using deferred shading’s depth test. Ray tracing We cast rays from our eyes (camera) for each pixel and gather information of those rays as they travel through/intersects with objects and interacts with lights to form the final render on screen. The fundamental of ray tracing is that for each pixel, we look at (shoot a ray) each object/geometry to see how they contribute to the color of that pixel. As for ray tracing, we need to shoot many rays for each pixel, and more when there are reflection and refraction. One way to accelerate this is to use bounding volume. Discussion The most significant difference in visual is that ray tracing is physically more accurate than rasterization, thus more realistic. Which is more apparent in dynamic environment with objects that reflects and refract. Rasterization needs many estimation techniques to handle lighting and shadowing such as more render passes, baked light map, cubemap reflection, but ray tracing gets all the results out of the box. Reference Envato tuts+ - Forward Rendering vs. Deferred Rendering Learn OpenGL - Deferred Shading Wikipedia - Deferred Lighting Learn OpenGL - Basic Lighting Knowww - Per-vertex vs. per-fragment lighting Unity Forum - What’s the difference between per-pixel and per-vertex lit in Forward Rendering? Youtube - OpenGL Fragment Shaders | How Do Fragment Shaders Work? Nvidia - Ray Tracing Essentials Stack Exchange - Mirror Reflections: Ray Tracing or Rasterization? Quora - What is the difference between ray tracing and very high shader details?","categories":[{"name":"graphics programming","slug":"graphics-programming","permalink":"https://www.xingyulei.com/categories/graphics-programming/"}],"tags":[{"name":"rendering","slug":"rendering","permalink":"https://www.xingyulei.com/tags/rendering/"}]},{"title":"Comprehensive Guide to C++ Reference and Pointer","slug":"cpp-reference-pointer","date":"2020-08-13T07:00:00.000Z","updated":"2023-03-29T21:04:08.000Z","comments":true,"path":"post/cpp-reference-pointer/","link":"","permalink":"https://www.xingyulei.com/post/cpp-reference-pointer/","excerpt":"","text":"Basics De-referencing add * before a pointer to expose the object’s value it’s pointing varN, varN’s value ptrN, varN’s address *ptrN, de-reference ptrN, varN’s value (&amp;ptrN, ptrN’s address, which has little meaning) Symbol to access a member of a class or class object (instance) a-&gt;b: b is the member of the object that pointer a refers to a.b: b is the member of the object, or the reference of an object a a::b: b is the member of the class, or namespace a Declaration Pointer Declaration Syntax: varType* varName Declaration 12//declare a c++ pointer to an integerint* ptrx; Initialization 1234// a pointer pointing to address of varN, varN type should be intint varN = 9;int* ptrN;ptrN = &amp;varN; short-hand: 1int* ptrN = &amp;varN; Reference Declaration Syntax: varType&amp; varName 123456789int main()&#123; int&amp; invalidRef; // error: references must be initialized int x = 5; int&amp; ref = x; // okay: reference to int is bound to int variable return 0;&#125; When a reference is initialized with an object (or function), we say it is bound to that object (or function). The process by which such a reference is bound is called reference binding references must be bound to a modifiable variable Function Pass Argument Both of these methods are prevented copying the variable, and capable of modifying the variable value that is passed in; if a variable is expensive to copy, e.g. struct, class By Reference Modify the variable, can’t pass in an un-modifiable variable like const Syntax varType&amp; varName 1234void printValue(int&amp; y)&#123; std::cout &lt;&lt; y &lt;&lt; &#x27;\\n&#x27;;&#125; Prevent modifying the variable, while having the benefit of not making a copy Syntax const varType&amp; varName 1234void printValue(const int&amp; y)&#123; std::cout &lt;&lt; y &lt;&lt; &#x27;\\n&#x27;;&#125; By Address (via pointer) Syntax varType* varName, to access the variable, de-reference using *varName 1234void printByAddress(const std::string* ptr) // The function parameter is a pointer that holds the address of str&#123; std::cout &lt;&lt; *ptr &lt;&lt; &#x27;\\n&#x27;; // print the value via the dereferenced pointer&#125; Function Return Argument Variable Pointer works almost identically to return by reference, except a pointer to an object is returned instead of a reference to an object The major advantage of return by address over return by reference is that we can have the function return nullptr if there is no valid object to return Variable Reference Never return a reference to a local variable or some such, because it won’t be there to be referenced. Syntax varType&amp; funName(args) References Stack Overflow - When do I use a dot, arrow, or double colon to refer to members of a class in C++? Runestone Academy - Pointers Learn C++ - Lvalue reference Learn C++ - Return by reference and return by address Learn C++ - Pass by lvalue reference Learn C++ - Pass by address","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"c++","slug":"c","permalink":"https://www.xingyulei.com/tags/c/"}]},{"title":"Maya Python API Tutorial Series (3. Custom Deformer)","slug":"maya-api-deformer","date":"2019-11-11T08:00:00.000Z","updated":"2023-03-29T21:10:12.000Z","comments":true,"path":"post/maya-api-deformer/","link":"","permalink":"https://www.xingyulei.com/post/maya-api-deformer/","excerpt":"","text":"API 1.0 custom deformer Example Note: MPxDeformerNode is only available in API 2.0 Custom Attribute vs. Built-in Attribute In the last chapter, we know how to create custom numeric type attribute using MFnNumericAttribute. Sometimes in our node, we want to access existing built-in attribute. We do so by using OpenMayaMPx.cvar.MPxDeformerNode_(attributeName) before Maya 2016, we use OpenMayaMPx.cvar.MPxGeometryFilter_(attributeName) after 2016. Obtain Input Geometry In the sample code, we define our custom function getDeformerInputGeom(self, dataBlock, geomIndex) to obtain the input mesh to the deformer node. We will discuss this later. Accessory Node Accessory node acts like a secondary driver node connected to our deformer so they can influence the deformation. In the sample code, our accessory node is a locator which when we connects its world matrix, it will change our mesh’s deformation when translating. Custom Dependency Node vs. Custom Deformer Node Registration: In our previous chapter, we register our node using registerNode() with node type: omMPx.MPxNode.kDependNode, in deformer node, we use omMPx.MPxNode.kDeformerNode as our node type. Inheritance: We now inherit our class from omMPx.MPxDeformerNode instead of omMPxNode there’s still compute() in MPxDeformerNode class, but we want to write our deformation algorithm in deform(). Accessory Node: accessoryNodeSetup(self, dagModifier) and accessoryAttribute(self) is override to allow us to control accessory node along with our deformer. Procedure Step 1: Declare attributes (Same as last chapter) Step 2: Initialize Node Node Creator 12def nodeCreator(): return mpx.asMPxPtr(MyDeformer()) Only API 1.0 is available. Node Initializer 12345678910111213141516171819202122232425262728def nodeInitializer(): # 1: create reference to numericAttribute and matrixAttribute function sets numericAttrFn = om.MFnNumericAttribute() matrixAttrFn = om.MFnMatrixAttribute() # 2: create attribute using the function set MyDeformer.inNumAttr = numericAttrFn.create(&#x27;num&#x27;, &#x27;n&#x27;, om.MFnNumericData.kFloat, 0.0) numericAttrFn.setMin(-1.0) numericAttrFn.setMax(1.0) numericAttrFn.setReadable(False) MyDeformer.inMatAttr = numericAttrFn.create(&#x27;matrix&#x27;, &#x27;m&#x27;) matrixAttrFn.setStorable(False) matrixAttrFn.setConnectable(True) # 2.5: access built-in attribute using OpenMayaMpx.cvar.MPxGeometryFilter_outputGeom outputGeom = mpx.cvar.MPxGeometryFilter_outputGeom # 3: attach attribute MyDeformer.addAttribute(MyDeformer.inNumAttr) MyDeformer.addAttribute(MyDeformer.inMatAttr) # 4: add circuit (relationship in-&gt;out) MyDeformer.attributeAffects(MyDeformer.inNumAttr, ouputGeom) MyDeformer.attributeAffects(MyDeformer.inMatAttr, ouputGeom) # 5: make attribute paintable cmds.makePaintable(nodeName, &#x27;weights&#x27;, attrType=&#x27;multiFloat&#x27;, shapeMode=&#x27;deformer&#x27;) we access the output Geometry attribute so we can later add relationship to it. RegisterNode 1mplugin.registerNode(nodeName, nodeID, nodeCreator, nodeInitializer, om.MPxNode.kDeformNode) De-registerNode 1mplugin.deregisterNode(nodeID) Step 3: Initialize Node （Deform Algorithm） 1234567891011121314151617181920212223242526272829303132333435363738394041424344class MyNode(om.MPxDeformNode): inNumAttr = om.MObject() inMatAttr = om.MObject() def __init__(self): om.MPxDeformNode.__init__(self) def deform(self, dataBlock, geomIterator, localToWorldMatrix, geomIndex): # step 1: access built-in attribute value using attribute name and attribute handle envelopeAttr = mpx.cvar.MPxGeometryFilter_envelope envelopeHandle = dataBlock.inputValue(envelopeAttr) envelopeValue = envelopeHandle.asFloat() # step 1.5: access custom attribute value inNumHandle = dataBlock.inputValue(MyDeformer.inNumAttr) inNumValue = inNumHandle.asFloat() # step 1.55: access custom translate value connected to an accessory node inMatHandle = dataBlock.inputValue(MyDeformer.inMatAttr) inMatValue = inNumHandle.asMatrix() transMatrix = om.MTransformationMatrix(inMatValue) # matrix type translateValue = transMatrix.getTranslation(om.MSpace.kObject) # vector type # step 2: access input mesh inputMesh = self.getDeformerInputGeom(dataBlock, geomIndex) # step 2.5: access mesh normals meshFn = om.MFnMesh(inputMesh) normalVectorArray = om.MFloatVectorArray() # create float vector array to store normal vector meshFn.getVertexNormals(False, normalVectorArray, om.MSpace.kObject) # (average normal or not?, the array to store, normal space) # step 3: iterate the mesh vertices and deform it newVertexPosArray = om.MPointArray() # to store new vertices position while not geomIterator.isDone(): vertexPos = geomIterator.position() vertexIndex = geomIterator.index() normalVector = om.MVector(normalVectorArray[vertexIndex]) # built-in function weightValue(dataBlock, geomIndex, vertexIndex) weight = self.weightValue(dataBlock, geomIndex, vertexIndex) # vertexPos.x = vertexPos.x + [calculation of normalVector.x and translateValue[0]] * envelopeValue * weight newVertexPosArray.append(vertexPos) geomIterator.next() geomIterator.setAllPositions(newVertexPosArray) To access a value from an attribute, we use handle = dataBlock.input/outputValue(MyNode.attr) if we have a custom attribute inNumAttr: inNumHandle = dataBlock.inputValue(MyDeformer.inNumAttr) inNumValue = inNumHandle.asFloat() if we have a built-in attribte envelope: we first get our attribute name envelope envelopeAttr = mpx.cvar.MPxGeometryFilter_envelope envelopeHandle = dataBlock.inputValue(envelopeAttr) envelopeValue = envelopeHandle.asFloat() To get normal for individual vertices on our input mesh, we first need to obtain our input mesh using our own function: getDeformerInputGeom(self, dataBlock, geomIndex). And using mesh function set MeshFn’s getVertexNormals() we store the normal vector in om.MFloatVectorArray() type array. To deform our mesh: we use the geometry iterator to perform iteration on each mesh vertex and re-calculate its position. We combine the use of geoIterator.position() and geomIterator.setPosition(point) or geomIterator.setAllPositions(pointArray). To access weight value on each vertex, we use built-in function weightValue(dataBlock, geomIndex, vertexIndex). In which, geomIndex is provided in deform() and vertexIndex is from geomIterator. Step 3.1: Get in-Mesh 1234567891011def getDeformerInputGeom(self, dataBlock, geomIndex): inputAttr = mpx.cvar.MPxGeometryFilter_input inputHandle = dataBlock.outputArrayValue(inputAttr) # use outputArray instead of inputArray to avoid re-computation inputHandle.jumpToElement(geomIndex) inputElementHandle = inputHandle.outputValue() inputGeomAttr = mpx.cvar.MPxGeometryFilter_inputGeom inputGeomHandle = inputElementHandle.child(inputGeomAttr) # this is different from how we usually get handler inputGeomMesh = inputGeomHandle.asMesh() return inputGeomMesh At this point, I can’t fully interpret the meaning of this segment. Step 4: Accessory Node 1234567891011121314151617181920def accessoryNodeSetup(self, dagModifier): # step1: create the accessory node using the supplied dagModifier locator = dagModifier.createNode(&#x27;locator&#x27;) # step2: access accessory node&#x27;s attribute(can&#x27;t use mplug type, has to be mobject type) # access dependency node function set dependNodeFn = om.MFnDependencyNode(locator) matrixPlug = dependNodeFn.findPlug(&#x27;worldMatrix&#x27;) # this returns mplug type attribute, we need mobject type attribute matrixAttr = matrixPlug.attribute() # step3: connect mobject type(required) together # param: accessory node(mobject), accessory attr(mobject), deformer node(mobject: using self.thisMObject()), deformer attr(mobject) mConnectStatus = dagModifier.connect(locator, matrixAttr, self.thisMObject(), MyDeformer.inMatAttr) # now the accessory node&#x27;s worldMatrix is driving to the custom in-matrix of the deformer node return mConnectStatusdef accessoryAttribute(self): # returns the deformer node attribute connected return MyDeformer.inMatAttr The dagModifer is supplied in the accessory node. We use dagModifier’s connect function to connect the accessory node’s attribute to our deformer node’s attribute. In this case, we have accessory’s attribute: worldMatrix (a built-in attribute obtained from MFnDependencyNode.findPlug()) and our custom defined MyDeformer.inMatAttr. One thing to note is that, the .connect() only takes MObject which we cannot supply MPlug type object matrixPlug = ...findPlug('attributeName'), we perform an additional step matrixAttr = matrixPlug.attribute() to get the MObject type attribute. Now we supply .connect() with parameters: an accessory node (MObject type), accessory node’s attribute (MObject type), deformer node (MObject type) and deformer node’s attribute (MObject type) as follows: mConnectStatus = dagModifier.connect(locator, matrixAttr, self.thisMObject(), MyDeformer.inMatAttr) Reference Chad Vernon - Maya API Programming","categories":[{"name":"maya python api","slug":"maya-python-api","permalink":"https://www.xingyulei.com/categories/maya-python-api/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Maya Python API Tutorial Series (2. Custom Node)","slug":"maya-api-node","date":"2019-10-10T07:00:00.000Z","updated":"2023-03-29T21:10:20.000Z","comments":true,"path":"post/maya-api-node/","link":"","permalink":"https://www.xingyulei.com/post/maya-api-node/","excerpt":"","text":"API 2.0 custom node example Data block (MDataBlock) Data block refers the entire container of a node. This container stores all the values for each attribute of the node. The datablock of this node is provided in the compute() function. Plug (MPlug) Plug is the outer plug of the node which provides the connections to other node’s plug. The MPlug usually connects the plug from another node and the value of a certain attribute of this node. The plug is also provided in the compute() function Data handle (MDataHandle) Data handle usually stores an attribute’s value. We can set a value to an attribute using MDataHandle.setType(value), and get an attribute’s value using **value = MDataHandle.asType()**. Procedure Step 1: Declare attributes (MObject) in the class 123456789class MyNode(om.MPxNode): inAttr = om.MObject() outAttr = om.MObject() def __init__(self): om.MPxNode.__init__(self) def compute(self, plug, dataBlock): pass inAttr refers to the input attribute that we are creating, outAttr refers to the output attribute that we are creating. Both are declared as MObject() type. We will later access them using MyNode.inAttr and MyNode.outAttr. Step 2: Initialize Node Node Creator 12def nodeCreator(): return MyNode() Node Creator in API 2.0 directly returns an instance to the class, API 1.0 uses a pointer like in command plugin. Node Initializer 123456789101112131415161718def nodeInitializer(): &#x27;&#x27;&#x27;1: create reference to attribute function set such as numericAttribute&#x27;&#x27;&#x27; numericAttrFn = om.MFnNumericAttribute() &#x27;&#x27;&#x27; 2: create attribute using the function set&#x27;&#x27;&#x27; MyNode.inAttr = numericAttrFn.create(&#x27;in&#x27;, &#x27;i&#x27;, om.MFnNumericData.kFloat, 1.0) numericAttrFn.readable = True numericAttrFn.writable = True MyNode.outAttr = numericAttrFn.create(&#x27;out&#x27;, &#x27;o&#x27;, om.MFnNumericData.kFloat) numericAttrFn.readable = True numericAttrFn.writable = False &#x27;&#x27;&#x27; 3: attach attribute&#x27;&#x27;&#x27; MyNode.addAttribute(MyNode.inAttr) MyNode.addAttribute(MyNode.outAttr) &#x27;&#x27;&#x27; 4: add circuit (relationship in-&gt;out)&#x27;&#x27;&#x27; MyNode.attributeAffects(MyNode.inAttr, MyNode.outAttr) MFnNumericAttribute provides the function sets to create an attribute for numeric type attribute. There’s also MFnMatrixAttribute to create matrix type attribute and so on. Using the function set’s create() function, we add parameters for attribute’s long name, short name, data type, and default value (optional). This returns a MObject type attribute which is attached to the function set. We store it in the attribute declared earlier in the class. Set the attribute’s property using function set, such as readable, writable, hidden, storable, connectable (In API1.0, use like this numericAttrFn.setReadable(True)) Using the MyNode.addAttribute(MyNode.inAttr) to attach an attribute to the node Using the MyNode.attributeAffects(MyNode.inAttr, MyNode.outAttr) to design the affect relationship between attributes, in this case, change of inAttr will affect `outAttr. RegisterNode 1mplugin.registerNode(nodeName, nodeID, nodeCreator, nodeInitializer, om.MPxNode.kDependNode, nodeClassify) Parameters: name of the node, id of the node, node creator function, node initializer function, node type (DependNode or DeformNode…), node classification (utility, shading…) Example: nodeID = om.MTypeId(0x55555) nodeClassify = 'utility/general' De-registerNode 1mplugin.deregisterNode(nodeID) Step 3: Initialize Node 12345678910111213141516171819202122232425class MyNode(om.MPxNode): inAttr = om.MObject() outAttr = om.MObject() def __init__(self): om.MPxNode.__init__(self) def compute(self, plug, dataBlock): if plug == MyNode.outAttr: # 1: get datablock handle (inputValue returns MDataHandle type object) inHandle = dataBlock.inputValue(MyNode.inAttr) outHandle = dataBlock.outputValue(MyNode.outAttr) # 2: extract input value from the handle inValue = inHandle.asFloat() # 3: create logic and set output value outValue = inValue * 2 outHandle.setFloat(outValue) # 4: mark output plug as clean outHandle.setClean() else: return om.kUnknownParameter When MyNode.outAttr is dirty (meaning it needs to recompute), we use if plug == MyNode.outAttr: to identify this certain plug. (this if statement will work, even if plug is MPlug type and MyNode.outAttr is MObject type) We have already identified what input attribute is affecting this plug, in order to retrieve the value of this input, we need to attach a data handle on the data block specifying this certain input attribute we want to retrive. Therefore, we have handle = dataBlock.input/outputValue(MyNode.attr) Next, we use value = handle.asFloat() and handle.setFloat(value) to get and set the value from and to the attribute. (float type as example) Last, we mark the current plug as clean, by setClean() to the outHandle Reference Chad Vernon - Maya API Programming","categories":[{"name":"maya python api","slug":"maya-python-api","permalink":"https://www.xingyulei.com/categories/maya-python-api/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Maya Python API Tutorial Series (1. Command Plugin with Flags)","slug":"maya-api-command","date":"2019-09-29T07:00:00.000Z","updated":"2023-03-29T21:10:12.000Z","comments":true,"path":"post/maya-api-command/","link":"","permalink":"https://www.xingyulei.com/post/maya-api-command/","excerpt":"","text":"“Flags” vs “Argument” Take this as an example: cmds.group('circle1', 'sphere1', name='group1') circle1 and sphere1 are arguments name is the flag and group1 is the value Another example: cmds.polyCube(sx=10, axis=[0, 0, 1]) no argument is specified sx is the flag’s short name, subdivisionX is the flag’s long name [0, 0, 1] is axis flag’s value, each individual number is called parameters Procedure Step 1: Declare flag name outside the class 12345firstFlagShortName = &#x27;-f&#x27;firstFlagLongName = &#x27;-first&#x27;secondFlagShortName = &#x27;-s&#x27;secondFlagLongName = &#x27;-second&#x27;# more flags ... Step 2: Add flag and argument in syntax creator outside of class (this syntax creator will be further included in the plugin initialize function) 1234567891011121314151617def syntaxCreator(): &quot;&quot;&quot; create a OpenMaya.MSyntax object to store flags and argument &quot;&quot;&quot; syntax = om.MSyntax() # add flags with short name, long name, and value type syntax.addFlag(firstFlagShortName, firstFlagLongName, om.MSyntax.kDouble) syntax.addFlag(secondFlagShortName, secondFlagLongName, (om.MSyntax.kDouble, om.MSyntax.kDouble, om.MSyntax.kDouble)) # add more flags ... # add argument using MSyntax.addArg() function # add argument is not discussed, refer to document later return syntax Step 3: Parsing flags, called inside the class’s doIt function 123456789101112131415def parseArguments(self, args): &quot;&quot;&quot; instantiate MArgParser object, self.syntax() refers to the syntax created in step 2 &quot;&quot;&quot; argData = om.MArgParser(self.syntax(), args) # check if certain flags are set if argData.isFlagSet(firstFlagShortName): firstValue = argData.flagArgumentString(firstFlagShortName, 0) if argData.isFlagSet(secondFlagShortName): secondParam0 = argData.flagArgumentInt(secondFlagShortName, 0) secondParam1 = argData.flagArgumentInt(secondFlagShortName, 1) secondParam2 = argData.flagArgumentInt(secondFlagShortName, 2) # parse more flags ... Reference Chad Vernon - Maya API Programming","categories":[{"name":"maya python api","slug":"maya-python-api","permalink":"https://www.xingyulei.com/categories/maya-python-api/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Maya Python API Tutorial Series (0. Introduction)","slug":"maya-api-intro","date":"2019-08-18T07:00:00.000Z","updated":"2023-09-02T17:50:36.739Z","comments":true,"path":"post/maya-api-intro/","link":"","permalink":"https://www.xingyulei.com/post/maya-api-intro/","excerpt":"","text":"Overview Different from Maya Command, Maya API offers more low level access to Maya’s feature. We can think of Maya in multiple layers: Bottom Layer: System OS Maya Core: The entire Maya program written in C++ Maya API: Designated API exposed to developers, which can access Maya Core Maya Command: Helper Functions calling multiple Maya API Maya GUI: User graphics interface While Maya Command (MEL/Python) is most commonly used to write scripts, because it has fast prototyping and easy to learn. The downside is that it is often slow and can’t offer low level access to Maya Core. Maya API on the other hand, is complicated, but offers faster speed and most flexibility. It comes with Python and C++. Python API has version 1.0 and 2.0. Difference Between Python API vs C++ API API1.0 vs 2.0 API 1.0 (Before 2012) has access to more features offered in C++ API 2.0 faster and more Pythonic, but some class such as OpenMayaFX, OpenMayaDeformerNode is not supported. General Format Difference import module 1.0 has a separate maya.OpenMayaMPx along with maya.OpenMaya 2.0 has maya.api.OpenMaya including the original MPx command maya_useNewAPI 2.0 use this function to declare using API 2.0 cmd creator 1.0 uses a MPx pointer object to point to instance of the class 2.0 director returns the instance of the class other syntax difference will be discussed later Reference Chad Vernon - Maya API Programming","categories":[{"name":"maya python api","slug":"maya-python-api","permalink":"https://www.xingyulei.com/categories/maya-python-api/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Save Time and Boost Efficiency: Learn to Run Maya in Batch Mode","slug":"maya-batch-mode","date":"2019-05-09T07:00:00.000Z","updated":"2023-05-08T02:03:08.508Z","comments":true,"path":"post/maya-batch-mode/","link":"","permalink":"https://www.xingyulei.com/post/maya-batch-mode/","excerpt":"","text":"Important: Post deprecated Please refer this blog post for most up-to-date Maya batch mode guide Import Standalone Module 12import maya.standalonemaya.standalone.initialize(name=&#x27;python&#x27;) Sometimes, import error could occur 1ImportError: No module named maya.standalone Solution check your python interpreter, it should match the maya python2 version. I changed my project interpreter in my pycharm setting. setup system environment variable, like the following if error still occurs, please check your maya directory 1234567891011121314151617181920import sysimport osMAYA_LOCATION = &quot;C:/Program Files/Autodesk/Maya2018&quot;PYTHON_LOCATION = MAYA_LOCATION + &quot;/Python/Lib/site-packages&quot;os.environ[&quot;MAYA_LOCATION&quot;] = MAYA_LOCATIONos.environ[&quot;PYTHONPATH&quot;] = PYTHON_LOCATIONsys.path.append(MAYA_LOCATION)sys.path.append(PYTHON_LOCATION)sys.path.append(MAYA_LOCATION+&quot;/bin&quot;)sys.path.append(MAYA_LOCATION+&quot;/lib&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/DLLs&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/Lib&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/Lib/plat-win&quot;)sys.path.append(MAYA_LOCATION+&quot;/Python/Lib/lib-tk&quot;)print(&#x27;\\n&#x27;.join(sys.path)) Add Functions Let’s add a test function to our standalone script. 1234567891011121314def test(): import maya.cmds as cmds # full path to your Maya file to OPEN maya_file_to_open = r&quot;C:\\Users\\Lei\\Desktop\\test.ma&quot; # Open your file cmds.file(maya_file_to_open, o=True) # full path to your Maya file to IMPORT maya_file_to_import = r&quot;C:\\Users\\Lei\\Desktop\\import.ma&quot; # Import the file. the variable &quot;nodes&quot; will hold the names of all nodes imported, just in case. cmds.file(maya_file_to_import, i=True, type=&quot;mayaAscii&quot;) render = r&quot;C:\\Users\\Lei\\Desktop\\te.ma&quot; cmds.file(rename=render) cmds.file(force=True, save=True, options=&#x27;v=1;p=17&#x27;, type=&#x27;mayaBinary&#x27;) print(&#x27;a&#x27;) This test function opens a maya file on my desktop and import a maya file and save out as another file. Execute from mayapy Execute from Command Line to do so, make sure to add mayapy to your system environment variable. in system variable: add C:\\Program Files\\Autodesk\\Maya2018\\bin to Path open command prompt, and enter mayapy [directory/firstStandalone.py] Execute using subprocess you can do it without going to command line, but by executing another .py using subprocess 1234567import subprocesscommand = &#x27;mayapy [directory/firstStandalone.py]&#x27;process = subprocess.Popen(command, shell=True, stdout=subprocess.PIPE)process.wait()print(process.returncode) # this return the message from cmd Standalone Script with Arguments Sometimes, we would want to pass arguments to our standalone script get argument as variable using sys.argv 1234import sysfile_path = sys.argv[1]file_name = sys.argv[2] Example from Toadstorm Nerdblog: 1234567891011121314151617181920212223242526272829import subprocessmaya_path = &#x27;directory/mayapy.exe&#x27; # mayapy or full path to mayapy.exescript_path = &#x27;directory/firstStandalone.py&#x27;def add_layer(file_names,layer_name): for file_name in file_names: command = r&#x27;mayapy &#123;&#125; &#123;&#125; &#123;&#125;&#x27;.format( script_path, file_name, layer_name ) process = subprocess.Popen( command, stdout=subprocess.PIPE, stderr=subprocess.PIPE ) process.wait() print(process.returncode) # this return the message from cmd if __name__ == &#x27;__main__&#x27;: # define a list of filenames to iterate through files = [&#x27;file1&#x27;, &#x27;file2&#x27;, &#x27;file3&#x27;] render_layer = &#x27;a new render layer&#x27; # run procedure, assuming you&#x27;ve already defined it add_layer(files, render_layer) Reference Tech-Artist Org - Import maya.standalone problem Stack Overflow - use external python script to open maya and run another script inside maya Stack Overflow - How to use an external interpreter for Maya? Toadstorm Nerdblog - Python in Maya Standalone","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"}]},{"title":"Supercharge Your Python Skills with These Essential Import Tips","slug":"py-import","date":"2019-03-16T07:00:00.000Z","updated":"2023-09-02T17:55:03.918Z","comments":true,"path":"post/py-import/","link":"","permalink":"https://www.xingyulei.com/post/py-import/","excerpt":"","text":"from ... import vs. import Always avoid wildcard imports like such: 1from my_module import * # don&#x27;t use this Instead, use regular import like: 1import my_module # use this Why? using wildcard import will pollute namespaces Using wildcard import will not import names with a leading underscore (unless the module defines an __all__ list) PEP8 recommend using regular import What does __init__.py do? __init__.py is used to specify a package, when import is trying to find the modules, But it is not required: meaning a package without __init__.py, The system can still find the modules after configuring appropriate PYTHONPATH using sys.path.append. __init__.py is executed after importing the package, I’ve seen sub-directory being imported by appending as environment variable within __init__.py Example: so instead of using import project.foo.bar for the following structure: 123456project/ __init__.py foo/ __init__.py bar/ b.py inside the __init__.py, we could do a sys.path.append(PATH_TO_BAR) so with this file structure, we can just do import project they could even add the import statement for us in the __init__.py, although it is not transparent. 12345project/ __init__.py foo/ bar/ b.py Note: Whatever gets appended last overrides the previous env variable, so import to the same name module will find the latest append Dot Notation (.) in Import 12345678910parent/ __init__.py file.py one/ __init__.py anotherfile.py two/ __init__.py three/ __init__.py Each dot in our import will refer to something inside the package, could be another package or a module. But it can’t be a class. Import python modules could look like: import parent.file or import parent.one.anotherfile From … import classes or functions look like this: from parent.file import class which gives us direct access to the class namespace, but not the example above. Import Order Based on PEP8, imports should be grouped by the following order: Standard library import Related third-party import Local application/library specific import What is Standard Library Imports? Standard library are installed automatically by Python installer, full documentation link is here: https://docs.python.org/3/library/ What is the order after grouping? There is no specific rules, but based on common preferences, use alphabetical order, with import first and from … import after 12345import abcimport defimport xfrom g import ggfrom x import xx Intra-package In a structure like this, how would you do import from another directory? say from module-x.py import module-a 12345678910top-package/ __init__.py sub-package-a/ __init__.py module-x.py module-y.py sub-package-b/ __init__.py module-a.py module-b.py Here’s some examples doing relative imports in module-x 123456import module-yfrom . import module-yfrom .module-y import classAfrom .. import sub-package-bfrom ..subpackage-b import module-afrom ..subpackage-b.module-a import classB Import an import It is a common practice in C# to use import module or static class to stores all the global variables used for settings, or even all the modules. In Python it would be something like: constant.py 1234567891011121314import module_aimport module_bimport module_cGLOBAL_VAR_MAX = 50GLOBAL_VAR_MIN = 10GLOBAL_VAR_TIMEOUT = 2000GLOBAL_NAME = r&#x27;random name&#x27;# or evenclass Constant(object): gravity = 9.8 is_true = True With this setup, all the module in the same project would just import the constant module and have access to all the imports and variable. I thought this was a neat way to make code cleaner by getting rid of all the duplicated imports that might happen. there are also some voices against it: based on the style guide: Constants are usually defined on a module level also, suggestions have mentioned to refrain from using class as it could be instantiated which makes no sense. unless there’s a valid reason for all those modules to be collected under a common name. If not, then they should be kept separately. This is due to documentation, as other people open our file, they don’t get information on what is getting imported (what is needed) Same module import multiple times So if multiple files are importing the same module separately, does python optimize the import? Yes, python modules are considered as singletons, no matter how many times we import them they get initialized only once. unless reload is being called Reference Stack Overflow - constants in Python: at the root of the module or in a namespace inside the module? Stack Overflow - in python, do you need to import modules in each split file? Stack Overflow - Python: Importing an “import file” Stack Overflow - Does python optimize modules when they are imported multiple times? Stack Overflow - Why can I import successfully without init.py? Stack Overflow - relative path not working even with init.py","categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"}],"tags":[{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"style","slug":"style","permalink":"https://www.xingyulei.com/tags/style/"}]},{"title":"(Hopefully) The Only Qt Template You'll Ever Need","slug":"qt-template","date":"2018-10-16T07:00:00.000Z","updated":"2023-09-02T18:02:02.838Z","comments":true,"path":"post/qt-template/","link":"","permalink":"https://www.xingyulei.com/post/qt-template/","excerpt":"","text":"General Template 12345678class Window(QtWidgets.QMainWindow): def __init__(self, parent=None): super(Window, self).__init__(parent) self.setAttribute(QtCore.Qt.WA_DeleteOnClose) self.setWindowFlags(self.windowFlags() | QtCore.Qt.WindowStaysOnTopHint) _loadUi(UI_PATH, self) Import Qt Modules if you are using PyQt5 binding: 12from PyQt5 import QtCore, QtGui, QtWidgetsfrom PyQt5.uic import loadUi if you are using PySide2 binding, here’s a wrapper I made which can be found here. I’m using Qt.py a Python 2 &amp; 3 shim around all Qt bindings, it just saves a lot of work. 12from Qt import QtCore, QtGui, QtWidgetsfrom Qt import _loadUi Using QApplication Launch as standalone application using QApplication, or if a QApplication instance exist, there’s no need to instantiate it. use QtWidgets.QApplication.instance() to check 12345678910if __name__ == &#x27;__main__&#x27;: import sys if QtWidgets.QApplication.instance(): window = ToolWindow() window.show() else: app = QtWidgets.QApplication(sys.argv) window = ToolWindow() window.show() sys.exit(app.exec_()) Close Event Delete Widget when Closed by default, closing the widget is hiding it not destroying the object 1&#123;WindowObject&#125;.setAttribute(QtCore.Qt.WA_DeleteOnClose) Unique Instance Raise existing instance (for example: widgets that are hidden during closeEvent); if no instance is available, create a new one. 12345678def show(): global WINDOW exists = WINDOW is not None if not exists: WINDOW = ToolWindow() WINDOW.showNormal() Other Register Style Sheet 123456def show(): ... APP = QtWidgets.QApplication(sys.argv) with open(PATH_TO_STYLESHEET, &#x27;r&#x27;) as f: qss = f.read() APP.setStyleSheet(qss) Register QResources QtCore.QResource.registerResource(PATH_TO_RCC) Maya Parent to Maya’s Main Window by default Qt window is not parented to Maya application 12345678910111213from shiboken2 import wrapInstancedef get_maya_main_window(): import maya.OpenMayaUI main_window_ptr = maya.OpenMayaUI.MQtUtil.mainWindow() return wrapInstance(long(main_window_ptr), QtWidgets.QMainWindow)class ModuleUI(QtWidgets.QMainWindow): def __init__(self, parent=get_maya_main_window()): super(ModuleUI, self).__init__(parent) _loadUi(UI_PATH, self) Window Docking Dockable Window The widget/window can now be docked into Maya’s main window; Auto-docking The above example of auto-docking may not work for certain Maya builds A workaround is to use the following method, but it only applies to QWidget type not QMainWindow type. Instantiate Widget When the UI has no parent (Maya main window), it will get instantly destroyed by the garbage collector, unless we keep an instance: 12345678# in the show functiondef show(): window = ModuleUI() window.show() return window# in maya script editorwin = moduleName.show() or using global variable to store the instance 1234567def show(): global window window = ModuleUI() window.show()# in maya script editormoduleName.show() Close Application in Maya 1234567def show(): if cmds.window(&#x27;xxx&#x27;, q=1, exists=1): cmds.deleteUI(&#x27;xxx&#x27;) global window window = somethingWindow() window.setObjectName(&#x27;xxx&#x27;) window.show() Error in PyCharm When this error occurs, it is due to MayaDevKit environment MayaDevKit allows maya python command auto-completion, remove it from PyCharm 12app = QtWidgets.QApplication(sys.argv)TypeError: &#x27;NoneType&#x27; object is not callable Unreal Engine 1234567891011import unrealdef show(): global app global window app = QtWidgets.QApplication.instance() or QtWidgets.QApplication(sys.argv) window = TestWindow() window.show() # this needs to happen before parenting unreal.parent_external_window_to_slate(int(window.winId())) Raise Existing Instance in the show() we need to return the window instance and assign it to a global variable: 12345# main.pydef show(): ... window.show() return window in the parent python command call (this maybe an Unreal menu command) 123from test import mainglobal editoreditor = main.show() Override closeEvent() To exit the Unreal Editor when Qt Window is closed: 123def closeEvent(self, event): QtWidgets.QMainWindow.closeEvent(event) unreal.SystemLibrary.execute_console_command(None, &quot;QUIT_EDITOR&quot;) To override at an instance level: 123456789import typesif __name__ == &quot;__main__&quot;: def _close_event(self, event): QtWidgets.QMainWindow.closeEvent(event) unreal.SystemLibrary.execute_console_command(None, &quot;QUIT_EDITOR&quot;) win = Window() win.closeEvent = types.MethodType(_close_event, win) Bonus: PySide2 UI Loading 12345678910111213141516171819202122232425262728from PySide2 import QtCore, QtWidgetsfrom PySide2.QtUiTools import QUiLoaderclass WrapperWindow(QtWidgets.QMainWindow): ui = &#x27;&#x27; def __init__(self, parent=None): super(WrapperWindow, self).__init__(parent) loader = QUiLoader() _file = QtCore.QFile(self.ui) _file.open(QtCore.QFile.ReadOnly) self.widget = loader.load(_file, parent) _file.close() self.setCentralWidget(self.widget)class Window(WrapperWindow): ui = &#x27;PATH_TO_UI_FILE&#x27; def __init__(self, parent=None): super(Window, self).__init__(parent) self.setCentralWidget(self.widget) # now we can access ui element like so self.widget.uiBtn.clicked.connect(self.someFunc) Reference Reddit - PyQt5 - Why do I get an Empty Window? Stack Overflow - pycharm use pyside2 TypeError: ‘NoneType’ object is not callable","categories":[{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"}],"tags":[{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"}]}],"categories":[{"name":"learning log","slug":"learning-log","permalink":"https://www.xingyulei.com/categories/learning-log/"},{"name":"tech summary","slug":"tech-summary","permalink":"https://www.xingyulei.com/categories/tech-summary/"},{"name":"unreal cinematic","slug":"unreal-cinematic","permalink":"https://www.xingyulei.com/categories/unreal-cinematic/"},{"name":"3d math","slug":"3d-math","permalink":"https://www.xingyulei.com/categories/3d-math/"},{"name":"maya communication","slug":"maya-communication","permalink":"https://www.xingyulei.com/categories/maya-communication/"},{"name":"graphics programming","slug":"graphics-programming","permalink":"https://www.xingyulei.com/categories/graphics-programming/"},{"name":"maya python api","slug":"maya-python-api","permalink":"https://www.xingyulei.com/categories/maya-python-api/"}],"tags":[{"name":"unreal","slug":"unreal","permalink":"https://www.xingyulei.com/tags/unreal/"},{"name":"python","slug":"python","permalink":"https://www.xingyulei.com/tags/python/"},{"name":"windows","slug":"windows","permalink":"https://www.xingyulei.com/tags/windows/"},{"name":"maya","slug":"maya","permalink":"https://www.xingyulei.com/tags/maya/"},{"name":"pipeline","slug":"pipeline","permalink":"https://www.xingyulei.com/tags/pipeline/"},{"name":"rendering","slug":"rendering","permalink":"https://www.xingyulei.com/tags/rendering/"},{"name":"server","slug":"server","permalink":"https://www.xingyulei.com/tags/server/"},{"name":"batch","slug":"batch","permalink":"https://www.xingyulei.com/tags/batch/"},{"name":"unity","slug":"unity","permalink":"https://www.xingyulei.com/tags/unity/"},{"name":"math","slug":"math","permalink":"https://www.xingyulei.com/tags/math/"},{"name":"threading","slug":"threading","permalink":"https://www.xingyulei.com/tags/threading/"},{"name":"pyqt","slug":"pyqt","permalink":"https://www.xingyulei.com/tags/pyqt/"},{"name":"template","slug":"template","permalink":"https://www.xingyulei.com/tags/template/"},{"name":"style","slug":"style","permalink":"https://www.xingyulei.com/tags/style/"},{"name":"socket","slug":"socket","permalink":"https://www.xingyulei.com/tags/socket/"},{"name":"command port","slug":"command-port","permalink":"https://www.xingyulei.com/tags/command-port/"},{"name":"c#","slug":"c","permalink":"https://www.xingyulei.com/tags/c/"},{"name":"c++","slug":"c","permalink":"https://www.xingyulei.com/tags/c/"}]}